[
  {
    "id": "C.1",
    "year": "2009",
    "title": "Recent development of computational design by software NIDA",
    "authors": [
      "Si-Wei Liu",
      "Yao-Peng Liu",
      "Bo Li",
      "Huan-Jian Mo",
      "Man Fong",
      "Siu-Lai Chan"
    ],
    "conference": "International Conference ICASS '09 / IJSSD / IStructE Asia-Pacific Forum Sixth International Conference on Advances in Steel Structures in conjunction with IJSSD symposium on Progress in Structural Stability and Dynamics & IStructE Asia-Pacific Forum, Hong Kong, China, 16-18 December 2009.",
    "APA": "Si-Wei Liu, Yao-Peng Liu, Bo Li, Huan-Jian Mo, Man Fong and Siu-Lai Chan. Recent development of computational design by software NIDA, International Conference ICASS '09 / IJSSD / IStructE Asia-Pacific Forum Sixth International Conference on Advances in Steel Structures in conjunction with IJSSD symposium on Progress in Structural Stability and Dynamics & IStructE Asia-Pacific Forum, Hong Kong, China, 16-18 December 2009."
  },
  {
    "id": "C.2",
    "year": "2009",
    "title": "Second-order analysis and design of wall-framed structures",
    "authors": [
      "Siu-Lai Chan",
      "Yao-Peng Liu",
      "Si-Wei Liu"
    ],
    "conference": "Academic Conference of China Steel Code published 35 years, Xi An, China, April 2009.",
    "APA": "Siu-Lai Chan, Yao-Peng Liu and Si-Wei Liu. Second-order analysis and design of wall-framed structures, Academic Conference of China Steel Code published 35 years, Xi An, China, April 2009."
  },
  {
    "id": "C.3",
    "year": "2009",
    "title": "Design of angle trusses - linear and second-order analysis",
    "authors": [
      "Siu-Lai Chan",
      "Man Fong",
      "Si-Wei Liu"
    ],
    "conference": "Academic Conference of the 9th Modern Structural Engineering Workshop, Ji-Nan, China, July 2009.  Last Updated: 2025/09/20",
    "APA": "Siu-Lai Chan, Man. Fong and Si-Wei Liu. Design of angle trusses - linear and second-order analysis, Academic Conference of the 9th Modern Structural Engineering Workshop, Ji-Nan, China, July 2009.  Last Updated: 2025/09/20"
  },
  {
    "id": "C.4",
    "year": "2010",
    "title": "Advanced analysis of hybrid frame structures by refined plastic-hinge approach",
    "authors": [
      "Siu-Lai Chan",
      "Si-Wei Liu",
      "Yao-Peng Liu"
    ],
    "conference": "4th International Conference on Steel & Composite Structures, Sydney, Australia, 21-23 July 2010.",
    "APA": "Siu-Lai Chan, Si-Wei Liu and Yao-Peng Liu. Advanced analysis of hybrid frame structures by refined plastic-hinge approach, 4th International Conference on Steel & Composite Structures, Sydney, Australia, 21-23 July 2010."
  },
  {
    "id": "C.5",
    "year": "2011",
    "title": "Structural design in the post-effective length era",
    "authors": [
      "Siu-Lai Chan",
      "Yao-Peng Liu",
      "Si-Wei Liu"
    ],
    "conference": "The Proceedings of the Twelfth East Asia-Pacific Conference on Structural Engineering and Construction EASEC12.",
    "APA": "Siu-Lai Chan, Yao-Peng Liu and Si-Wei Liu. Structural design in the post-effective length era, The Proceedings of the Twelfth East Asia-Pacific Conference on Structural Engineering and Construction EASEC12."
  },
  {
    "id": "C.6",
    "year": "2012",
    "title": "Unified design of steel",
    "authors": [
      "Siu-Lai Chan",
      "Si-Wei Liu",
      "Yao-Peng Liu"
    ],
    "conference": "concrete and composite structures by direct analysis, 10th International Conference on Advances in Steel Concrete Composite and Hybrid Structures, Singapore, 2-4 July 2012.",
    "APA": "Siu-Lai Chan, Si-Wei Liu and Yao-Peng Liu. Unified design of steel, concrete and composite structures by direct analysis, 10th International Conference on Advances in Steel Concrete Composite and Hybrid Structures, Singapore, 2-4 July 2012."
  },
  {
    "id": "C.7",
    "year": "2012",
    "title": "Second-order analysis for long span steel structure protecting a heritage building",
    "authors": [
      "Yao-Peng Liu",
      "Si-Wei Liu",
      "Zhi-Hua Zhou",
      "Siu-Lai Chan"
    ],
    "conference": "IJSSD Symposium 2012 on Progress in Structural Stability and Dynamic, Nanjing, China, 14-16 April 2012.",
    "APA": "Yao-Peng Liu, Si-Wei Liu, Zhi-Hua Zhou and Siu-Lai Chan. Second-order analysis for long span steel structure protecting a heritage building, IJSSD Symposium 2012 on Progress in Structural Stability and Dynamic, Nanjing, China, 14-16 April 2012."
  },
  {
    "id": "C.8",
    "year": "2013",
    "title": "Second-order plastic analysis of steel frames by a single element per member allowing for arbitrarily located plastic hinge",
    "authors": [
      "Si-Wei Liu",
      "Yao-Peng Liu",
      "Siu-Lai Chan"
    ],
    "conference": "The Pacific Structural Steel Conference (PSSC 2013), Singapore, 8-11 October 2013.",
    "APA": "Si-Wei Liu, Yao-Peng Liu and Siu-Lai Chan. Second-order plastic analysis of steel frames by a single element per member allowing for arbitrarily located plastic hinge, The Pacific Structural Steel Conference (PSSC 2013), Singapore, 8-11 October 2013."
  },
  {
    "id": "C.9",
    "year": "2015",
    "title": "A new codified theory of second-order direct analysis for steel and composite structures-from research to practice. 11th International Conference on Advances in Steel and Concrete Composite Structures Tsinghua University",
    "authors": [
      "Siu-Lai Chan",
      "Yao-Peng Liu",
      "Si-Wei Liu"
    ],
    "conference": "Beijing, China, 3-5 December 2015.",
    "APA": "Siu-Lai Chan, Yao-Peng Liu and Si-Wei Liu*. A new codified theory of second-order direct analysis for steel and composite structures-from research to practice. 11th International Conference on Advances in Steel and Concrete Composite Structures Tsinghua University, Beijing, China, 3-5 December 2015."
  },
  {
    "id": "C.10",
    "year": "2015",
    "title": "Direct analysis by an arbitrarily located plastic hinge element",
    "authors": [
      "Si-Wei Liu",
      "Yao-Peng Liu",
      "Siu-Lai Chan"
    ],
    "conference": "Eighth International Conference on advances in steel structures, Lisbon, Portugal, 22-24 July 2015.",
    "APA": "Si-Wei Liu, Yao-Peng Liu and Siu-Lai Chan. Direct analysis by an arbitrarily located plastic hinge element, Eighth International Conference on advances in steel structures, Lisbon, Portugal, 22-24 July 2015."
  },
  {
    "id": "C.11",
    "year": "2015",
    "title": "Stability design of imperfect steel and composite frames",
    "authors": [
      "Yao-Peng Liu",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "conference": "Eighth International Conference on advances in steel structures, Lisbon, Portugal, 22-24 July 2015.",
    "APA": "Yao-Peng Liu, Si-Wei Liu and Siu-Lai Chan. Stability design of imperfect steel and composite frames, Eighth International Conference on advances in steel structures, Lisbon, Portugal, 22-24 July 2015."
  },
  {
    "id": "C.12",
    "year": "2016",
    "title": "An efficient simulation-based design technique for tapered members via analytical Euler-Bounouli Elements",
    "authors": [
      "Rui Bai",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "conference": "Eighth International Conference on steel and aluminium structures, Hong Kong, China, 7-9 December 2016.",
    "APA": "Rui Bai, Si-Wei Liu and Siu-Lai Chan. An efficient simulation-based design technique for tapered members via analytical Euler-Bounouli Elements, Eighth International Conference on steel and aluminium structures, Hong Kong, China, 7-9 December 2016."
  },
  {
    "id": "C.13",
    "year": "2016",
    "title": "Research theory and practice of second order direct analysis for design of steel and composite structures. The International Colloquium on Stability and Ductility of Steel Structures",
    "authors": [
      "Siu-Lai Chan",
      "Yao-Peng Liu",
      "Siu-Lai Chan"
    ],
    "conference": "Timisoara, Romania, 29-31 May 2016.",
    "APA": "Siu-Lai Chan, Yao-Peng Liu and Si-Wei Liu*. Research theory and practice of second order direct analysis for design of steel and composite structures. The International Colloquium on Stability and Ductility of Steel Structures, Timisoara, Romania, 29-31 May 2016."
  },
  {
    "id": "C.14",
    "year": "2017",
    "title": "Efficient static and dynamic analysis of steel frames by one-element-per-member models. ce/papers",
    "authors": [
      "Si-Wei Liu",
      "Yao-Peng Liu",
      "Liang Chen",
      "Siu-Lai Chan"
    ],
    "conference": "1: 1133–1142. doi:10.1002/cepa.154.",
    "APA": "Si-Wei Liu, Yao-Peng Liu, Liang Chen and Siu-Lai Chan. (2017). Efficient static and dynamic analysis of steel frames by one-element-per-member models. ce/papers, 1: 1133–1142. doi:10.1002/cepa.154."
  },
  {
    "id": "C.15",
    "year": "2017",
    "title": "Direct analysis of steel frames with non-prismatic sections via tapered beam-column elements. ce/papers",
    "authors": [
      "Rui Bai",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "conference": "1: 3900–3909. doi:10.1002/cepa.446.",
    "APA": "Rui Bai, Si-Wei Liu and Siu-Lai Chan. (2017). Direct analysis of steel frames with non-prismatic sections via tapered beam-column elements. ce/papers, 1: 3900–3909. doi:10.1002/cepa.446."
  },
  {
    "id": "C.16",
    "year": "2018",
    "title": "Advanced beam-column elements for practicing design of structures using direct analysis method",
    "authors": [
      "Si-Wei Liu",
      "Wen-Long Gao",
      "Siu-Lai Chan"
    ],
    "conference": "ninth international conference on advances in steel structures (ICASS’2018), Hong Kong, China, 5-7 December 2018.",
    "APA": "Si-Wei Liu, Wen-Long Gao and Siu-Lai Chan. Advanced beam-column elements for practicing design of structures using direct analysis method, ninth international conference on advances in steel structures (ICASS’2018), Hong Kong, China, 5-7 December 2018."
  },
  {
    "id": "C.17",
    "year": "2018",
    "title": "Recent developments on the numerical algorithms for the analysis of steel and composite sections",
    "authors": [
      "Liang Chen",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "conference": "Ninth International Conference on Advances in Steel Structures (ICASS’2018), Hong Kong, China, 5-7 December 2018.",
    "APA": "Liang Chen, Si-Wei Liu and Siu-Lai Chan. Recent developments on the numerical algorithms for the analysis of steel and composite sections, Ninth International Conference on Advances in Steel Structures (ICASS’2018), Hong Kong, China, 5-7 December 2018."
  },
  {
    "id": "C.18",
    "year": "2018",
    "title": "Critical initial geometric imperfection and advanced beam column element for direct analysis method of tapered I-sections",
    "authors": [
      "Rui Bai",
      "Si-Wei Liu",
      "Lei Zhao",
      "Siu-Lai Chan"
    ],
    "conference": "Ninth International Conference on Advances in Steel Structures (ICASS’2018), Hong Kong, China, 5-7 December 2018.",
    "APA": "Rui Bai, Si-Wei Liu, Lei Zhao and Siu-Lai Chan. Critical initial geometric imperfection and advanced beam column element for direct analysis method of tapered I-sections, Ninth International Conference on Advances in Steel Structures (ICASS’2018), Hong Kong, China, 5-7 December 2018."
  },
  {
    "id": "C.19",
    "year": "2018",
    "title": "Modeling systems of unsymmetrical sections as doubly symmetric – how much does it matter?",
    "authors": [
      "Ronald D. Ziemian",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "conference": "Ninth International Conference on Advances in Steel Structures (ICASS’2018), Hong Kong, China, 5-7 December 2018.",
    "APA": "Ronald D. Ziemian, Si-Wei Liu and Siu-Lai Chan. Modeling systems of unsymmetrical sections as doubly symmetric – how much does it matter?, Ninth International Conference on Advances in Steel Structures (ICASS’2018), Hong Kong, China, 5-7 December 2018."
  },
  {
    "id": "C.20",
    "year": "2018",
    "title": "Second-order direct analysis of steel structures made of tapered members",
    "authors": [
      "Siu-Lai Chan",
      "Si-Wei Liu",
      "Yao-Peng Liu"
    ],
    "conference": "12th International Conference on Advances in Steel-Concrete Composite Structures (ASCCS 2018), Spain, 27-29 June 2018.",
    "APA": "Siu-Lai Chan, Si-Wei Liu and Yao-Peng Liu. Second-order direct analysis of steel structures made of tapered members, 12th International Conference on Advances in Steel-Concrete Composite Structures (ASCCS 2018), Spain, 27-29 June 2018."
  },
  {
    "id": "C.21",
    "year": "2018",
    "title": "Systems of members with thin-walled nonsymmetric sections – a contribution to the theory and analysis software",
    "authors": [
      "Ronald D. Ziemian",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "conference": "Eighth International Conference on Thin-walled structures − ICTWS 2018, Lisbon, Portugal, 24-27 July 2018.",
    "APA": "Ronald D. Ziemian, Si-Wei Liu and Siu-Lai Chan. Systems of members with thin-walled nonsymmetric sections – a contribution to the theory and analysis software, Eighth International Conference on Thin-walled structures − ICTWS 2018, Lisbon, Portugal, 24-27 July 2018."
  },
  {
    "id": "C.22",
    "year": "2019",
    "title": "Second-order direct analysis of long-span single-layer domes",
    "authors": [
      "Yao-Peng Liu",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "conference": "9th international conference on steel and aluminium structures, Bradford, UK, 3-5 July 2019.",
    "APA": "Yao-Peng Liu, Si-Wei Liu and Siu-Lai Chan. Second-order direct analysis of long-span single-layer domes, 9th international conference on steel and aluminium structures, Bradford, UK, 3-5 July 2019."
  },
  {
    "id": "C.23",
    "year": "2020",
    "title": "Dynamic analysis and seismic responses of industrial rack structures with perforated cold-formed steel columns using line elements",
    "authors": [
      "Wen-LongGao",
      "Si-Wei Liu",
      "Teoman Pekoz",
      "Ronald D. Ziemian",
      "James Crews"
    ],
    "conference": "Cold-Formed Steel Research Consortium – CFSRC 2020",
    "APA": "Gao, Wen-Long, Liu, Si-Wei, Pekoz, Teoman, Ziemian, Ronald D. and Crews, James. Dynamic analysis and seismic responses of industrial rack structures with perforated cold-formed steel columns using line elements, Cold-Formed Steel Research Consortium – CFSRC 2020"
  },
  {
    "id": "C.24",
    "year": "2020",
    "title": "Large deflection analysis of beam-columns with general sections using gaussian line-element method",
    "authors": [
      "Liang Chen",
      "",
      "Ahmed Abdelrahman"
    ],
    "conference": "Liu, Siwei*, Ziemian, Ronald D. and Chan, Siu-Lai, Large deflection analysis of beam-columns with general sections using gaussian line-element method, Cold-Formed Steel Research Consortium – CFSRC 2020",
    "APA": "Chen, Liang, Abdelrahman, A.H.A., Liu, Siwei, Ziemian, Ronald D. and Chan, Siu-Lai, Large deflection analysis of beam-columns with general sections using gaussian line-element method, Cold-Formed Steel Research Consortium – CFSRC 2020"
  },
  {
    "id": "C.25",
    "year": "2023",
    "title": "Direct analysis of steel members with nonsymmetric sections accounting for geometric and material nonlinearities",
    "authors": [
      "Wen-Long Gao",
      "Liang Chen",
      "Si-Wei Liu",
      "Ronald D. Ziemian"
    ],
    "conference": "Eleventh International Conference on Advances in Steel Structures, Kuching, Sarawak, Malaysia, 5-7 December 2023.",
    "APA": "Wen-Long Gao, Liang Chen, Si-Wei Liu and Ronald D. Ziemian. Direct analysis of steel members with nonsymmetric sections accounting for geometric and material nonlinearities, Eleventh International Conference on Advances in Steel Structures, Kuching, Sarawak, Malaysia, 5-7 December 2023."
  },
  {
    "id": "C.26",
    "year": "2023",
    "title": "Emerging machine-learning techniques for second-order analysis of steel members through physics-informed neural networks",
    "authors": [
      "Guanhua Li",
      "Liang Chen",
      "Weihang Ouyang",
      "Si-Wei Liu"
    ],
    "conference": "Eleventh International Conference on Advances in Steel Structures, Kuching, Sarawak, Malaysia, 5-7 December 2023.",
    "APA": "Guanhua Li, Liang Chen, Weihang Ouyang, and Si-Wei Liu. Emerging machine-learning techniques for second-order analysis of steel members through physics-informed neural networks, Eleventh International Conference on Advances in Steel Structures, Kuching, Sarawak, Malaysia, 5-7 December 2023."
  },
  {
    "id": "C.27",
    "year": "2023",
    "title": "Sophisticated second order analysis of steel members with nonsymmetric cross-sections and semirigid connections",
    "authors": [
      "Hao-Yi Zhang",
      "Goman Wai-Ming Ho",
      "Liang Chen",
      "Si-Wei Liu"
    ],
    "conference": "Eleventh International Conference on Advances in Steel Structures, Kuching, Sarawak, Malaysia, 5-7 December 2023",
    "APA": "Hao-Yi Zhang, Goman Wai-Ming Ho, Liang Chen, and Si-Wei Liu, Sophisticated second order analysis of steel members with nonsymmetric cross-sections and semirigid connections, Eleventh International Conference on Advances in Steel Structures, Kuching, Sarawak, Malaysia, 5-7 December 2023."
  },
  {
    "id": "C.28",
    "year": "2023",
    "title": "Rigorous second-order analysis o steel members with nonsymmetric cross-sections considering shear deformation",
    "authors": [
      "Si-Wei Liu",
      "Hao-Yi Zhang",
      "Liang Chen",
      "Ronald D Ziemian"
    ],
    "conference": "Eleventh International Conference on Advances in Steel Structures, Kuching, Sarawak, Malaysia, 5-7 December 2023.",
    "APA": "Si-Wei Liu, Hao-Yi Zhang, Liang Chen, and Ronald D. Ziemian, Rigorous second-order analysis o steel members with nonsymmetric cross-sections considering shear deformation, Eleventh International Conference on Advances in Steel Structures, Kuching, Sarawak, Malaysia, 5-7 December 2023."
  },
  {
    "id": "C.29",
    "year": "2023",
    "title": "design of steel structures with nonsymmetric sections by the direct analysis method",
    "authors": [
      "Ronald D. Ziemian",
      "Si-Wei Liu",
      "Liang Chen",
      "Wen-Long Gao"
    ],
    "conference": "Si-Wei Liu, Liang Chen and Wen-Long Gao, design of steel structures with nonsymmetric sections by the direct analysis method, Eleventh International Conference on Advances in Steel Structures, Kuching, Sarawak, Malaysia, 5-7 December 2023.",
    "APA": "Ronald D. Ziemian, Si-Wei Liu, Liang Chen and Wen-Long Gao, design of steel structures with nonsymmetric sections by the direct analysis method, Eleventh International Conference on Advances in Steel Structures, Kuching, Sarawak, Malaysia, 5-7 December 2023."
  },
  {
    "id": "C.30",
    "year": "2023",
    "title": "Recent research development in direct analysis method for stability design of modern steel structures with irregular cross-sections",
    "authors": [
      "Si-Wei Liu",
      "Liang Chen"
    ],
    "conference": "The 3rd ZHITU Symposium on Advances in Civil Engineering, The University of Tokyo, Japan, 20-22 August 2023",
    "APA": "Si-Wei Liu and Liang Chen, Recent research development in direct analysis method for stability design of modern steel structures with irregular cross-sections, The 3rd ZHITU Symposium on Advances in Civil Engineering, The University of Tokyo, Japan, 20-22 August 2023."
  },
  {
    "id": "C.31",
    "year": "2023",
    "title": "Implementation of emerging machine-learning techniques for second-order analysis of beam-columns through physics-informed neural networks",
    "authors": [
      "Weihang Ouyang",
      "Liang Chen",
      "Si-Wei Liu"
    ],
    "conference": "The 3rd ZHITU Symposium on Advances in Civil Engineering, The University of Tokyo, Japan, 20-22 August 2023",
    "APA": "Weihang Ouyang, Liang Chen, Si-Wei Liu, Implementation of emerging machine-learning techniques for second-order analysis of beam-columns through physics-informed neural networks, The 3rd ZHITU Symposium on Advances in Civil Engineering, The University of Tokyo, Japan, 20-22 August 2023."
  },
  {
    "id": "C.32",
    "year": "2024",
    "title": "Structural Design of the First 3D Metal Printing Structure in Hong Kong using WAAM: Innovation",
    "authors": [
      "Si-Wei Liu",
      "Anrui Liang",
      "Liang Chen",
      "Jake L.Y. Chan",
      "Siu-Lai Chan"
    ],
    "conference": "Challenges and Insights， ICES2024, 8-10 November 2024, Guangzhou, China",
    "APA": "Si-Wei Liu, Anrui Liang, Liang Chen, Jake L.Y. Chan, and Siu-Lai Chan. Structural Design of the First 3D Metal Printing Structure in Hong Kong using WAAM: Innovation, Challenges and Insights， ICES2024, 8-10 November 2024, Guangzhou, China"
  }
]