[
  {
    "id": "J.1",
    "year": "2008",
    "title": "Nonlinear buckling analysis and optimization design of Schwedler spherical reticulated shell",
    "publisher": "Sun Yat-sen University",
    "volume": "47",
    "pages": "85-88",
    "authors": [
      "Zuoqiu Liu",
      "Siwei Liu"
    ],
    "corresponding author": "Zuoqiu Liu",
    "journal": "Acta Scientiarum Naturalium Universitatis Sunyatseni",
    "abstract": "The governing equation of dynamic equilibrium for Schwedler type single-layer spherical reticulated shell is derived, and the eigenvalue control equations under linear and nonlinear conditions are discussed respectively; the natural vibration analysis of the structure is carried out, and the buckling modes and critical loads are obtained by using the nonlinear buckling analysis function of Ansys software. The results show that the buckling mode is closely related to the span-to-rise ratio, and the critical load decreases with the increase of the span-to-rise ratio. The genetic algorithm is used to optimize the section size, and the optimal section size and the corresponding critical load are obtained. The results show that the critical load increases with the increase of the section size, but the increase rate decreases gradually.",
    "keywords": [
      "Reticulated shell",
      "Nonlinear",
      "Buckling analysis",
      "Optimization design",
      "Genetic algorithm"
    ],
    "doi": "",
    "link": "",
    "APA": "Liu, Z., & Liu, S. (2008). Nonlinear buckling analysis and optimization design of Schwedler spherical reticulated shell. Acta Scientiarum Naturalium Universitatis Sunyatseni, 47(Suppl. 2), 85-88.",
    "cv": "Liu, Z., & Liu, S.* (2008). Nonlinear buckling analysis and optimization design of Schwedler spherical reticulated shell. Acta Scientiarum Naturalium Universitatis Sunyatseni, 47(Suppl. 2), 85-88.",
    "publication-date": "2008-10"
  },
  {
    "id": "J.2",
    "year": "2010",
    "title": "Pushover analysis by one element per member for performance-based seismic design",
    "publisher": "World Scientific Publishing Company",
    "volume": "10",
    "pages": "111-126",
    "authors": [
      "S. W. Liu",
      "Y. P. Liu",
      "S. L. Chan"
    ],
    "corresponding author": "S. L. Chan",
    "journal": "International Journal of Structural Stability and Dynamics",
    "abstract": "Nonlinear static (pushover) analysis is an effective and simple tool for evaluating the seismic response of structures and offers an attractive choice for the performance-based design. As such, it has generally been used in modern design due to its practicality. However, the nonlinear plastic design method consumes extensive computational effort for practical structures under numerous load cases. Thus, an efficient element capturing the nonlinear behavior of a beam-column will be useful. In this paper, the authors propose a practical pushover analysis procedure using a single element per member for seismic design. As an improvement to previous research works, both P-Δ and P-δ effects as well as initial imperfections in global and member levels are considered. Therefore, the section capacity check without the assumption of effective length is adequate for present design and the conventional individual element design is avoided. The uncertainty of the buckling effects and effective length method can be eliminated and so a more economical design can be achieved. Two benchmark steel frames of three-storey and nine-storey in FEMA 440 were analyzed to illustrate the validity of the proposed method to practice.",
    "keywords": [
      "Pushover analysis",
      "Second-order analysis",
      "Performance-based",
      "Plastic hinge"
    ],
    "doi": "10.1142/S0219455410003385",
    "link": "https://doi.org/10.1142/S0219455410003385",
    "weblink": "https://www.worldscientific.com/doi/epdf/10.1142/S0219455410003385",
    "APA": "Liu, S. W., Liu, Y. P., & Chan, S. L. (2010). Pushover analysis by one element per member for performance-based seismic design. International Journal of Structural Stability and Dynamics, 10(1), 111-126.",
    "cv": "Liu, S. W., Liu, Y. P., & Chan, S. L.* (2010). Pushover analysis by one element per member for performance-based seismic design. International Journal of Structural Stability and Dynamics, 10(1), 111-126.",
    "publication-date": "2010-03"
  },
  {
    "id": "J.3",
    "year": "2012",
    "title": "Advanced analysis of hybrid steel and concrete frames: Part 1: Cross-section analysis technique and second-order analysis",
    "publisher": "Elsevier Ltd.",
    "volume": "70",
    "pages": "326-336",
    "authors": [
      "Si-Wei Liu",
      "Yao-Peng Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Siu-Lai Chan",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "Hybrid frames composed of steel, concrete and composite members are widely used to-date due to their structural efficiency and economy as alternatives to traditional bare steel system, especially in high-rise buildings. However, the present design of this structural form is both inconvenient and inconsistent as it needs several separated design codes for bare steel (BS), reinforced concrete (RC) and steel-concrete composite (SCC) elements. This paper proposes a second-order design method which requires only section capacity check without the need of using prescriptive formulae in different codes for various structural forms. The member-based design using linear analysis and the effective length assumption is replaced by the iterative second-order analysis. The proposed method can be reliably used for verification of member resistance and structural performance of a hybrid frame. The sectional failure surface method is introduced for member strength checking. In the generation of failure surfaces of the arbitrarily shaped cross sections, the stress distribution along the concrete component is considered by an equivalent stress block or a number of segments and the entire structural steel section will be meshed into fibres for determination of section capacity. Verifications of the proposed integrated analysis and design method based on section capacity check are conducted using several examples with accuracy of the method demonstrated.",
    "keywords": [
      "Second-order",
      "Cross-section analysis",
      "Nonlinear",
      "Concrete",
      "Steel"
    ],
    "doi": "10.1016/j.jcsr.2011.09.003",
    "link": "https://doi.org/10.1016/j.jcsr.2011.09.003",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0143974X11002422",
    "APA": "Liu, S.-W., Liu, Y.-P., & Chan, S.-L. (2012). Advanced analysis of hybrid steel and concrete frames: Part 1: Cross-section analysis technique and second-order analysis. Journal of Constructional Steel Research, 70, 326-336.",
    "cv": "Liu, S.-W., Liu, Y.-P., & Chan, S.-L.* (2012). Advanced analysis of hybrid steel and concrete frames: Part 1: Cross-section analysis technique and second-order analysis. Journal of Constructional Steel Research, 70, 326-336.",
    "publication-date": "2012-03"
  },
  {
    "id": "J.4",
    "year": "2012",
    "title": "Advanced analysis of hybrid steel and concrete frames: Part 2: Refined plastic hinge and advanced analysis",
    "publisher": "Elsevier Ltd.",
    "volume": "70",
    "pages": "337-349",
    "authors": [
      "Si-Wei Liu",
      "Yao-Peng Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Siu-Lai Chan",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "Robust geometric and material nonlinear analysis of buildings under ultimate loads is a key to success of advanced analysis, performance-based seismic design and progressive collapse analysis. This is the second part of two companion papers about the advanced analysis of hybrid steel and concrete frames allowing for various effects such as initial imperfections, gradual cracking effect and geometrical and material nonlinearities. Besides the use of Pointwise–Equilibrium–Polynomial (PEP) element allowing for initial imperfections and the P–Δ–δ effects by one element per member, the plastic hinge approach is refined for modelling of material yielding. The cross-section analysis technique described in the companion paper is utilized in this paper for analysis of steel reinforced concrete (RC) and steel-concrete composite (SCC) sections. Cracking in concrete component, which has significant influence on structural deformation and internal force distribution, is considered by using the Branson's model combined with the concrete cracking fracture surface. The distinct feature of the proposed method is that it integrates the accurate cross-sectional analysis technique to the refined lumped plasticity approach such that a feasible and reliable solution can be obtained. Members with previous experimental results and a portal frame are studied and compared for validation of the proposed method.",
    "keywords": [
      "Refined plastic-hinge",
      "Second-order",
      "Composite",
      "Concrete",
      "Cracking"
    ],
    "doi": "10.1016/j.jcsr.2011.09.002",
    "link": "https://doi.org/10.1016/j.jcsr.2011.09.002",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0143974X11002410",
    "APA": "Liu, S.-W., Liu, Y.-P., & Chan, S.-L. (2012). Advanced analysis of hybrid steel and concrete frames: Part 2: Refined plastic hinge and advanced analysis. Journal of Constructional Steel Research, 70, 337-349.",
    "cv": "Liu, S.-W., Liu, Y.-P., & Chan, S.-L.* (2012). Advanced analysis of hybrid steel and concrete frames: Part 2: Refined plastic hinge and advanced analysis. Journal of Constructional Steel Research, 70, 337-349.",
    "publication-date": "2012-03"
  },
  {
    "id": "J.5",
    "year": "2014",
    "title": "Direct analysis by an arbitrarily-located-plastic-hinge element — Part 1: Planar analysis",
    "publisher": "Elsevier Ltd.",
    "volume": "103",
    "pages": "303–315",
    "authors": [
      "Si-Wei Liu",
      "Yao-Peng Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Siu-Lai Chan",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "This paper, as the first part of the two companion papers, proposes a new and curved beam-column element with arbitrarily-located plastic hinge for second-order inelastic or direct analysis of planar steel frames. Unlike the conventional plastic hinge element which requires two and more elements to capture the locations of plastic hinge along member length causing much inconvenience to model member initial imperfection, one proposed element per member is sufficient for an accurate analysis. The proposed element explicitly models the member initial imperfection allowing for member P-δ effect directly. The plastic hinge is simulated as a gradually softening spring and the corresponding formulae are presented. The additional degrees of freedom in the element are condensed so that the element can be easily incorporated into existing computer programs with dramatic improvement on numerical efficiency and accuracy. Finally, several examples are presented for verifying the accuracy and validity of the proposed element.",
    "keywords": [
      "Planar frame",
      "Buckling",
      "Initial imperfection",
      "Second-order",
      "Plastic"
    ],
    "doi": "10.1016/j.jcsr.2014.07.009",
    "link": "https://doi.org/10.1016/j.jcsr.2014.07.009",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0143974X14001989",
    "APA": "Liu, S.-W., Liu, Y.-P., & Chan, S.-L. (2014). Direct analysis by an arbitrarily-located-plastic-hinge element — Part 1: Planar analysis. Journal of Constructional Steel Research, 103, 303–315.",
    "cv": "Liu, S.-W., Liu, Y.-P., & Chan, S.-L.* (2014). Direct analysis by an arbitrarily-located-plastic-hinge element — Part 1: Planar analysis. Journal of Constructional Steel Research, 103, 303–315.",
    "publication-date": "2014-12"
  },
  {
    "id": "J.6",
    "year": "2014",
    "title": "Direct analysis by an arbitrarily-located-plastic-hinge element — Part 2: Spatial analysis",
    "publisher": "Elsevier Ltd.",
    "volume": "103",
    "pages": "316–326",
    "authors": [
      "Si-Wei Liu",
      "Yao-Peng Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Siu-Lai Chan",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "This is the part two of the two companion papers, which extends the element formulations and the applications of the curved ALH (Arbitrarily Located Hinge) element to three-dimensional space for direct analysis of the steel frames considering large deflection and inelastic behaviors. A simplified approach assuming the space frame to deform with finite but small rotations is adopted for extending the planar element to the three-dimensional space. The updated Lagrangian description and the incremental secant stiffness method are introduced for considering large deflection in the analysis, which is proven to be accurate and efficient in the convergence in iterations for equilibrium. Since the internal degrees of freedom of the proposed element are condensed, a significant reduction on the size of the global stiffness matrix can be achieved with improvement in numerical efficiency. Finally, examples are given for the verification of the proposed numerical method.",
    "keywords": [
      "Space frame",
      "Buckling",
      "Initial imperfection",
      "Second-order",
      "Plastic"
    ],
    "doi": "10.1016/j.jcsr.2014.07.010",
    "link": "https://doi.org/10.1016/j.jcsr.2014.07.010",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0143974X14001990",
    "APA": "Liu, S.-W., Liu, Y.-P., & Chan, S.-L. (2014). Direct analysis by an arbitrarily-located-plastic-hinge element — Part 2: Spatial analysis. Journal of Constructional Steel Research, 103, 316–326.",
    "cv": "Liu, S.-W., Liu, Y.-P., & Chan, S.-L.* (2014). Direct analysis by an arbitrarily-located-plastic-hinge element — Part 2: Spatial analysis. Journal of Constructional Steel Research, 103, 316–326.",
    "publication-date": "2014-12"
  },
  {
    "id": "J.7",
    "year": "2015",
    "title": "Cross-sectional analysis of arbitrary sections allowing for residual stresses",
    "publisher": "Techno-Press, Ltd.",
    "volume": "18",
    "pages": "985-1000",
    "authors": [
      "Tian-Ji Li",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Siu-Lai Chan",
    "journal": "Steel and Composite Structures",
    "abstract": "The method of cross-section analysis for different sections in a structural frame has been widely investigated since the 1960s for determination of sectional capacities of beam-columns. Many hand-calculated equations and design graphs were proposed for the specific shape and type of sections in pre-computer age decades ago. In design of many practical sections, these equations may be uneconomical and inapplicable for sections with irregular shapes, leading to the high construction cost or inadequate safety. This paper not only proposes a versatile numerical procedure for sectional analysis of beam-columns, but also suggests a method to account for residual stress and geometric imperfections separately and the approach is applied to design of high strength steels requiring axial force-moment interaction for advanced analysis or direct analysis. A cross-section analysis technique that provides interaction curves of arbitrary welded sections with consideration of the effects of residual stress by meshing the entire section into small triangular fibers is formulated. In this study, two doubly symmetric sections (box-section and H-section) fabricated by high-strength steel is utilized to validate the accuracy and efficiency of the proposed method against a hand-calculation procedure. The effects of residual stress are mostly not considered explicitly in previous works and they are considered in an explicit manner in this paper which further discusses the basis of the yield surface theory for design of structures made of high strength steels.",
    "keywords": [
      "Cross-sectional analysis",
      "High-strength steel",
      "Residual stress"
    ],
    "doi": "10.12989/scs.2015.18.4.985",
    "link": "https://doi.org/10.12989/scs.2015.18.4.985",
    "weblink": "http://www.techno-press.org/download.php?journal=scs&volume=18&num=4&ordernum=10",
    "APA": "Li, T.-J., Liu, S.-W., & Chan, S.-L. (2015). Cross-sectional analysis of arbitrary sections allowing for residual stresses. Steel and Composite Structures, 18(4), 985-1000.",
    "cv": "Li, T.-J., Liu, S.-W., & Chan, S.-L.* (2015). Cross-sectional analysis of arbitrary sections allowing for residual stresses. Steel and Composite Structures, 18(4), 985-1000.",
    "publication-date": "2015-04-25"
  },
  {
    "id": "J.8",
    "year": "2015",
    "title": "Direct analysis for high-strength steel frames with explicit-model of residual stresses",
    "publisher": "Elsevier Ltd.",
    "volume": "100",
    "pages": "342–355",
    "authors": [
      "Tian-Ji Li",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Siu-Lai Chan",
    "journal": "Engineering Structures",
    "abstract": "This paper proposes a direct analysis method (DAM) for design of high-strength steel members and frames allowing explicit modeling of residual stresses. A section analysis technique is derived taking into account for the effects of residual stress. Two distributed patterns of residual stress for the welded box-sections and H-sections fabricated by high-strength steel are discussed. To consider second-order effects associated with initial imperfections and the highly inelastic behavior along the member length, the curved arbitrarily-located-hinge (ALH) element is introduced. A plastic fiber hinge model using the sectional strength-iteration surfaces is proposed for capturing the material yielding. Finally, several examples are given for verifying the accuracy and validity of the proposed method. The distinct feature of this paper is about the development of a versatile numerical procedure accounting for residual stress and geometric imperfections separately and independently for stability design of high-strength steel members.",
    "keywords": [
      "Direct analysis",
      "High-strength steel",
      "Frames",
      "Second-order and nonlinear analysis",
      "Residual stresses"
    ],
    "doi": "10.1016/j.engstruct.2015.06.008",
    "link": "https://doi.org/10.1016/j.engstruct.2015.06.008",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0141029615003843",
    "APA": "Li, T.-J., Liu, S.-W., & Chan, S.-L. (2015). Direct analysis for high-strength steel frames with explicit-model of residual stresses. Engineering Structures, 100, 342–355.",
    "cv": "Li, T.-J., Liu, S.-W., & Chan, S.-L.* (2015). Direct analysis for high-strength steel frames with explicit-model of residual stresses. Engineering Structures, 100, 342–355.",
    "publication-date": "2015-10"
  },
  {
    "id": "J.9",
    "year": "2016",
    "title": "Second-order analysis of non-prismatic steel members by tapered beam–column elements",
    "publisher": "Institution of Structural Engineers. Published by Elsevier Ltd.",
    "volume": "6",
    "pages": "108–118",
    "authors": [
      "Si-Wei Liu",
      "Rui Bai",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Structures",
    "abstract": "Certain benefits in terms of the efficiency in material consumption can be achieved by adopting tapered steel members in long-span structures. In this paper, analytical solutions for second-order analysis of non-prismatic steel members by a series of tapered beam-column elements are firstly proposed. The exact stiffness matrices for five common types of tapered sections, e.g. circular solid, circular hollow, rectangular solid, rectangular hollow and symmetric I sections, are derived using the Hermite interpolation shape function and the co-rotational (CR) description to simplify the derivations and formulations. Large deformation is considered by the incremental secant stiffness method based on the updated Lagrangian approach. Descriptions for the kinematic motion using the CR description are elaborated. A distinct feature of the proposed method is to analytically express the flexural rigidity of tapered sections in the stiffness matrices using a series of stiffness factors, such as the αi and βi factors, accurately reflecting the stiffness variation along the member length. Several examples are presented to examine the validity and accuracy of the proposed formulations. The examples indicate that only two elements per member can produce very accurate analysis results, where the computational savings in the numerical procedure are considerable.",
    "keywords": [
      "Tapered",
      "Beam-column",
      "Steel",
      "Non-prismatic",
      "Design",
      "Analysis"
    ],
    "doi": "10.1016/j.istruc.2016.02.006",
    "link": "https://doi.org/10.1016/j.istruc.2016.02.006",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S2352012416000217",
    "APA": "Liu, S.-W., Bai, R., & Chan, S.-L. (2016). Second-order analysis of non-prismatic steel members by tapered beam–column elements. Structures, 6, 108–118.",
    "cv": "Liu, S.-W.*, Bai, R., & Chan, S.-L. (2016). Second-order analysis of non-prismatic steel members by tapered beam–column elements. Structures, 6, 108–118.",
    "publication-date": "2016-05"
  },
  {
    "id": "J.10",
    "year": "2016",
    "title": "Second-order Direct Analysis of Domelike Structures Consisting of Tapered Members with I-Sections",
    "publisher": "American Society of Civil Engineers",
    "volume": "142",
    "pages": "04016009",
    "authors": [
      "Si-Wei Liu",
      "Rui Bai",
      "Siu-Lai Chan",
      "Yao-Peng Liu"
    ],
    "corresponding author": "Siu-Lai Chan",
    "journal": "Journal of Structural Engineering",
    "abstract": "A new and advanced beam-column element, namely the curved tapered-three-hinges (TTH) beam-column element, is proposed in this paper. The present element can perform large deformation analysis and explicitly simulate the initial member curvature, which is essential for the second-order direct analysis using one-element-per-member models. Another distinct feature of the element is to analytically express the flexural rigidity of tapered I-sections in the stiffness matrix through a series of tapered stiffness factors such as the αi and βi factors. Unlike the conventional finite-element analysis using the approximated distributions (e.g., linear, parabolic, or cubic) or stepped-elements modeling approaches, the present study gives an accurate simulation solution on nonprismatic beam-column elements. Herein, the element derivations and formulations are given in detail. To consider the large deflection effect in the analysis, the incremental tangent stiffness method is adopted and the kinematic descriptions are presented. Finally, several examples are employed to validate and verify the reliability and accuracy of the proposed element.",
    "keywords": [
      "Tapered sections",
      "Nonlinear",
      "Steel",
      "Dome",
      "Element",
      "Analysis",
      "Analysis and computation"
    ],
    "doi": "10.1061/(ASCE)ST.1943-541X.0001464",
    "link": "https://doi.org/10.1061/(ASCE)ST.1943-541X.0001464",
    "weblink": "https://ascelibrary.org/doi/abs/10.1061/%2528ASCE%2529ST.1943-541X.0001464",
    "APA": "Liu, S.-W., Bai, R., Chan, S.-L., & Liu, Y.-P. (2016). Second-order Direct Analysis of Domelike Structures Consisting of Tapered Members with I-Sections. Journal of Structural Engineering, 142(5), 04016009.",
    "cv": "Liu, S.-W., Bai, R., Chan, S.-L.*, & Liu, Y.-P. (2016). Second-order Direct Analysis of Domelike Structures Consisting of Tapered Members with I-Sections. Journal of Structural Engineering, 142(5), 04016009.",
    "publication-date": "2016-05"
  },
  {
    "id": "J.11",
    "year": "2016",
    "title": "Behavior of Q690 high-strength steel columns: Part 2: Parametric study and design recommendations",
    "publisher": "Elsevier Ltd.",
    "volume": "122",
    "pages": "379–394",
    "authors": [
      "Tian-Ji Li",
      "Si-Wei Liu",
      "Guo-Qiang Li",
      "Siu-Lai Chan",
      "Yan-Bo Wang"
    ],
    "corresponding author": "Guo-Qiang Li",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "Prediction of the column strength, associated with buckling and material yielding, is vital in a successful design. In this paper, a completely numerical analysis technique is employed for simulating the compressive behavior of Q690 high-strength steel columns with box- and H-sections, and its accuracy is verified by the experimental results as presented in the part 1 of the companion papers. To this, the curved Pointwise-Equilibrating-Polynomial (PEP) is introduced for representing the column deformations with an explicit simulation on the member initial imperfection. Further, the refined plastic hinge model combined with the use of sectional yield surfaces is employed to reflect inelastic yielding at the critical location. A cross-sectional analysis approach allowing for residual stresses modeling is also incorporated into the numerical method. Sequentially, a parametric study is conducted extensively for the Q690 high-strength steel welded columns. At last, the buckling curves from Chinese (GB 50017-2003), European (Eurocode 3), and American (ANSI/AISC 360-10) codes are examined, and some recommendations for design of Q690 high-strength steel columns are presented.",
    "keywords": [
      "High-strength steel",
      "Imperfections",
      "Welded sections",
      "Residual stress",
      "Numerical analysis",
      "Design"
    ],
    "doi": "10.1016/j.jcsr.2016.03.027",
    "link": "https://doi.org/10.1016/j.jcsr.2016.03.027",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0143974X1630075X",
    "APA": "Li, T.-J., Liu, S.-W., Li, G.-Q., Chan, S.-L., & Wang, Y.-B. (2016). Behavior of Q690 high-strength steel columns: Part 2: Parametric study and design recommendations. Journal of Constructional Steel Research, 122, 379–394.",
    "cv": "Li, T.-J., Liu, S.-W., Li, G.-Q.*, Chan, S.-L., & Wang, Y.-B. (2016). Behavior of Q690 high-strength steel columns: Part 2: Parametric study and design recommendations. Journal of Constructional Steel Research, 122, 379–394.",
    "publication-date": "2016-07"
  },
  {
    "id": "J.12",
    "year": "2016",
    "title": "Dynamic Time-history Elastic Analysis of Steel Frames Using One Element per Member",
    "publisher": "Institution of Structural Engineers. Published by Elsevier Ltd.",
    "volume": "8",
    "pages": "300–309",
    "authors": [
      "Si-Wei Liu",
      "Rui Bai",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Structures",
    "abstract": "This paper proposes an efficient numerical simulation technique for dynamic time-history analysis of space steel frames by one-element-per-member model, considering geometric nonlinearity including P-Δ-δ effects, large global deflections and member deformations. The curved arbitrarily-located-hinge (ALH) beam-column element is employed for capturing members' behaviors and simulating initial imperfections, where the internal degree-of-freedoms (DOFs) are condensed for improving the computational efficiency. The consistent element mass matrix is derived based on the Hermite interpolation function, and the Rayleigh damping model is adopted for representing the system viscosity. To solve the equation of the time-history motion, a direct time-integration method via Newmark's algorithm is utilized for the step-by-step solution. A robust numerical procedure using the incremental secant stiffness method is introduced for the large deflection analysis of space frames, allowing arbitrary rotations in a three-dimensional space. Verification examples are given to validate the present model in handling dynamic behaviors of the steel frames and members under the transient actions. The distinct feature of the research is to propose an effective analytical framework using high-performance elements, dramatically improving the numerical efficiency and making the method being practical.",
    "keywords": [
      "Time-history",
      "Steel",
      "Analysis",
      "Dynamic",
      "Beam-column",
      "Element",
      "Numerical"
    ],
    "doi": "10.1016/j.istruc.2016.05.006",
    "link": "https://doi.org/10.1016/j.istruc.2016.05.006",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S2352012416300273",
    "APA": "Liu, S.-W., Bai, R., & Chan, S.-L. (2016). Dynamic Time-history Elastic Analysis of Steel Frames Using One Element per Member. Structures, 8, 300–309.",
    "cv": "Liu, S.-W.*, Bai, R., & Chan, S.-L. (2016). Dynamic Time-history Elastic Analysis of Steel Frames Using One Element per Member. Structures, 8, 300–309.",
    "publication-date": "2016-11"
  },
  {
    "id": "J.13",
    "year": "2017",
    "title": "A New Codified Design Theory of Second-order Direct Analysis for Steel and Composite Structures – From Research to Practice",
    "publisher": "Institution of Structural Engineers. Published by Elsevier Ltd.",
    "volume": "7",
    "pages": "1-7",
    "authors": [
      "Siu-Lai Chan",
      "Yao-Peng Liu",
      "Si-Wei Liu"
    ],
    "corresponding author": "Siu-Lai Chan",
    "journal": "Structures",
    "abstract": "The terms “Second-order Analysis” and “Direct Analysis” appear in many modern design codes but many engineers consider this as a method for checking only the second-order sway effect, nonlinear sway moment or a tool for academic research. This perception is incorrect in modern structural design and in fact this old approach is defined only as the second-order “indirect” analysis or P-Δ-only analysis. When used properly, the full second-order P-Δ-δ analysis method of design provides a reliable and proficient tool for practical design. Their underlying principle also carries a very different philosophy to the conventional design approach. This paper outlines the differences between the two design concepts, namely the first-order linear effective length method (ELM) and the second-order direct elastic or plastic analysis (SODEA and SODPA). The era for re-thinking our design and analysis philosophy seems to have arrived. In this paper, the experience and theory on using the new design concept and method are described with worked example given on their uses. Most previous works on second-order analysis do not provide reliable solutions to practical engineering problems, because they were not calibrated against benchmark solutions where the current design code is adequately accurate. As shown in the examples in this paper, the proposed design is able to reproduce some standard solutions of these benchmark examples so it can be used for practical design.",
    "keywords": [
      "Second-order direct analysis",
      "Buckling",
      "Nonlinear"
    ],
    "doi": "10.1016/j.istruc.2016.10.002",
    "link": "https://doi.org/10.1016/j.istruc.2016.10.002",
    "weblink": "https://www.istructe.org/sitefiles/handlers/downloadfile.ashx?productid=844",
    "APA": "Chan, S.-L., Liu, Y.-P., & Liu, S.-W. (2017). A New Codified Design Theory of Second-order Direct Analysis for Steel and Composite Structures – From Research to Practice. Structures, 7, 1-7.",
    "cv": "Chan, S.-L.*, Liu, Y.-P., & Liu, S.-W. (2017). A New Codified Design Theory of Second-order Direct Analysis for Steel and Composite Structures – From Research to Practice. Structures, 7, 1-7.",
    "publication-date": "2017-02"
  },
  {
    "id": "J.14",
    "year": "2017",
    "title": "Direct analysis of high-strength concrete-filled-tubular columns with circular & octagonal sections",
    "publisher": "Elsevier Ltd.",
    "volume": "129",
    "pages": "301–314",
    "authors": [
      "Si-Wei Liu",
      "Tak-Ming Chan",
      "Siu-Lai Chan",
      "Derek Kwok-Leung So"
    ],
    "corresponding author": "Siu-Lai Chan",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "High-strength-concrete (HSC) is brittle, but its ductility can be dramatically increased when confined by steel tubes. However, the size of hot-rolled tubular sections is commonly limited to 600 mm, its capacity as mega columns in many high-rise buildings is inadequate. This paper details the use of fabricated and rolled sections as mega-columns by the direct analysis of design (DAM) which is further presented for application with high-strength-concrete-filled-tubular (HCFT) columns of circular and octagonal sections allowing for confinement effects in concrete. To capture the material yielding behaviors and to allow for an explicit simulation on the member initial curvatures, a curved-piecewise-Hermite (CPH) element is especially developed for simulating the behaviors of HCFT columns under extreme loading conditions. A plastic-fiber-hinge-model using the sectional strength-iteration surfaces is proposed for capturing the yielding behavior at the hinge locations and the analytical method for generating the yield surfaces is elaborated. To this, one-element-per-member is sufficient for numerical simulation; and the savings in computer time are considerable, making the proposed theory practical. The material model for the HSC in steel tubes is essential for a successful design. To this, an experiment on two groups of confined specimens, e.g. circular and octagonal, is established for investigating the properties of HSC, and an approximated calculation method is proposed and validated with the experiments. Consequently, the corresponding stress vs. strain relations of the confined HSC can be determined for use in analysis. Finally, examples are given for verifying and validating the proposed method for HCFT columns with circular and octagonal sections.",
    "keywords": [
      "Direct analysis",
      "Element",
      "High-strength concrete",
      "Nonlinear",
      "Octagonal",
      "Steel"
    ],
    "doi": "10.1016/j.jcsr.2016.11.023",
    "link": "https://doi.org/10.1016/j.jcsr.2016.11.023",
    "weblink": "http://ira.lib.polyu.edu.hk/bitstream/10397/101276/1/Chan_Direct_Analysis_High-strength.pdf",
    "APA": "Liu, S.-W., Chan, T.-M., Chan, S.-L., & So, D. K.-L. (2017). Direct analysis of high-strength concrete-filled-tubular columns with circular & octagonal sections. Journal of Constructional Steel Research, 129, 301–314.",
    "cv": "Liu, S.-W., Chan, T.-M., Chan, S.-L.*, & So, D. K.-L. (2017). Direct analysis of high-strength concrete-filled-tubular columns with circular & octagonal sections. Journal of Constructional Steel Research, 129, 301–314.",
    "publication-date": "2017-02"
  },
  {
    "id": "J.15",
    "year": "2017",
    "title": "Divergence-free algorithms for moment-thrust-curvature analysis of arbitrary sections",
    "publisher": "Techno-Press, Ltd.",
    "volume": "25",
    "pages": "557-569",
    "authors": [
      "Liang Chen",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Steel and Composite Structures",
    "abstract": "Moment-thrust-curvatures (M-P-Φ curves) are fundamental quantities for detailed descriptions of basic properties such as stiffness and strength of a section under axial loads required for accurate computation of the deformations of reinforced concrete or composite columns. Currently, the finite-element-based methods adopting small fibers for analyzing a section are commonly used for generating the M-P-Φ curves and they require large amounts of computational time and effort. Further, the conventional numerical procedure using the force-control method might encounter divergence problems under high compression or tension. Therefore, this paper proposes a divergence-free approach, combining the use of the displacement-control and the Quasi-Newton scheme in the incremental-iterative procedure, for generating the M-P-Φ curves of arbitrary sections. An efficient method for computing the strength from concrete components is employed, where the stress integration is executed by layer-based algorithms. For easy modeling of residual stress, cross sections of structural steel components are meshed into fibers for strength resultants. The numerical procedure is elaborated in detail with flowcharts. Finally, extensive validating examples from previously published research are given for verifying the accuracy of the proposed method.",
    "keywords": [
      "Composite",
      "Steel",
      "Section",
      "Numerical",
      "Concrete",
      "Moment-curvature analysis"
    ],
    "doi": "10.12989/scs.2017.25.5.557",
    "link": "https://doi.org/10.12989/scs.2017.25.5.557",
    "weblink": "http://www.techno-press.org/download.php?journal=scs&volume=25&num=5&ordernum=4",
    "APA": "Chen, L., Liu, S.-W., & Chan, S.-L. (2017). Divergence-free algorithms for moment-thrust-curvature analysis of arbitrary sections. Steel and Composite Structures, 25(5), 557-569.",
    "cv": "Chen, L., Liu, S.-W.*, & Chan, S.-L. (2017). Divergence-free algorithms for moment-thrust-curvature analysis of arbitrary sections. Steel and Composite Structures, 25(5), 557-569.",
    "publication-date": "2017-12-10"
  },
  {
    "id": "J.16",
    "year": "2018",
    "title": "Modal and Elastic Time-History Analysis of Frames with Tapered Sections by Non-Prismatic Elements",
    "publisher": "World Scientific Publishing Company",
    "volume": "18",
    "pages": "1850106",
    "authors": [
      "Rui Bai",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "International Journal of Structural Stability and Dynamics",
    "abstract": "Low-cost robotic welding and wide availability of high strength steel plates of grades over 500 MPa make the use of tapered members an economical alternative to conventional prismatic members for modern steel structures, as experienced by the authors in some practical projects in Hong Kong and Macau. This paper proposes a new and efficient numerical method for modal and elastic time-history analysis of the frames with tapered sections. A series of non-prismatic elements is derived on the basis of analytical expressions, and the exact consistent mass and tangent stiffness matrices are formulated. Five common types of tapered sections for practical applications, namely the circular solid, circular hollow, rectangular solid, rectangular hollow and doubly symmetric-I sections, are studied. Contrary to the conventional method using the approximate assumptions for the section properties along the member length, this research analytically expresses the flexural rigidity and cross-sectional area for the stiffness and mass matrices of an element. When the indexes are set to zero, the matrices are identical to those of the conventional prismatic elements. The techniques for obtaining the dynamic performances, such as natural vibrations and time-history responses, of non-prismatic members are investigated. Finally, three examples are conducted for validating and verifying the accuracy of the proposed formulations. The present work can be used in the dynamic response analysis of frame structures with tapered sections in seismic zones.",
    "keywords": [
      "Dynamics",
      "Frame",
      "Non-prismatic element",
      "Mass matrix",
      "Natural frequency",
      "Time-history analysis"
    ],
    "doi": "10.1142/S0219455418501067",
    "link": "https://doi.org/10.1142/S0219455418501067",
    "weblink": "https://www.worldscientific.com/doi/epdf/10.1142/S0219455418501067",
    "APA": "Bai, R., Liu, S.-W., & Chan, S.-L. (2018). Modal and Elastic Time-History Analysis of Frames with Tapered Sections by Non-Prismatic Elements. International Journal of Structural Stability and Dynamics, 18(9), 1850106.",
    "cv": "Bai, R., Liu, S.-W.*, & Chan, S.-L. (2018). Modal and Elastic Time-History Analysis of Frames with Tapered Sections by Non-Prismatic Elements. International Journal of Structural Stability and Dynamics, 18(9), 1850106.",
    "publication-date": "2018-09"
  },
  {
    "id": "J.17",
    "year": "2018",
    "title": "Finite-element implementation for nonlinear static and dynamic frame analysis of tapered members",
    "publisher": "Elsevier Ltd.",
    "volume": "172",
    "pages": "358–381",
    "authors": [
      "Rui Bai",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Engineering Structures",
    "abstract": "Non-prismatic members are popular for civil engineering structures. This paper derives a set of unified beam-column formulations for nonlinear static and dynamic analyses of the structures made of members with tapered sections, addressing the problems in engineering design practices. The element shape-functions are established upon the local-axes by extracting the rigid-body movements for simplifying mathematical expressions. To represent the variations in the stiffness gradients of tapered sections, the tapered-variability indexes are proposed. The generalized tangent stiffness and consistent mass matrices are developed based on the indexes. When analyzing non-prismatic members, the conventional method for handling member loads is inapplicable because it is derived for prismatic sections. Therefore, a new approach for converting the member loads acting on tapered members into the equivalent nodal forces is proposed based on the energy conservation principle. To consider the offsets in section axes, the eccentricity matrices are employed. For allowing large deflections, the incremental secant-stiffness method (ISM) based on Updated-Lagrangian (UL) description is proposed. Finally, extensive examples are provided for validating the accuracy and efficiency of the proposed element formulations in solving both the static and dynamic nonlinear problems.",
    "keywords": [
      "Non-prismatic members",
      "Tapered sections",
      "Numerical",
      "Nonlinear analysis",
      "Beam-column elements",
      "Dynamics",
      "Large deflection"
    ],
    "doi": "10.1016/j.engstruct.2018.05.088",
    "link": "https://doi.org/10.1016/j.engstruct.2018.05.088",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0141029617325238",
    "APA": "Bai, R., Liu, S.-W., & Chan, S.-L. (2018). Finite-element implementation for nonlinear static and dynamic frame analysis of tapered members. Engineering Structures, 172, 358–381.",
    "cv": "Bai, R., Liu, S.-W.*, & Chan, S.-L. (2018). Finite-element implementation for nonlinear static and dynamic frame analysis of tapered members. Engineering Structures, 172, 358–381.",
    "publication-date": "2018-10"
  },
  {
    "id": "J.18",
    "year": "2018",
    "title": "Bifurcation and large-deflection analyses of thin-walled beam-columns with non-symmetric open-sections",
    "publisher": "Elsevier Ltd.",
    "volume": "132",
    "pages": "287–301",
    "authors": [
      "Si-Wei Liu",
      "Ronald D. Ziemian",
      "Liang Chen",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Thin-Walled Structures",
    "abstract": "Non-symmetric thin-walled open-sections are used extensively in metal structures. The behaviour of such sections is usually complex because their shear centre and centroid do not coincide, and as a result, they are often susceptible to lateral-torsional and/or flexural-torsional buckling. This paper develops an efficient and robust computational framework for practical application, including a refined beam-column element for non-symmetric sections, a cross-section analysis algorithm for determining pertinent properties of open-sections, and an Updated-Lagrangian (UL) solution method for large deflection analysis. Details of the derivation of element stiffness matrices and the related numerical procedures are provided. Several examples are given that demonstrate accurate results from its implementation within the educational structural analysis software MASTAN2.",
    "keywords": [
      "Steel",
      "Thin-walled",
      "Warping",
      "Wagner effects",
      "Buckling",
      "Elements",
      "Geometric nonlinear analysis",
      "Open sections"
    ],
    "doi": "10.1016/j.tws.2018.07.044",
    "link": "https://doi.org/10.1016/j.tws.2018.07.044",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0263823118302422",
    "APA": "Liu, S.-W., Ziemian, R. D., Chen, L., & Chan, S.-L. (2018). Bifurcation and large-deflection analyses of thin-walled beam-columns with non-symmetric open-sections. Thin-Walled Structures, 132, 287–301.",
    "cv": "Liu, S.-W.*, Ziemian, R. D., Chen, L., & Chan, S.-L. (2018). Bifurcation and large-deflection analyses of thin-walled beam-columns with non-symmetric open-sections. Thin-Walled Structures, 132, 287–301.",
    "publication-date": "2018-11"
  },
  {
    "id": "J.19",
    "year": "2018",
    "title": "Curved-quartic-function elements with end-springs in series for direct analysis of steel frames",
    "publisher": "Techno-Press, Ltd.",
    "volume": "29",
    "pages": "623-633",
    "authors": [
      "Si-Wei Liu",
      "Jake Lok Yan Chan",
      "Rui Bai",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Rui Bai",
    "journal": "Steel and Composite Structures",
    "abstract": "A robust element is essential for successful design of steel frames with Direct analysis (DA) method. To this end, an innovative and efficient curved-quartic-function (CQF) beam-column element using the fourth-order polynomial shape function with end-springs in series is proposed for practical applications of DA. The member initial imperfection is explicitly integrated into the element formulation, and, therefore, the P-δ effect can be directly captured in the analysis. The series of zero-length springs are placed at the element ends to model the effects of semi-rigid joints and material yielding. One-element-per-member model is adopted for design bringing considerable savings in computer expense. The incremental secant stiffness method allowing for large deflections is used to describe the kinematic motion. Finally, several problems are studied in this paper for examining and validating the accuracy of the present formulations. The proposed element is believed to make DA simpler to use than existing elements, which is essential for its successful and widespread adoption by engineers.",
    "keywords": [
      "Second-order",
      "Steel",
      "Imperfection",
      "Semi-rigid",
      "Design",
      "Plastic hinge"
    ],
    "doi": "10.12989/scs.2018.29.5.623",
    "link": "https://doi.org/10.12989/scs.2018.29.5.623",
    "weblink": "https://www.researchgate.net/profile/Rui-Bai-5/publication/329156258_Curved-quartic-function_elements_with_end-springs_in_series_for_direct_analysis_of_steel_frames/links/5d4f7f5c92851cd046ae6a80/Curved-quartic-function-elements-with-end-springs-in-series-for-direct-analysis-of-steel-frames.pdf",
    "APA": "Liu, S.-W., Chan, J. L. Y., Bai, R., & Chan, S.-L. (2018). Curved-quartic-function elements with end-springs in series for direct analysis of steel frames. Steel and Composite Structures, 29(5), 623-633.",
    "cv": "Liu, S.-W., Chan, J. L. Y., Bai, R.*, & Chan, S.-L. (2018). Curved-quartic-function elements with end-springs in series for direct analysis of steel frames. Steel and Composite Structures, 29(5), 623-633.",
    "publication-date": "2018-12-10"
  },
  {
    "id": "J.20",
    "year": "2019",
    "title": "Direct analysis of tapered-I-section columns by one-element-per-member models with the appropriate geometric-imperfections",
    "publisher": "Elsevier Ltd.",
    "volume": "183",
    "pages": "907–921",
    "authors": [
      "Rui Bai",
      "Si-Wei Liu",
      "Yao-Peng Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Engineering Structures",
    "abstract": "In the structural stability design using direct analysis method (DM), the member initial geometric imperfections should be explicitly simulated. In current design practices, the imperfection shape is usually assumed as a half-sinusoidal curve. For the design of tapered columns, however, the use of this initial configuration may over-estimate the buckling strength. Therefore, a generalized imperfection shape function is proposed for the practical design of tapered I-section columns. A new beam-column element by incorporating this imperfection shape-function, named the Tapered-Compound-Curved (TCC) element, is developed for tapered symmetric-I sections. The analytical expressions of the flexural stiffness are adopted in the element derivation. The one-element-per-member modeling method with the TTC element is proposed for practical applications. Examples verifying the proposed equations are provided, and the influences of different imperfection shapes are assessed.",
    "keywords": [
      "Geometric imperfection",
      "Direct analysis method",
      "Tapered column",
      "Steel",
      "Geometrically nonlinear"
    ],
    "doi": "10.1016/j.engstruct.2019.01.021",
    "link": "https://doi.org/10.1016/j.engstruct.2019.01.021",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0141029618330396",
    "APA": "Bai, R., Liu, S.-W., Liu, Y.-P., & Chan, S.-L. (2019). Direct analysis of tapered-I-section columns by one-element-per-member models with the appropriate geometric-imperfections. Engineering Structures, 183, 907–921.",
    "cv": "Bai, R., Liu, S.-W.*, Liu, Y.-P., & Chan, S.-L. (2019). Direct analysis of tapered-I-section columns by one-element-per-member models with the appropriate geometric-imperfections. Engineering Structures, 183, 907–921.",
    "publication-date": "2019-03"
  },
  {
    "id": "J.21",
    "year": "2019",
    "title": "Theory and application of the direct analysis method for tapered members with I sections",
    "publisher": "",
    "volume": "49",
    "pages": "65-71",
    "authors": [
      "Bai Rui",
      "Liu Siwei",
      "Liu Yaopeng",
      "Chan Siulai"
    ],
    "corresponding author": "Liu Siwei",
    "journal": "Building Structure",
    "abstract": "Due to the material efficiency and the aesthetic appearance, the tapered members have been widely used in long-span structures, such as the portal frame, facade, bridge and reticulated shell. The conventional design method of tapered members is developed based on the empirical linear analysis approach with the effective length assumption and is only applicable to the web-tapered members. Moreover, the analysis method may incorrectly evaluate the member deflection and internal forces in complicated structures. To remedy the insufficiencies, the direct analysis method (DAM) with one-element-pre-member modeling approach was developed. Based on the theory of the finite element method, an advanced tapered Euler-Bernoulli beam-column element was derived. The function to represent the most critical initial geometric imperfection was presented. The flexural buckling design of tapered columns with the proposed method was demonstrated. Compared to the conventional method, the advanced method is more reliable and efficient and can be applied to the tapered members with any tapering scenarios.",
    "keywords": [
      "Tapered member",
      "Direct analysis method",
      "Beam-column element",
      "Initial geometric imperfection",
      "Flexural buckling",
      "Second-order effects"
    ],
    "doi": "10.19701/j.jzjg.2019.16.012",
    "link": "https://doi.org/10.19701/j.jzjg.2019.16.012",
    "APA": "Bai, R., Liu, S., Liu, Y., & Chan, S. (2019). Theory and application of the direct analysis method for tapered members with I sections. Building Structure, 49(16), 65-71.",
    "cv": "Bai, R., Liu, S.*, Liu, Y., & Chan, S. (2019). Theory and application of the direct analysis method for tapered members with I sections. Building Structure, 49(16), 65-71.",
    "publication-date": "2019-08"
  },
  {
    "id": "J.22",
    "year": "2019",
    "title": "Nonlinear finite-element-analysis and design of steel-concrete composite ring (SCCR) joints",
    "publisher": "Elsevier Ltd.",
    "volume": "161",
    "pages": "400–415",
    "authors": [
      "Liang Chen",
      "Si-Wei Liu",
      "Chi-Kin Lau",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "Conventional steel-plates-strengthened-composite ring (SPSC) joints are extensively used in composite structures to connect concrete-filled tubular (CFT) columns and reinforced concrete (RC) beams. However, the refinancing-bars of the adjacent beams require on-site welding to the steel strengthened plates of the SPSC joint, which, regarding workmanship, is difficult and time-consuming. Recently, a new type of joint, the steel-concrete-composite-ring (SCCR) joint, has been proposed as a substitute for the SPSC joint since it has been successfully used in several construction projects in Hong Kong. An SCCR joint consists of a steel tube, a concrete ring beam with reinforcements in both the radial and hoop directions, and shear studs. This research develops a sophisticated Finite-Element (FE) modelling method for SCCR joints, where the dominant factors affecting the joint's behaviors are considered, such as the explicit simulation of the complex reinforced bar details and shear studs, the cracking and crushing of concrete, the yielding of reinforced bars, and the contact behaviors between the steel tube and the concrete. From the FE analysis results, four possible failure modes are identified. Parametric studies are sequentially conducted in regard to these modes, yielding corresponding design eqs. A design procedure developed through the proposed equations is illustrated with a flowchart. Finally, a real-world example project is presented and further validated by sophisticated FE analysis.",
    "keywords": [
      "Finite element method",
      "Composite joint",
      "Nonlinear",
      "Design",
      "Analysis",
      "Concrete"
    ],
    "doi": "10.1016/j.jcsr.2019.07.012",
    "link": "https://doi.org/10.1016/j.jcsr.2019.07.012",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0143974X19302758",
    "APA": "Chen, L., Liu, S.-W., Lau, C.-K., & Chan, S.-L. (2019). Nonlinear finite-element-analysis and design of steel-concrete composite ring (SCCR) joints. Journal of Constructional Steel Research, 161, 400–415.",
    "cv": "Chen, L., Liu, S.-W.*, Lau, C.-K., & Chan, S.-L. (2019). Nonlinear finite-element-analysis and design of steel-concrete composite ring (SCCR) joints. Journal of Constructional Steel Research, 161, 400–415.",
    "publication-date": "2019-10"
  },
  {
    "id": "J.23",
    "year": "2019",
    "title": "Improved line-element formulations for the stability analysis of arbitrarily-shaped open-section beam-columns",
    "publisher": "Elsevier Ltd.",
    "volume": "144",
    "pages": "106290",
    "authors": [
      "Si-Wei Liu",
      "Wen-Long Gao",
      "Ronald D. Ziemian"
    ],
    "corresponding author": "Ronald D. Ziemian",
    "journal": "Thin-Walled Structures",
    "abstract": "Open-sections are often used in structural applications because of their material efficiency in providing members of high strength and stiffness. Although previous research has made significant progress in accounting for the effects when the shear-center and centroid are not coincident for such sections, the compression buckling strengths of non-symmetric sections, for example unequal-leg angles, are sometimes over- or under-predicted unless their principal axes’ properties are properly defined. This paper improves existing beam-column line-element formulations for accurately simulating the axial buckling behavior of arbitrarily-shaped open-sections. Detailed derivations are given and implemented within the educational software MASTAN2. Several verification examples are provided.",
    "keywords": [
      "Finite-element method",
      "Open-sections",
      "Buckling",
      "Warping",
      "Wagner effects",
      "Second-order analysis"
    ],
    "doi": "10.1016/j.tws.2019.106290",
    "link": "https://doi.org/10.1016/j.tws.2019.106290",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S026382311930435X",
    "APA": "Liu, S.-W., Gao, W.-L., & Ziemian, R. D. (2019). Improved line-element formulations for the stability analysis of arbitrarily-shaped open-section beam-columns. Thin-Walled Structures, 144, 106290.",
    "cv": "Liu, S.-W., Gao, W.-L., & Ziemian, R. D.* (2019). Improved line-element formulations for the stability analysis of arbitrarily-shaped open-section beam-columns. Thin-Walled Structures, 144, 106290.",
    "publication-date": "2019-11"
  },
  {
    "id": "J.24",
    "year": "2019",
    "title": "Flexural Buckling Strength of Tapered-I-Section Steel Columns Based on ANSI/AISC-360-16",
    "publisher": "World Scientific Publishing Company",
    "volume": "19",
    "pages": "1950134",
    "authors": [
      "Rui Bai",
      "Si-Wei Liu",
      "Siu-Lai Chan",
      "Feng Yu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "International Journal of Structural Stability and Dynamics",
    "abstract": "Steel tapered-I-columns are popular in modern buildings due to its material efficiency and the convenience in construction. For evaluating the flexural buckling strength of these columns, the current design methods with empirical and idealized assumptions are sometimes unreliable, especially for slender columns with significant tapering ratios. To accurately calculate the flexural buckling resistance, this paper proposes a numerical framework for tapered-I-sections. The direct analysis method (DM) with the non-prismatic high-order beam-column elements considering the factors, including the second-order effects, the geometric imperfections, and the residual stresses is developed. A new shape-function representing the most critical initial out-of-straightness curve of a tapered member is adopted. An advanced non-prismatic beam-column element incorporating this imperfection shape-function named the curved tapered-three-hinges (TTH) element is derived. With the availability of the internal degree-of-freedoms, the one-element-per-member (OEPM) modeling method is permitted. Sequentially, a series of parametric studies using the proposed numerical method are conducted for generating the buckling curves for the non-prismatic columns with various tapered-stiffness ratios. The sophisticated finite-element method is adopted to verify the proposed numerical framework.",
    "keywords": [
      "Tapered member",
      "Buckling",
      "Direct analysis",
      "Geometric imperfections",
      "Residual stresses"
    ],
    "doi": "10.1142/S0219455419501347",
    "link": "https://doi.org/10.1142/S0219455419501347",
    "weblink": "https://www.worldscientific.com/doi/pdf/10.1142/S0219455419501347",
    "APA": "Bai, R., Liu, S.-W., Chan, S.-L., & Yu, F. (2019). Flexural Buckling Strength of Tapered-I-Section Steel Columns Based on ANSI/AISC-360-16. International Journal of Structural Stability and Dynamics, 19(11), 1950134.",
    "cv": "Bai, R., Liu, S.-W.*, Chan, S.-L., & Yu, F. (2019). Flexural Buckling Strength of Tapered-I-Section Steel Columns Based on ANSI/AISC-360-16. International Journal of Structural Stability and Dynamics, 19(11), 1950134.",
    "publication-date": "2019-11"
  },
  {
    "id": "J.25",
    "year": "2019",
    "title": "Efficient beam–column finite-element method for stability design of slender single pile in soft ground mediums",
    "publisher": "American Society of Civil Engineers",
    "volume": "20",
    "pages": "04019148",
    "authors": [
      "Si-Wei Liu",
      "Jian-Hong Wan",
      "Cui-Ying Zhou",
      "Zhen Liu",
      "Xu Yang"
    ],
    "corresponding author": "Zhen Liu",
    "journal": "International Journal of Geomechanics",
    "abstract": "Slender single piles are extensively used but susceptible to buckling when embedded in soft ground mediums. Owing to the complexity of soil properties, the soil-structure interaction (SSI) response is sometimes very complicated, but its consideration is essential in the design of slender piles. Current design practice relies on either empirical-based linear analysis approaches or sophisticated finite-element methods, which are overconservative or time-consuming, respectively. Therefore, this paper derives a new Euler-Bernoulli element by adopting Winkler-type continuous springs along the element length for considering SSI responses, eliminating the need to model the ground mediums. Consequentially, this method is numerically very efficient, being suitable for the practical analyses of large-scale structures with the explicit modeling of upper structures and piles. A Newton-Raphson incremental-iterative numerical procedure is developed for determining the equilibrium conditions, where the tangent stiffness matrix and the secant relations are formulated using the Gauss-Legendre method for solving the summation procedures. For allowing large deflections, the kinematic motions described by the updated Lagrangian (UL) method are proposed, where the equilibrium conditions are established by referring the last known configurations. Finally, several benchmark examples are provided for validating the accuracy of the proposed method.",
    "keywords": [
      "Single pile",
      "Buckling",
      "Soil-structure interactions",
      "Numerical",
      "Finite elements",
      "Design",
      "Analysis"
    ],
    "doi": "10.1061/(ASCE)GM.1943-5622.0001542",
    "link": "https://doi.org/10.1061/(ASCE)GM.1943-5622.0001542",
    "weblink": "https://ascelibrary.org/doi/epdf/10.1061/%28ASCE%29GM.1943-5622.0001542",
    "APA": "Liu, S.-W., Wan, J.-H., Zhou, C.-Y., Liu, Z., & Yang, X. (2019). Efficient beam–column finite-element method for stability design of slender single pile in soft ground mediums. International Journal of Geomechanics, 20(1), 04019148.",
    "cv": "Liu, S.-W., Wan, J.-H., Zhou, C.-Y., Liu, Z.*, & Yang, X. (2019). Efficient beam–column finite-element method for stability design of slender single pile in soft ground mediums. International Journal of Geomechanics, 20(1), 04019148.",
    "publication-date": "2020-01"
  },
  {
    "id": "J.26",
    "year": "2020",
    "title": "Innovative high-order beam-column element for geometrically nonlinear analysis with one-element-per-member modelling method",
    "publisher": "Institution of Structural Engineers. Published by Elsevier Ltd.",
    "volume": "24",
    "pages": "542-552",
    "authors": [
      "Rui Bai",
      "Wen-Long Gao",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Structures",
    "abstract": "Modern structural design requires the nonlinear characteristics within structural behaviors to be considered in analysis. Due to the limited deformation capacity of the conventional cubic Hermite beam-column element, a frame member has to be finely meshed into a number of the beam-column elements for nonlinear analysis, leading to a huge computational expense. Moreover, the tedious modeling process makes the use of advanced analysis approaches, such as the direct analysis method, impossible for complicated structures. In this paper, a fourth-order displacement function and an advanced beam-column element with 16 independent degrees of freedom are proposed for elastic geometrically nonlinear analysis. The element formulation is developed based on the compatibility conditions at the end and internal nodes. The potential energy function is adopted to derive the element stiffness matrices, and the matrices are presented in the Gauss integral form for easy programming. The verification examples presented in this paper demonstrate the significant deformation capacity of this innovative element. The one-element-per-member modeling method can accurately and effectively capture the structural buckling capacity and post-buckling behaviors. The proposed method can considerably reduce modeling and computational efforts in engineering practices.",
    "keywords": [
      "Innovative beam-column element",
      "Geometrically nonlinear analysis",
      "High order shape function",
      "Gauss integration"
    ],
    "doi": "10.1016/j.istruc.2020.01.036",
    "link": "https://doi.org/10.1016/j.istruc.2020.01.036",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S2352012420300308",
    "APA": "Bai, R., Gao, W.-L., Liu, S.-W., & Chan, S.-L. (2020). Innovative high-order beam-column element for geometrically nonlinear analysis with one-element-per-member modelling method. Structures, 24, 542-552.",
    "cv": "Bai, R., Gao, W.-L., Liu, S.-W.*, & Chan, S.-L. (2020). Innovative high-order beam-column element for geometrically nonlinear analysis with one-element-per-member modelling method. Structures, 24, 542-552.",
    "publication-date": "2020-04"
  },
  {
    "id": "J.27",
    "year": "2020",
    "title": "A mixed-field Timoshenko beam-column element for direct analysis of tapered I-sections members",
    "publisher": "Elsevier Ltd.",
    "volume": "172",
    "pages": "106157",
    "authors": [
      "Rui Bai",
      "Jerome F. Hajjar",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "Tapered members produced by robotic fabrication techniques offer architectural and structural advantages and have the potential to become more prevalent than prismatic members. However, the conventional analysis and design methods based on simplified assumptions such as equivalent stiffness cannot be used to accurately evaluate a member's performance. To provide a reliable and practicable stability design method, a direct analysis method of tapered I sections is proposed. A mixed-field tapered beam-column element is derived for use within the modeling of structural frames. The effects of initial geometric imperfection and additional shear stress are directly considered in the element formulation. A polynomial describing the member's critical initial out-of-plumbness is adopted, and an arbitrarily located internal hinge is incorporated in the element to enhance the element's deformation capacity and capture the behaviors of the most critical section. Displacement and force interpolation matrices incorporating the shear deformation are utilized, and the Gauss quadrature method is employed to evaluate the element stiffness matrix. Finally, verification examples demonstrate that the proposed method can be used to accurately and efficiently evaluate the performance of tapered members, indicating that the element can be conveniently employed in member and frame analysis and design.",
    "keywords": [
      "Tapered member",
      "Direct analysis method",
      "Initial geometrical imperfection",
      "Timoshenko beam-column",
      "One element per member",
      "Additional shear stress"
    ],
    "doi": "10.1016/j.jcsr.2020.106157",
    "link": "https://doi.org/10.1016/j.jcsr.2020.106157",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0143974X20303631",
    "APA": "Bai, R., Hajjar, J. F., Liu, S.-W., & Chan, S.-L. (2020). A mixed-field Timoshenko beam-column element for direct analysis of tapered I-sections members. Journal of Constructional Steel Research, 172, 106157.",
    "cv": "Bai, R., Hajjar, J. F., Liu, S.-W.*, & Chan, S.-L. (2020). A mixed-field Timoshenko beam-column element for direct analysis of tapered I-sections members. Journal of Constructional Steel Research, 172, 106157.",
    "publication-date": "2020-09"
  },
  {
    "id": "J.28",
    "year": "2020",
    "title": "Numerical formulation and implementation of Euler-Bernoulli pile elements considering soil-structure-interaction responses",
    "publisher": "John Wiley & Sons Ltd.",
    "volume": "44",
    "pages": "1903–1925",
    "authors": [
      "Xueyou Li",
      "Jianhong Wan",
      "Siwei Liu",
      "Limin Zhang"
    ],
    "corresponding author": "Siwei Liu",
    "journal": "International Journal for Numerical and Analytical Methods in Geomechanics",
    "abstract": "Pile serves as an essential component for transferring loads from superstructures to the soil ground. Proper consideration of soil-structure interaction (SSI) responses is crucial in evaluating the pile capacity and deflections under external loads. In the current design practices, semi-empirical or linear-elastic analyses are utilized, which are often overly conservative and unable to properly consider the nonlinear SSI responses. Thus, this paper presents a new Euler-Bernoulli pile element for robustly and efficiently simulating the piles considering the SSI responses. The nonlinear springs distributed continuously along with the pile are directly integrated into the element formulations. A quasi-analytical solution based on the Gauss-Legendre method is utilized in the summation processes of the total potential energy to significantly simplify the mathematical expressions and ease difficulties in programming. The element tangent stiffness matrix and secant relations are respectively formulated for predicting the displacement and eliminating the accumulative errors in a Newton-Raphson incremental-iterative numerical procedure. Because a pile might exhibit large deflections in soft soils, the kinematic motion description using the Updated Lagrangian (UL) approach is developed where the equilibrium conditions are determined by referring to the last configurations. Finally, several examples are provided to validate the accuracy and efficiency of the proposed method.",
    "keywords": [
      "Finite-element method",
      "Load transfer method",
      "Pile element",
      "Single pile",
      "Soil-structure responses"
    ],
    "doi": "10.1002/nag.3113",
    "link": "https://doi.org/10.1002/nag.3113",
    "weblink": "https://onlinelibrary.wiley.com/doi/epdf/10.1002/nag.3113",
    "APA": "Li, X., Wan, J., Liu, S., & Zhang, L. (2020). Numerical formulation and implementation of Euler-Bernoulli pile elements considering soil-structure-interaction responses. International Journal for Numerical and Analytical Methods in Geomechanics, 44(14), 1903–1925.",
    "cv": "Li, X., Wan, J., Liu, S.*, & Zhang, L. (2020). Numerical formulation and implementation of Euler-Bernoulli pile elements considering soil-structure-interaction responses. International Journal for Numerical and Analytical Methods in Geomechanics, 44(14), 1903–1925.",
    "publication-date": "2020-10-10"
  },
  {
    "id": "J.29",
    "year": "2020",
    "title": "Simulation of thin-walled members with arbitrary-shaped cross-sections for static and dynamic analyses",
    "publisher": "World Scientific Publishing Company",
    "volume": "20",
    "pages": "2050128",
    "authors": [
      "A. H. A. Abdelrahman",
      "Siwei Liu",
      "Yao-Peng Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Yao-Peng Liu",
    "journal": "International Journal of Structural Stability and Dynamics",
    "abstract": "The main objective of this paper is to validate a finite-element (FE) modeling protocol to simulate thin-walled members for static and dynamic analyses. Arbitrary-shaped cross-sections, including open, closed, and multicellular sections can be efficiently modeled for further advanced study. The framework is thoroughly validated and verified using the existing analytical and closed-form solutions, as well as experimental results available in literature. This work is motivated by the higher accuracy of the shell FE-based modeling to capture the local and global complex behaviors of thin-walled members with asymmetric sections. Higher computational expenses, however, are required for such sophisticated shell finite element models (SFEM). Accordingly, a framework hosted in MATLAB and implementing the python scripting technique in ABAQUS, is developed, which includes eigen buckling, static nonlinear, modal frequency and dynamic time-history analyses. For a more modeling convenience, various parameters are incorporated such as imperfections, residual stresses, material definitions, element choice, meshing control, and boundary conditions. Several examples are provided to illustrate the application of the proposed framework, and to prove the robustness and accuracy of the generated FE models. This paper concludes with the efficiency of implementing SFEMs for simulating thin-walled members; thereby, establishing a more accurate and advanced structural analysis.",
    "keywords": [
      "Finite shell elements",
      "Thin-walled members",
      "Nonlinear analysis",
      "Static",
      "Dynamic",
      "Vibration"
    ],
    "doi": "10.1142/S021945542050128X",
    "link": "https://doi.org/10.1142/S021945542050128X",
    "weblink": "https://www.worldscientific.com/doi/epdf/10.1142/S021945542050128X",
    "APA": "Abdelrahman, A. H. A., Liu, S., Liu, Y.-P., & Chan, S.-L. (2020). Simulation of thin-walled members with arbitrary-shaped cross-sections for static and dynamic analyses. International Journal of Structural Stability and Dynamics, 20(12), 2050128.",
    "cv": "Abdelrahman, A. H. A., Liu, S., Liu, Y.-P.*, & Chan, S.-L. (2020). Simulation of thin-walled members with arbitrary-shaped cross-sections for static and dynamic analyses. International Journal of Structural Stability and Dynamics, 20(12), 2050128.",
    "publication-date": "2020-11"
  },
  {
    "id": "J.30",
    "year": "2020",
    "title": "Second-order analysis of steel sheet piles by pile element considering nonlinear soil-structure interactions",
    "publisher": "The Hong Kong Institute of Steel Construction",
    "volume": "16",
    "pages": "354–362",
    "authors": [
      "Wei-Hang Ouyang",
      "Yi Yang",
      "Jian-Hong Wan",
      "Si-Wei Liu"
    ],
    "corresponding author": "Yi Yang",
    "journal": "Advanced Steel Construction",
    "abstract": "Comparing to other supporting pile walls, steel sheet piles with a lower flexural rigidity have a more obvious and significant second-order effect with the large deformation. Also, the nonlinear Soil-Structure Interaction (SSI) can highly influence the efficiency and accuracy of the deformation and buckling of the steel sheet pile. Currently, some empirical methods with linear assumptions and the discrete spring element method are always used for the design of steel sheet piles in practical engineering. However, these methods are normally inaccurate or inefficient in considering the nonlinear SSI and the second-order effect. In this paper, a new line element, named pile element, is applied to analyze the structural behaviors of the steel sheet pile. In this new element, the soil resistance and pressure surrounding the pile as well as the pile shaft resistance are all integrated into the element formulation to simulate the nonlinear SSI. The Gauss-Legendre method is innovatively introduced to elaborate the realistic soil pressure distribution. For reducing the nonlinear iterations and numerical errors from the buckling behavior, the proposed numerical method and Updated-Lagrangian method will be integrated within a Newton-Raphson typed approach. Finally, several examples are given for validating the accuracy and efficiency of the developed pile element with the consideration of the realistic soil pressures. It can be found that the developed pile element has a significant advantage in simulating steel sheet piles.",
    "keywords": [
      "Steel sheet pile",
      "Finite element method",
      "Soil-structure interactions",
      "Lateral earth pressure",
      "Pile deflection",
      "Second-order effect"
    ],
    "doi": "10.18057/IJASC.2020.16.4.8",
    "link": "https://doi.org/10.18057/IJASC.2020.16.4.8",
    "weblink": "https://www.ascjournal.com/down/vol16no4/vol16no4_8.pdf",
    "APA": "Ouyang, W.-H., Yang, Y., Wan, J.-H., & Liu, S.-W. (2020). Second-order analysis of steel sheet piles by pile element considering nonlinear soil-structure interactions. Advanced Steel Construction, 16(4), 354–362.",
    "cv": "Ouyang, W.-H., Yang, Y.*, Wan, J.-H., & Liu, S.-W. (2020). Second-order analysis of steel sheet piles by pile element considering nonlinear soil-structure interactions. Advanced Steel Construction, 16(4), 354–362.",
    "publication-date": "2020-12-01"
  },
  {
    "id": "J.31",
    "year": "2021",
    "title": "Second-order dynamic time-history analysis of beam-columns with nonsymmetrical thin-walled steel sections",
    "publisher": "Elsevier Ltd.",
    "volume": "160",
    "pages": "107367",
    "authors": [
      "Wen-Long Gao",
      "A.H.A. Abdelrahman",
      "Si-Wei Liu",
      "Ronald D. Ziemian"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Thin-Walled Structures",
    "abstract": "An accurate structural analysis is a fundamental requirement for modern design. Nevertheless, this is often difficult for systems comprised of thin-walled members, mostly because of their complicated cross-section shapes with non-coincidence of shear center and centroid, and complex buckling modes. Recent research, using efficient line-finite-element formulations, has made important progress in simulating the global buckling behavior of arbitrary open-section members for static loads. This paper extends this method by providing for second-order dynamic analysis and an improved cross-section analysis algorithm for the general thin-walled sections regardless of whether they are open, closed, and multicellular shapes. The numerical algorithms, including mathematical derivations, are provided and thoroughly validated via their implementation within the nonlinear analysis program MASTAN2-v5.",
    "keywords": [
      "Nonlinear analysis",
      "Dynamic",
      "Numerical algorithms",
      "Thin-walled members",
      "Warping",
      "Cross-section analysis"
    ],
    "doi": "10.1016/j.tws.2020.107367",
    "link": "https://doi.org/10.1016/j.tws.2020.107367",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0263823120309101",
    "APA": "Gao, W.-L., Abdelrahman, A. H. A., Liu, S.-W., & Ziemian, R. D. (2021). Second-order dynamic time-history analysis of beam-columns with nonsymmetrical thin-walled steel sections. Thin-Walled Structures, 160, 107367.",
    "cv": "Gao, W.-L., Abdelrahman, A. H. A., Liu, S.-W.*, & Ziemian, R. D. (2021). Second-order dynamic time-history analysis of beam-columns with nonsymmetrical thin-walled steel sections. Thin-Walled Structures, 160, 107367.",
    "publication-date": "2021-03"
  },
  {
    "id": "J.32",
    "year": "2021",
    "title": "A stability design theory for the steel members using asymmetric thin-walled open-sections",
    "publisher": "Shanghai Institute of Architectural Design & Research (Group) Co., Ltd.",
    "volume": "23",
    "pages": "53-62",
    "authors": [
      "Wenlong Gao",
      "Jianhong Wan",
      "Siwei Liu"
    ],
    "corresponding author": "Siwei Liu",
    "journal": "Progress in Steel Building Structures",
    "abstract": "Cold-formed thin-walled open-section members are extensively used in constructions due to the material efficiency and ease of manufacturing. Such members are usually slender and susceptible to buckling, where the buckling modes are usually coupled and complicated. Current stability method is based on the linear elastic analysis method associated with the use of empirical formulations, which is usually conservative. Further, asymmetric shapes are commonly fabricated for cold-formed sections, where the shear center and the geometric center are not coincident. When using the conventional beam-column elements with the symmetric section assumption, the error in the prediction of buckling strengths can be quite large. A new type of beam-column element with warped degree of freedom and asymmetric section assumption is introduced, and the stability analysis theory for various kinds of cold-formed thin-walled steel members with arbitrarily-shaped section is proposed. This method can directly capture the buckling behaviors of thin-walled members, eliminating the needs in adopting the empirical assumptions, such as the effective lengths. This paper briefly explains the proposed stability design theory, the derivation procedure of the new warping beam-column element and the cross-section analysis algorithm. Finally, several examples are provided for validating and verifying the accuracy and applicability of the proposed method.",
    "keywords": [
      "Cold-formed thin-walled steel",
      "Stability",
      "Shaped section",
      "Beam-column element",
      "Buckling",
      "Numerical method"
    ],
    "doi": "10.13969/j.cnki.cn31-1893.2021.05.007",
    "link": "https://doi.org/10.13969/j.cnki.cn31-1893.2021.05.007",
    "APA": "Gao, W., Wan, J., & Liu, S. (2021). A stability design theory for the steel members using asymmetric thin-walled open-sections. Progress in Steel Building Structures, 23(5), 53-62.",
    "cv": "Gao, W., Wan, J., & Liu, S.* (2021). A stability design theory for the steel members using asymmetric thin-walled open-sections. Progress in Steel Building Structures, 23(5), 53-62.",
    "publication-date": "2021-05"
  },
  {
    "id": "J.33",
    "year": "2021",
    "title": "Line-finite-element implementation for driven steel H-piles in layered sands considering post-driving residual stresses",
    "publisher": "SAGE Publications",
    "volume": "24",
    "pages": "1384-1398",
    "authors": [
      "Weihang Ouyang",
      "Jianhong Wan",
      "Si-Wei Liu",
      "Xueyou Li"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Advances in Structural Engineering",
    "abstract": "Driven Steel H-piles are commonly used in the deep foundation of being cost-effective and easy in workmanship. The post-driving residual stresses acting on the pile could be large when being driven in cohesionless sands, significantly affecting its compressive strength. Current design methods, mostly based on the empirical assumptions of using safety factors, are unable to consider the post-driving residual stresses on piles accurately and usually very conservative in practical applications. Such consideration is further complicated when the pile is embedded in layered sands. Moreover, the soil-structure interaction (SSI) between pile and ground medium is usually complicated in the analysis and should be appropriately considered in a successful design. This paper proposes a line-finite-element implementation method, based on the Euler-Bernoulli pile element formulations, for robustly and efficiently analyzing the driven steel H-piles in layered sands with explicitly modelling the SSI. The effects resulting from the post-driving residual stresses are considered in the total potential energy equation for generating the secant relations. The derivation procedure is elaborated with details. Consequentially, verification examples are given for validating the accuracy of the proposed method. This work would be helpful for improving the numerical efficiency and accuracy for designing the steel H-piles in layered sands.",
    "keywords": [
      "Analysis",
      "Buckling",
      "Design",
      "Driven H-pile",
      "Finite-elements",
      "Numerical",
      "Post-driving residual stress",
      "Soil-structure interactions"
    ],
    "doi": "10.1177/1369433220978144",
    "link": "https://doi.org/10.1177/1369433220978144",
    "weblink": "https://journals.sagepub.com/doi/10.1177/1369433220978144",
    "APA": "Ouyang, W., Wan, J., Liu, S.-W., & Li, X. (2021). Line-finite-element implementation for driven steel H-piles in layered sands considering post-driving residual stresses. Advances in Structural Engineering, 24(7), 1384-1398.",
    "cv": "Ouyang, W., Wan, J., Liu, S.-W.*, & Li, X. (2021). Line-finite-element implementation for driven steel H-piles in layered sands considering post-driving residual stresses. Advances in Structural Engineering, 24(7), 1384-1398.",
    "publication-date": "2021-05"
  },
  {
    "id": "J.34",
    "year": "2021",
    "title": "Line-element formulation for upheaval buckling analysis of buried subsea pipelines due to thermal expansion",
    "publisher": "The Hong Kong Institute of Steel Construction",
    "volume": "17",
    "pages": "210–220",
    "authors": [
      "Ji-Hui Ning",
      "Si-Wei Liu",
      "Jian-Hong Wan",
      "Wei Huang"
    ],
    "corresponding author": "Wei Huang",
    "journal": "Advanced Steel Construction",
    "abstract": "Subsea pipeline is the critical component in the offshore systems for transporting oil and gas from resource sites to ports. Its structural failure will be a disaster of heavily polluting the environment leading to unpredictable losses. The mediums inside subsea pipelines are conventionally heated in service for easier transporting after increasing fluidity, resulting in accumulative thermal expansion of the pipeline to induce thermal expansion, triggering upheaval buckling. It is crucial when designing subsea pipelines but always challenging to evaluate rigorously because of the complexities in such consideration. A pipeline might length for miles, while the numerical analysis model using conventional solid finite elements is huge in computational expense, making the successful analysis very time-consuming. This research innovatively develops a new line element, namely the pipeline element, featuring the explicit considerations of soil-pipe interactions and thermal expansion. This element is numerically efficient by eliminating modeling buried soils. The element derivation procedure is elaborated with details, while a Newton-Raphson typed numerical analysis procedure is proposed for nonlinear analysis of pipelines subjected to thermal expansion. An Updated-Lagrangian description is employed for facilitating large deflections. Three groups of examples are provided to demonstrate the numerical robustness of the proposed method. Finally, a case study is given to identify the vital influential factors to the thermal upheaval buckling of pipelines.",
    "keywords": [
      "Line element",
      "Upheaval buckling",
      "Subsea pipelines",
      "Numerical",
      "Buckling"
    ],
    "doi": "10.18057/IJASC.2021.17.2.10",
    "link": "https://doi.org/10.18057/IJASC.2021.17.2.10",
    "weblink": "https://www.ascjournal.com/down/vol17no2/Vol17no2_10.pdf",
    "APA": "Ning, J.-H., Liu, S.-W., Wan, J.-H., & Huang, W. (2021). Line-element formulation for upheaval buckling analysis of buried subsea pipelines due to thermal expansion. Advanced Steel Construction, 17(2), 210–220.",
    "cv": "Ning, J.-H., Liu, S.-W., Wan, J.-H., & Huang, W*. (2021). Line-element formulation for upheaval buckling analysis of buried subsea pipelines due to thermal expansion. Advanced Steel Construction, 17(2), 210–220.",
    "publication-date": "2021-06-01"
  },
  {
    "id": "J.35",
    "year": "2021",
    "title": "Frame analysis and design of industrial rack structures with perforated cold-formed steel columns",
    "publisher": "Elsevier Ltd.",
    "volume": "163",
    "pages": "107755",
    "authors": [
      "Si-Wei Liu",
      "Teoman Pekoz",
      "Wen-Long Gao",
      "Ronald D. Ziemian",
      "James Crews"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Thin-Walled Structures",
    "abstract": "Thin-walled perforated singly symmetric open-section columns and braces are commonly used in industrial storage rack structures. They are difficult to analyze accurately because the shear center and centroid do not coincide and the complex buckling modes are involved. This paper explores the application of the newly extended MASTAN2-v5 program to analyze rack frames, using the advanced line-finite element formulations that capture the global buckling modes. Modeling of perforations on the columns is explored, and the refined buckling strength equations are proposed for considering local and distortional buckling. Finally, validation examples and case studies for multistory pallet racks are given.",
    "keywords": [
      "Rack structures",
      "Frame analysis",
      "Mastan2",
      "Wagner’s effects",
      "Buckling"
    ],
    "doi": "10.1016/j.tws.2021.107755",
    "link": "https://doi.org/10.1016/j.tws.2021.107755",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0263823121001659",
    "APA": "Liu, S.-W., Pekoz, T., Gao, W.-L., Ziemian, R. D., & Crews, J. (2021). Frame analysis and design of industrial rack structures with perforated cold-formed steel columns. Thin-Walled Structures, 163, 107755.",
    "cv": "Liu, S.-W.*, Pekoz, T., Gao, W.-L., Ziemian, R. D., & Crews, J. (2021). Frame analysis and design of industrial rack structures with perforated cold-formed steel columns. Thin-Walled Structures, 163, 107755.",
    "publication-date": "2021-06"
  },
  {
    "id": "J.36",
    "year": "2021",
    "title": "Three-dimensional analysis of nonlinear pile–soil interaction responses using 3D pile element model",
    "publisher": "American Society of Civil Engineers",
    "volume": "21",
    "pages": "04021129",
    "authors": [
      "Xue-You Li",
      "Jian-Hong Wan",
      "Hai-Peng Zhao",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "International Journal of Geomechanics",
    "abstract": "Due to the complicated geological conditions and complex loads, the pile–soil interaction is a three-dimensional (3D) and highly nonlinear problem. Conventional numerical models have deficiencies to model the nonlinear soil–structure interaction (SSI) responses. This paper developed a 3D pile element model, which is capable of robustly simulating the pile behaviors under complex loadings in 3D analysis. The dominant feature of the model was the direct integration of the soil properties into the element formulation to consider the nonlinear SSI responses so that the soils were not necessarily modeled explicitly. Element tangent stiffness matrices were computed via the total potential energy equation. A semianalytical method based on the Gauss–Legendre integration method is developed for the summating process. The kinematic description of motion established by the updated Lagrangian approach was developed to allow intermediately large deflection of a pile. Formulation of the 3D pile element was derived, and the numerical implementation of the 3D pile element was provided. Finally, several examples were worked out to validate the efficiency and accuracy of the proposed model.",
    "keywords": [
      "Pile foundation",
      "Finite-element method",
      "3D pile element",
      "Soil–structure interaction"
    ],
    "doi": "10.1061/(ASCE)GM.1943-5622.0002076",
    "link": "https://doi.org/10.1061/(ASCE)GM.1943-5622.0002076",
    "weblink": "https://ascelibrary.org/doi/10.1061/%28ASCE%29GM.1943-5622.0002076",
    "APA": "Li, X.-Y., Wan, J.-H., Zhao, H.-P., & Liu, S.-W. (2021). Three-dimensional analysis of nonlinear pile–soil interaction responses using 3D pile element model. International Journal of Geomechanics, 21(8), 04021129.",
    "cv": "Li, X.-Y., Wan, J.-H., Zhao, H.-P., & Liu, S.-W*. (2021). Three-dimensional analysis of nonlinear pile–soil interaction responses using 3D pile element model. International Journal of Geomechanics, 21(8), 04021129.",
    "publication-date": "2021-08"
  },
  {
    "id": "J.37",
    "year": "2021",
    "title": "Euler–Bernoulli pile element for nonlinear buckling analysis of single piles in slope",
    "publisher": "American Society of Civil Engineers",
    "volume": "21",
    "pages": "04021170",
    "authors": [
      "Weihang Ouyang",
      "Si-Wei Liu",
      "Jianhong Wan",
      "Yi Yang"
    ],
    "corresponding author": "Yi Yang",
    "journal": "International Journal of Geomechanics",
    "abstract": "Piles are sometimes unavoidably embedded in slopes for supporting buildings on hills. In contrast to a pile on a horizontal ground, a pile in slope is acted on by additional sliding force from the slope, impairing its load-bearing capacity and buckling resistance. Nevertheless, proper assessment for the buckling of piles in slopes is difficult because of the simulation of distributed sliding forces and nonlinear pile–soil interactions. This paper refines the newly developed Euler–Bernoulli pile element formulation for the nonlinear buckling analysis of single piles in slopes by including the sliding force in element formulation, enabling a rigorous consideration of soil–pile interactions. Detailed mathematical derivations are provided. The numerical implementation is illustrated with a flowchart. Four examples for verification are demonstrated to reveal the robustness of the proposed method and the importance of considering the sliding force.",
    "keywords": [
      "Pile element",
      "Nonlinear buckling",
      "Soil–structure interactions",
      "Sliding force"
    ],
    "doi": "10.1061/(ASCE)GM.1943-5622.0002143",
    "link": "https://doi.org/10.1061/(ASCE)GM.1943-5622.0002143",
    "weblink": "https://ascelibrary.org/doi/10.1061/%28ASCE%29GM.1943-5622.0002143",
    "APA": "Ouyang, W., Liu, S.-W., Wan, J., & Yang, Y. (2021). Euler–Bernoulli pile element for nonlinear buckling analysis of single piles in slope. International Journal of Geomechanics, 21(9), 04021170.",
    "cv": "Ouyang, W., Liu, S.-W., Wan, J., & Yang, Y.* (2021). Euler–Bernoulli pile element for nonlinear buckling analysis of single piles in slope. International Journal of Geomechanics, 21(9), 04021170.",
    "publication-date": "2021-09"
  },
  {
    "id": "J.38",
    "year": "2021",
    "title": "Buckling analysis of tapered piles using non-prismatic beam-column element model",
    "publisher": "Elsevier Ltd.",
    "volume": "139",
    "pages": "104370",
    "authors": [
      "Jian-Hong Wan",
      "Si-Wei Liu",
      "Xue-You Li",
      "Li-Min Zhang",
      "Hai-Peng Zhao"
    ],
    "corresponding author": "Xue-You Li",
    "journal": "Computers and Geotechnics",
    "abstract": "Tapered piles have superior benefits over traditional cylindrical piles in resisting axial and lateral loads, being an economical alternative to cylindrical piles. When designing the tapered pile in soft or liquefiable soil, it is necessary to identify its buckling strengths. Notwithstanding, the buckling analysis of tapered piles considering nonlinear pile-soil interactions with geometric imperfections under combined loads has not been well established. This paper presents a non-prismatic beam-column element for nonlinear buckling analysis, considering nonlinear pile-soil interactions, combined external loads, and geometric imperfections, to robustly and efficiently simulate the buckling response of tapered piles. Unlike the discrete-spring stepped element (DSSE) model using an approximate stepwise modeling approach, analytical expressions for considering the axial and flexural rigidity of tapered section members are derived in the proposed element formulations to explicitly model the tapered sections. Several examples of buckling analysis are provided to validate the accuracy and efficiency of the proposed method. Parametric studies are performed to investigate the influences of Young’s modulus, taper ratio, initial geometric imperfection, and horizontal load on the buckling behavior of tapered piles with different boundary conditions. The critical buckling load of tapered piles is found to increase with increasing Young’s modulus and decreasing initial geometric imperfection and horizontal load. An optimal taper ratio of the tapered pile can be determined to carry the maximum axial load.",
    "keywords": [
      "Beam-column element",
      "Buckling",
      "Tapered pile",
      "Numerical analysis",
      "Soil structure interactions"
    ],
    "doi": "10.1016/j.compgeo.2021.104370",
    "link": "https://doi.org/10.1016/j.compgeo.2021.104370",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0266352X21003008",
    "APA": "Wan, J.-H., Liu, S.-W., Li, X.-Y., Zhang, L.-M., & Zhao, H.-P. (2021). Buckling analysis of tapered piles using non-prismatic beam-column element model. Computers and Geotechnics, 139, 104370.",
    "cv": "Wan, J.-H., Liu, S.-W., Li, X.-Y.*, Zhang, L.-M., & Zhao, H.-P. (2021). Buckling analysis of tapered piles using non-prismatic beam-column element model. Computers and Geotechnics, 139, 104370.",
    "publication-date": "2021-11"
  },
  {
    "id": "J.39",
    "year": "2020",
    "title": "Analysis of laterally-loaded piles embedded in multi-layered soils using efficient finite-element method",
    "publisher": "Chinese Society for Rock Mechanics and Engineering",
    "volume": "41",
    "pages": "1885-1894",
    "authors": [
      "Hai-peng Zhao",
      "Xue-you Li",
      "Jian-hong Wan",
      "Xiang-zhi Zheng",
      "Si-wei Liu"
    ],
    "corresponding author": "Xue-you Li",
    "journal": "Rock and Soil Mechanics",
    "abstract": "An efficient finite-element method is proposed to solve the problem of insufficient accuracy and efficiency of the traditional finite-element method for analyzing the mechanical performance of laterally-loaded piles embedded in multi-layered soils, which adopts the distributed “soil springs” along the element length to reflect the nonlinear behaviors of the pile-soil interactions. The pile element in multi-layered soils is derived, and the Gauss-Legendre method is introduced to simplify the total potential energy summation process. The element stiffness matrix is derived and applied to Newton-Raphson incremental iterative numerical process, and the secant relations are used to minimize the cumulative errors during the numerical iteration process. Updated Lagrangian method is employed to consider the geometric large deflection issue. From the verification examples, the following conclusions can be drawn: the proposed finite-element method can substantially reduce the number of elements and calculation time compared with the discrete element model, and has higher calculation precision compared with conversion method of scale factor under the condition of multi-layered soils. Therefore, the pile element model can be effectively applied to analyze the mechanical performance of laterally-loaded piles embedded in multi-layered soils.",
    "keywords": [
      "Laterally-loaded piles",
      "Finite element method",
      "Pile-soil interaction",
      "Pile element",
      "Multi-layered soils"
    ],
    "doi": "",
    "link": "",
    "APA": "Zhao, H.-P., Li, X.-Y., Wan, J.-H., Zheng, X.-Z., & Liu, S.-W. (2020). Analysis of laterally-loaded piles embedded in multi-layered soils using efficient finite-element method. Rock and Soil Mechanics, 41(9), 1885-1894.",
    "cv": "Zhao, H.-P., Li, X.-Y.*, Wan, J.-H., Zheng, X.-Z., & Liu, S.-W. (2020). Analysis of laterally-loaded piles embedded in multi-layered soils using efficient finite-element method. Rock and Soil Mechanics, 41(9), 1885-1894.",
    "publication-date": "2021-11-23"
  },
  {
    "id": "J.40",
    "year": "2021",
    "title": "Load bearing capacity calculation method of circular concrete-filled double skin steel tubular stub columns",
    "publisher": "Shanghai Institute of Architectural Design & Research (Group) Co., Ltd.",
    "volume": "23",
    "pages": "85-93",
    "authors": [
      "Yangyu Chen",
      "Jihui Ning",
      "Yongxin Zhang",
      "Siwei Liu",
      "Xueyou Li"
    ],
    "corresponding author": "Siwei Liu",
    "journal": "Progress in Steel Building Structures",
    "abstract": "When a circular concrete-filled double skin steel tubular (CFDST) stub column is subjected to compression, the inside concrete is in a tri-axial stressing state due to the confining actions induced by the internal and external steel tubes. Consequently, the compression strength might be increased, which is directly affected by the lateral confining stress applied on the concrete core. The section sizes and axial force levels are two main factors that have influences on this effect. Current design methods assume the confining stress is the same under the loading actions of pure-bending and axial-compression, but it is not clearly stated how to consider the stress under the eccentric pressure. This research proposes a lateral confining stress coefficient β to revise the concrete constitutive model for a more accurate calculation of the confining actions on concrete. A new stress integration method is proposed in this paper for computing the section capacity of stub columns under the ultimate limited state, and the axial-moment (N-M) strength interaction curve can be accordingly generated. Finally, a few several examples are provided for demonstrating the accuracy of the proposed method.",
    "keywords": [
      "Concrete-filled double skin steel tube",
      "Stub column",
      "Constitutive relationship of concrete",
      "Eccentric pressure",
      "Calculation of section bearing capacity"
    ],
    "doi": "10.13969/j.cnki.cn31-1893.2021.12.009",
    "link": "https://doi.org/10.13969/j.cnki.cn31-1893.2021.12.009",
    "APA": "Chen, Y., Ning, J., Zhang, Y., Liu, S., & Li, X. (2021). Load bearing capacity calculation method of circular concrete-filled double skin steel tubular stub columns. Progress in Steel Building Structures, 23(12), 85-93.",
    "cv": "Chen, Y., Ning, J., Zhang, Y., Liu, S.*, & Li, X. (2021). Load bearing capacity calculation method of circular concrete-filled double skin steel tubular stub columns. Progress in Steel Building Structures, 23(12), 85-93.",
    "publication-date": "2021-12"
  },
  {
    "id": "J.41",
    "year": "2021",
    "title": "Gaussian beam–column element formulation for large-deflection analysis of steel members with open sections subjected to torsion",
    "publisher": "American Society of Civil Engineers",
    "volume": "147",
    "pages": "04021206",
    "authors": [
      "Liang Chen",
      "A. H. A. Abdelrahman",
      "Si-Wei Liu",
      "Ronald D. Ziemian",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Journal of Structural Engineering",
    "abstract": "The beam–column element analysis method has been extensively adopted in practice, relying on the robustness of its element formulation. Steel members with open sections are commonly used; their cross-sectional shapes are usually nonsymmetric to improve material efficiency. Nevertheless, an offset exists between the shear center and the centroid of a nonsymmetric section. If the applied loads do not act at the shear center, torsion can be induced; this is sometimes unavoidable. When a member is subject to torsion, the inclined angle between the local axes of the cross section and the element is varied along the element length, complicating the summating of the cross section’s stiffness to form an element stiffness matrix. This study developed a new beam–column element formulation based on the nonsymmetric section assumption and a Gaussian quadrature procedure to formulate the element stiffness matrix of being concise in expressing formulation. The updated Lagrangian method was modified to consider large deflections. This method permitted the use of fewer elements to simulate a member under torsion, leading to a significant improvement in numerical efficiency. Detailed derivations and verification examples are given in the paper.",
    "keywords": [
      "Finite-element formulation",
      "Updated-Lagrangian method",
      "Numerical method",
      "Warping",
      "Wagner effects",
      "Nonlinear analysis"
    ],
    "doi": "10.1061/(ASCE)ST.1943-541X.0003185",
    "link": "https://doi.org/10.1061/(ASCE)ST.1943-541X.0003185",
    "weblink": "https://ascelibrary.org/doi/10.1061/%28ASCE%29ST.1943-541X.0003185",
    "APA": "Chen, L., Abdelrahman, A. H. A., Liu, S.-W., Ziemian, R. D., & Chan, S.-L. (2021). Gaussian beam–column element formulation for large-deflection analysis of steel members with open sections subjected to torsion. Journal of Structural Engineering, 147(12), 04021206.",
    "cv": "Chen, L., Abdelrahman, A. H. A., Liu, S.-W.*, Ziemian, R. D., & Chan, S.-L. (2021). Gaussian beam–column element formulation for large-deflection analysis of steel members with open sections subjected to torsion. Journal of Structural Engineering, 147(12), 04021206.",
    "publication-date": "2021-12"
  },
  {
    "id": "J.42",
    "year": "2022",
    "title": "Timoshenko line-element for stability analysis of tapered I-section steel members considering warping effects",
    "publisher": "Elsevier Ltd.",
    "volume": "175",
    "pages": "109198",
    "authors": [
      "A.H.A. Abdelrahman",
      "Liang Chen",
      "Si-Wei Liu",
      "Ronald D. Ziemian"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Thin-Walled Structures",
    "abstract": "Tapered I-section steel members can achieve efficient material utilization, and are economical alternatives to traditional prismatic ones. Current line-element formulations for tapered I-section members may not accurately capture buckling behavior because they typically ignore shear and warping deformations. The research refines the existing line-element formulation for tapered I-section members by directly considering warping deformation. The tapered member’s flexural rigidity is analytically expressed in a stiffness matrix via utilizing a series of tapering factors, which can produce more accurate analysis than those by the conventional stepped-element or the approximate distribution (e.g., linear, parabolic, or cubic) methods. The element formulation is established based upon the Updated-Lagrangian method that permits moderate deformation. The numerical procedure for tracing the solution path is illustrated in detail with a flowchart. Finally, performances of the proposed method, particularly the accuracy of the new element stiffness matrices, are thoroughly assessed by presenting several examples.",
    "keywords": [
      "Nonlinear",
      "Steel members",
      "Buckling",
      "Tapered members",
      "Warping effects",
      "Line element"
    ],
    "doi": "10.1016/j.tws.2022.109198",
    "link": "https://doi.org/10.1016/j.tws.2022.109198",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0263823122001343",
    "APA": "Abdelrahman, A. H. A., Chen, L., Liu, S.-W., & Ziemian, R. D. (2022). Timoshenko line-element for stability analysis of tapered I-section steel members considering warping effects. Thin-Walled Structures, 175, 109198.",
    "cv": "Abdelrahman, A. H. A., Chen, L., Liu, S.-W.*, & Ziemian, R. D. (2022). Timoshenko line-element for stability analysis of tapered I-section steel members considering warping effects. Thin-Walled Structures, 175, 109198.",
    "publication-date": "2022-06"
  },
  {
    "id": "J.43",
    "year": "2022",
    "title": "Efficient algorithm for elastic buckling of corroded I-section steel members with Monte Carlo simulation",
    "publisher": "Elsevier Ltd.",
    "volume": "175",
    "pages": "109216",
    "authors": [
      "Liang Chen",
      "Si-Wei Liu",
      "Jing-Zhou Zhang",
      "Michael C.H. Yam"
    ],
    "corresponding author": "Jing-Zhou Zhang",
    "journal": "Thin-Walled Structures",
    "abstract": "Monte Carlo simulation has been widely used to deal with random problems. Corrosion of steel structures is of high random nature. Current studies on the behavior of steel structures considering corrosion effect are usually executed by using the commercial finite element analysis software, which costs huge computational time to ensure sufficient Monte Carlo simulation. In this paper, an efficient algorithm to deal with the buckling behavior of corroded I-section steel member is proposed. The computational time required is significantly reduced. The objective of this paper is focused on the elastic buckling behavior of the member. The nonlinearity in practical buckling design is not considered. The random nature of corrosion is captured by using the Monte Carlo simulation. The warping and Wagner effects due to corrosion are also considered in the algorithm. Three buckling types are studied, namely, flexural buckling, lateral–torsional buckling and axial–torsional buckling. The accuracy of the algorithm is validated against both the experiment and the finite element analysis. Parametric studies are conducted to investigate the effects of the corrosion ratio and corrosion depth on the elastic buckling behavior of the member. It is found that corrosion reduces the axial–torsional buckling of the member with the greatest extent. The flexural elastic buckling load is mainly affected by the section area loss ratio. The reduction factor of the flexural buckling is linear against the area loss ratio. With the aid of the proposed algorithm, the deterioration of the elastic buckling load and moment of a steel member with respect to corrosion time is quantified.",
    "keywords": [
      "Steel members",
      "Corrosion",
      "Elastic buckling",
      "Analysis",
      "Monte Carlo method"
    ],
    "doi": "10.1016/j.tws.2022.109216",
    "link": "https://doi.org/10.1016/j.tws.2022.109216",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0263823122001537",
    "APA": "Chen, L., Liu, S.-W., Zhang, J.-Z., & Yam, M. C. H. (2022). Efficient algorithm for elastic buckling of corroded I-section steel members with Monte Carlo simulation. Thin-Walled Structures, 175, 109216.",
    "cv": "Chen, L., Liu, S.-W., Zhang, J.-Z.*, & Yam, M. C. H. (2022). Efficient algorithm for elastic buckling of corroded I-section steel members with Monte Carlo simulation. Thin-Walled Structures, 175, 109216.",
    "publication-date": "2022-06"
  },
  {
    "id": "J.44",
    "year": "2022",
    "title": "An improved morgenstern-price method using gaussian quadrature",
    "publisher": "Elsevier Ltd.",
    "volume": "148",
    "pages": "104754",
    "authors": [
      "Weihang Ouyang",
      "Si-Wei Liu",
      "Yi Yang"
    ],
    "corresponding author": "Yi Yang",
    "journal": "Computers and Geotechnics",
    "abstract": "The Morgenstern-Price (MP) method is an effective solution to compute the factor of safety (FOS) of a slope against sliding that has been used extensively for decades. In the MP method, the soil mass above the slip surface needs to be tediously divided into vertical slices to compute the force and moment integrals. The proposed research improves the computational efficiency of the MP method by employing the Gaussian quadrature for the integrals, where the soil mass division into a significant number of vertical slices is improved by aligning a few Gauss points along the slip surface. Consequently, the computational efficiency can be dramatically improved, resulting in a reduction in calculation efforts. Moreover, this research further refines the iteration scheme to satisfy the equilibrium conditions for the FOS using a robustly stable numerical algorithm with two initial scaling factors. The critical slip surface was determined by the simulated annealing algorithm. Finally, the proposed method was thoroughly validated via a series of benchmark examples. This research could improve the traditional MP method by enhancing its robustness and efficiency and provide an informative technique for force integrals that may be motivated by other problems in geotechnical engineering.",
    "keywords": [
      "Slope stability analysis",
      "Morgenstern-Price (MP) method",
      "Gaussian quadrature",
      "Factor of safety",
      "Numerical method"
    ],
    "doi": "10.1016/j.compgeo.2022.104754",
    "link": "https://doi.org/10.1016/j.compgeo.2022.104754",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0266352X22001728",
    "APA": "Ouyang, W., Liu, S.-W., & Yang, Y. (2022). An improved morgenstern-price method using gaussian quadrature. Computers and Geotechnics, 148, 104754.",
    "cv": "Ouyang, W., Liu, S.-W., & Yang, Y.* (2022). An improved morgenstern-price method using gaussian quadrature. Computers and Geotechnics, 148, 104754.",
    "publication-date": "2022-08"
  },
  {
    "id": "J.45",
    "year": "2022",
    "title": "Efficient elastic buckling assessment algorithm for steel members with random non-uniform corrosion",
    "publisher": "Elsevier Ltd.",
    "volume": "266",
    "pages": "114550",
    "authors": [
      "Jing-Zhou Zhang",
      "Liang Chen",
      "Si-Wei Liu",
      "Michael C.H. Yam"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Engineering Structures",
    "abstract": "This paper developed an efficient algorithm to study the elastic buckling strengths of non-uniformly corroded steel members. The algorithm is derived based on the authors’ previous work on buckling strength assessment for the steel members by further introducing random non-uniform corrosion damage to the cross-section along member. In the algorithm, the random nature of the corrosion is captured by the Monte Carlo simulations. Moreover, the non-symmetric section effects, including the noncoincidence of section shear center and centroid and Wagner effects, caused by the non-uniform corrosion are considered in the algorithm. The proposed algorithm permits more than ten million times of Monte Carlo simulations being completed efficiently, which greatly reduces the computational expense compared with the existing finite element analysis algorithms. The effects of corrosion depth, corrosion ratio, and corrosion location on the flexural buckling (FB), lateral-torsional buckling (LTB), and axial-torsional buckling (ATB) strengths of the steel member are studied. It is found that corrosion has the most adverse effect on ATB than LTB and FB strengths of the member. When the corrosion distributes more compactly through the section, its adverse effect on the buckling strength of the member could be more significant. Even for the same corrosion ratio, corrosion depth, and total corrosion region number, the reduction factor of the buckling strength can be varied by up to more than 20% due to the difference of the corrosion locations. The reduction factor of the FB strength is generally linear against the corrosion depth. While for the LTB and ATB strength, the reduction factors show nonlinear as per the corrosion depth.",
    "keywords": [
      "Non-uniform corrosion",
      "Random corrosion",
      "Buckling",
      "Algorithm",
      "Steel member"
    ],
    "doi": "10.1016/j.engstruct.2022.114550",
    "link": "https://doi.org/10.1016/j.engstruct.2022.114550",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0141029622007630",
    "APA": "Zhang, J.-Z., Chen, L., Liu, S.-W., & Yam, M. C. H. (2022). Efficient elastic buckling assessment algorithm for steel members with random non-uniform corrosion. Engineering Structures, 266, 114550.",
    "cv": "Zhang, J.-Z., Chen, L., Liu, S.-W.*, & Yam, M. C. H. (2022). Efficient elastic buckling assessment algorithm for steel members with random non-uniform corrosion. Engineering Structures, 266, 114550.",
    "publication-date": "2022-09"
  },
  {
    "id": "J.46",
    "year": "2022",
    "title": "Pipeline element for upheaval buckling analysis of submarine pipelines with geometric-imperfections under high temperature high pressure",
    "publisher": "Elsevier Ltd.",
    "volume": "264",
    "pages": "112456",
    "authors": [
      "Jihui Ning",
      "Siwei Liu",
      "Tong Lin",
      "Wei Huang"
    ],
    "corresponding author": "Wei Huang",
    "journal": "Ocean Engineering",
    "abstract": "Submarine pipeline is used for transporting oil from wells to resource storage facilities. The oil inside the pipeline is heated and pressured for long-distance transportation, making the pipeline under high temperature and high pressure (HTHP). The pipeline is usually placed inside a trench where surrounding soil restraints its longitudinal expansion. The pipeline is not perfectly straight, but with geometric imperfections, so the upheaval buckling may be triggered when the accumulated compression force has reached its buckling strength. It is not easy to conduct a geometrically nonlinear analysis for the pipeline because of the nonlinear soil–pipeline interactions (SPIs). This paper proposes a new line element aiming for the geometrically nonlinear large deformation analysis of the pipeline under HTHP. The axial expansion force due to high working temperature and pressure is included in the element formulation. Furthermore, a Gauss–Legendre integral method is employed to consider continuously distributed nonlinear SPIs in both lateral and longitudinal directions. Since the pipeline might exhibit large deflections, the analysis adopts the Updated-Lagrangian approach to establish the equilibrium conditions. A Newton–Raphson procedure is developed to execute the analysis. Detailed element formulations are given. Six groups of examples are provided to examine the robustness of the numerical method.",
    "keywords": [
      "Upheaval buckling",
      "Element formulation",
      "Submarine pipelines",
      "Nonlinear soil–pipeline interactions",
      "High-temperature high-pressure"
    ],
    "doi": "10.1016/j.oceaneng.2022.112456",
    "link": "https://doi.org/10.1016/j.oceaneng.2022.112456",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0029801822018044",
    "APA": "Ning, J., Liu, S., Lin, T., & Huang, W. (2022). Pipeline element for upheaval buckling analysis of submarine pipelines with geometric-imperfections under high temperature high pressure. Ocean Engineering, 264, 112456.",
    "cv": "Ning, J., Liu, S., Lin, T., & Huang, W.* (2022). Pipeline element for upheaval buckling analysis of submarine pipelines with geometric-imperfections under high temperature high pressure. Ocean Engineering, 264, 112456.",
    "publication-date": "2022-11"
  },
  {
    "id": "J.47",
    "year": "2022",
    "title": "Geometric and material nonlinear analysis of steel members with nonsymmetric sections",
    "publisher": "Elsevier Ltd.",
    "volume": "198",
    "pages": "107537",
    "authors": [
      "Liang Chen",
      "Wen-Long Gao",
      "Si-Wei Liu",
      "Ronald D. Ziemian",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "Steel members using nonsymmetric sections are often used for their structural efficiency in contemporary construction. Notwithstanding, the conventional concentrated plasticity (CP) analysis approach is commonly used in material nonlinear analysis and derived for regular hot-rolled steel sections with symmetrical shapes, leading to significant differences when analyzing members with nonsymmetric sections. This research develops the modified tangent modulus (MTM) method, proposed by Ziemian and McGuire in 2002, for the material nonlinear analysis of steel members with nonsymmetric sections, as a straightforward extension of the conventional CP analysis approach. Regarding the geometric nonlinear behaviors, an improved line-element formulation is formulated based on the nonsymmetric section assumption, explicitly modelling the noncoincidence of the shear center and centroid for considering the Wagner effects, which can capture complex buckling behaviors of the members with nonsymmetric sections. As part of the proposed method, a rigorous cross-section analysis method has been developed to generate the yield surfaces of arbitrary steel sections regardless of shapes. Such yield surfaces will be used to evaluate the full-yield condition, and the gradients to the yield surfaces will be calculated and used to control the plastic flow. The development of this methodology is presented in detail, as well as the derivation of the mathematical formulations. Six groups of verification examples are provided to validate the accuracy of the proposed method.",
    "keywords": [
      "Geometric and material nonlinear analysis",
      "Nonsymmetric cross-sections",
      "Steel",
      "Numerical analysis",
      "Tangent stiffness matrix",
      "Modified tangent modulus approach"
    ],
    "doi": "10.1016/j.jcsr.2022.107537",
    "link": "https://doi.org/10.1016/j.jcsr.2022.107537",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0143974X2200415X",
    "APA": "Chen, L., Gao, W.-L., Liu, S.-W., Ziemian, R. D., & Chan, S.-L. (2022). Geometric and material nonlinear analysis of steel members with nonsymmetric sections. Journal of Constructional Steel Research, 198, 107537.",
    "cv": "Chen, L., Gao, W.-L., Liu, S.-W.*, Ziemian, R. D., & Chan, S.-L. (2022). Geometric and material nonlinear analysis of steel members with nonsymmetric sections. Journal of Constructional Steel Research, 198, 107537.",
    "publication-date": "2022-11"
  },
  {
    "id": "J.48",
    "year": "2022",
    "title": "Innovative Timoshenko soil-pile integrated element for larger diameter laterally-loaded piles considering soil-pile interactions",
    "publisher": "Elsevier Ltd.",
    "volume": "152",
    "pages": "105020",
    "authors": [
      "Xue-You Li",
      "Hai-Peng Zhao",
      "Si-Wei Liu",
      "Jian-Hong Wan",
      "Rui Bai"
    ],
    "corresponding author": "Rui Bai",
    "journal": "Computers and Geotechnics",
    "abstract": "The large diameter piles (LDP) are designed to provide strong bearing capacity, which should be carefully analysed to ensure the superstructures’ reliability. The conventional discrete spring element (DSE) method with the Euler-Bernoulli beam element is inappropriate for LDPs as the pile’s shear deformations may be considerable. Besides, the nonlinear soil-pile interactions (SPI) cannot be conveniently simulated with the DSE method. To accurately and effectively evaluate the lateral performance of LDP under extreme load, this paper develops an innovative soil-pile integrated element based on the Timoshenko beam theory. The Green-Lagrange strain is used to formulate the potential energy function with the SPI considered. The Gauss integration method is adopted to simplify the element formulation and evaluate the SPI within the element end nodes. The secant and tangent matrixes are derived for calculating the element deformations and internal forces. The transformation matrix describing the nodal parameters’ relation between element local and global coordinate is presented for practical numerical analysis. The soil-pile integrated element avoids using discrete soil spring elements, significantly reducing the modelling and computing efforts. The verification examples demonstrate that the proposed soil-pile integrated element has high accuracy and efficiency in geometrically nonlinear analysis.",
    "keywords": [
      "Large diameter piles",
      "Timoshenko beam theory",
      "Soil-pile integrated element",
      "Soil-pile interaction",
      "Geometrically nonlinear analysis"
    ],
    "doi": "10.1016/j.compgeo.2022.105020",
    "link": "https://doi.org/10.1016/j.compgeo.2022.105020",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0266352X22004347",
    "APA": "Li, X.-Y., Zhao, H.-P., Liu, S.-W., Wan, J.-H., & Bai, R. (2022). Innovative Timoshenko soil-pile integrated element for larger diameter laterally-loaded piles considering soil-pile interactions. Computers and Geotechnics, 152, 105020.",
    "cv": "Li, X.-Y., Zhao, H.-P., Liu, S.-W., Wan, J.-H., & Bai, R.* (2022). Innovative Timoshenko soil-pile integrated element for larger diameter laterally-loaded piles considering soil-pile interactions. Computers and Geotechnics, 152, 105020.",
    "publication-date": "2022-12"
  },
  {
    "id": "J.49",
    "year": "2022",
    "title": "Generalized line-element formulations for geometrically nonlinear analysis of nonsymmetric tapered steel members with warping and Wagner effects",
    "publisher": "Elsevier Ltd.",
    "volume": "273",
    "pages": "115052",
    "authors": [
      "A.H.A. Abdelrahman",
      "Sameh Lotfy",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Engineering Structures",
    "abstract": "With advancements in manufacturing technology, steel members can be innovatively fabricated in nonsymmetric section shapes and tapered along the length to bring certain benefits in material utilization and aesthetic appearance. The frame analysis of the steel structures with these members is quite challenging because of lacking the suitable line-element formulations to robustly and efficiently consider tapered section characteristics together with the Warping and Wagner effects resulting from nonsymmetric section shapes. This research proposes generalized line-element formulations for geometrically nonlinear analysis of tapered steel members with nonsymmetric cross-sections, adequately assessing the member buckling behaviors. The element stiffness matrix is derived via the total potential energy, considering the axial and transverse elastic strains, the Warping deformations, and the Wagner effects. Parametric studies have been conducted to generate approximate equations for the geometric parameters of common shapes of nonsymmetric cross-sections, thereby reflecting the variable cross-section properties along the length. Afterwards, the generalized line-element tangent stiffness matrix is obtained, compatible with the existing frame analysis frameworks for easy programming. The element formulation is validated through several examples with the benchmark results generated by shell finite-elements. This work could be helpful for the sustainable development of modern steel structures with efficient material utilization and futuristic geometry.",
    "keywords": [
      "Buckling",
      "Nonsymmetric section",
      "Tapered members",
      "Line-element",
      "Nonlinear analysis"
    ],
    "doi": "10.1016/j.engstruct.2022.115052",
    "link": "https://doi.org/10.1016/j.engstruct.2022.115052",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0141029622010295",
    "APA": "Abdelrahman, A. H. A., Lotfy, S., & Liu, S.-W. (2022). Generalized line-element formulations for geometrically nonlinear analysis of nonsymmetric tapered steel members with warping and Wagner effects. Engineering Structures, 273, 115052.",
    "cv": "Abdelrahman, A. H. A., Lotfy, S., & Liu, S.-W*. (2022). Generalized line-element formulations for geometrically nonlinear analysis of nonsymmetric tapered steel members with warping and Wagner effects. Engineering Structures, 273, 115052.",
    "publication-date": "2022-12"
  },
  {
    "id": "J.50",
    "year": "2022",
    "title": "Efficient numerical algorithms for assessing the mechanical performance of corroded offshore steel sheet piles",
    "publisher": "Elsevier Ltd.",
    "volume": "266",
    "pages": "112776",
    "authors": [
      "Yi Yang",
      "Weihang Ouyang",
      "Ke Liu",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Ocean Engineering",
    "abstract": "Deterioration of offshore steel sheet pile walls subjected to corrosion may significantly affect the structural performance under serviceability and failure. Most steel corrosion studies focused on the mechanism of reflecting the actual corrosion situations to establish a relatively realistic corrosion model. The mechanical performances of the material loss phenomenon in the offshore steel sheet piles are useful for assessing their in-service and life cycle conditions. In this paper, the general power corrosion model is adopted to reflect the changes in the material and section properties of the pile and combine with the p-y curve method to formulate a new pile element to consider the corrosion effect. The Updated-Lagrangian (UL) method and the newly-developed element formulations are integrated into a modified Newton-Raphson method to eliminate the repetitive modelling process when considering the varied mechanical properties under different corrosion levels. After verifying the accuracy of the present numerical method, parametric studies have been considered to explore the effects of the changes of the annual corrosion rates and the trends of corrosion progress on the offshore steel sheet piles. The annual corrosion rate in the immersion zone plays an important role in the mechanical performance of offshore structures in a marine environment.",
    "keywords": [
      "Corrosion",
      "Time-dependent mechanical performances",
      "Steel sheet piles",
      "Marine structures"
    ],
    "doi": "10.1016/j.oceaneng.2022.112776",
    "link": "https://doi.org/10.1016/j.oceaneng.2022.112776",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0029801822022493",
    "APA": "Yang, Y., Ouyang, W., Liu, K., & Liu, S.-W. (2022). Efficient numerical algorithms for assessing the mechanical performance of corroded offshore steel sheet piles. Ocean Engineering, 266, 112776.",
    "cv": "Yang, Y., Ouyang, W., Liu, K., & Liu, S.-W.* (2022). Efficient numerical algorithms for assessing the mechanical performance of corroded offshore steel sheet piles. Ocean Engineering, 266, 112776.",
    "publication-date": "2022-12"
  },
  {
    "id": "J.51",
    "year": "2023",
    "title": "Natural frequency analysis of monopile supported offshore wind turbines using unified beam-column element model",
    "publisher": "MDPI",
    "volume": "11",
    "pages": "628",
    "authors": [
      "Jian-Hong Wan",
      "Rui Bai",
      "Xue-You Li",
      "Si-Wei Liu"
    ],
    "corresponding author": "Xue-You Li",
    "journal": "Journal of Marine Science and Engineering",
    "abstract": "Assessment of the natural frequency of the offshore wind turbine (OWT) system is a critical task in design to avoid resonance. The natural frequency of the monopile supported OWT may change during operation and needs to be calculated regularly. Conventional numerical methods separately model different components of the OWT system using various element types, which require tedious data manipulations and are inefficient to assess the changing natural frequency of the monopile supported OWTs. This paper develops a unified beam-column element by directly integrating the soil-pile interactions in element formulation. The proposed method is applicable for different components of the OWT system, including the rotor, the tower, the transition piece, and the monopile foundation, which enables an integrated and efficient OWT analysis by using only one type of element. The pile-soil interactions are directly considered in the element formulation. The tedious soil spring elements are avoided. Definitions and formulations of the proposed element are provided and the numerical solution procedure for the natural frequency analysis of OWTs is illustrated. The accuracy of the proposed element is validated against several closed-form solutions and the distributed spring model. The proposed method is also applied to analyze the natural frequencies of six OWTs in practice. The calculated results are consistent with the field measured data.",
    "keywords": [
      "Natural frequency",
      "Offshore wind turbines (OWTs)",
      "Pile-soil interaction",
      "Numerical method",
      "Mass matrix"
    ],
    "doi": "10.3390/jmse11030628",
    "link": "https://doi.org/10.3390/jmse11030628",
    "weblink": "https://www.mdpi.com/2077-1312/11/3/628",
    "APA": "Wan, J.-H., Bai, R., Li, X.-Y., & Liu, S.-W. (2023). Natural frequency analysis of monopile supported offshore wind turbines using unified beam-column element model. Journal of Marine Science and Engineering, 11(3), 628.",
    "cv": "Wan, J.-H., Bai, R., Li, X.-Y.*, & Liu, S.-W. (2023). Natural frequency analysis of monopile supported offshore wind turbines using unified beam-column element model. Journal of Marine Science and Engineering, 11(3), 628.",
    "publication-date": "2023-03-16"
  },
  {
    "id": "J.52",
    "year": "2023",
    "title": "Co-rotational formulations for geometrically nonlinear analysis of beam-columns including warping and Wagner effects",
    "publisher": "World Scientific Publishing Company",
    "volume": "23",
    "pages": "2350052",
    "authors": [
      "Liang Chen",
      "Si-Wei Liu",
      "Rui Bai",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Rui Bai",
    "journal": "International Journal of Structural Stability and Dynamics",
    "abstract": "The warping effects may predominate in geometrically nonlinear analysis of open cross-section members. The formulation of conventional beam-column elements incorporating the warping effects is cumbersome due to the method considering the inconsistency between the shear center and centroid. To develop a concise warping element formulation, this paper presents a transformation matrix to integrate the inconsistent effects into the element stiffness matrix. The co-rotational (CR) method used to establish the element equilibrium conditions in the geometrically nonlinear analysis is adopted to simplify the element formulation and improve the efficiency of nonlinear analysis. A new beam-column element explicitly considering the warping deformation and the Wagner effects is derived based on the CR method and the Euler–Bernoulli beam theory. A detailed kinematic description is provided for considering large deflections and rigid body motions. Based on the mechanical characteristic, the coordinate and the rigid body motion transformation matrices are given. The secant relationship is developed to evaluate the element internal forces accurately and effectively in each iteration. Several verification examples are provided to validate the proposed method's reliability and robustness. The verifications demonstrate that the proposed element leads to considerable computational advantages. The results of this paper are useful for future upgrading of frame analysis software with warping degrees-of-freedom (DOFs).",
    "keywords": [
      "Beam-column element",
      "Co-rotational method",
      "Warping",
      "Wagner effects",
      "Geometrically nonlinear analysis"
    ],
    "doi": "10.1142/S0219455423500529",
    "link": "https://doi.org/10.1142/S0219455423500529",
    "weblink": "https://www.worldscientific.com/doi/pdf/10.1142/S0219455423500529",
    "APA": "Chen, L., Liu, S.-W., Bai, R., & Chan, S.-L. (2023). Co-rotational formulations for geometrically nonlinear analysis of beam-columns including warping and Wagner effects. International Journal of Structural Stability and Dynamics, 23(5), 2350052.",
    "cv": "Chen, L., Liu, S.-W., Bai, R.*, & Chan, S.-L. (2023). Co-rotational formulations for geometrically nonlinear analysis of beam-columns including warping and Wagner effects. International Journal of Structural Stability and Dynamics, 23(5), 2350052.",
    "publication-date": "2023-03-30"
  },
  {
    "id": "J.53",
    "year": "2023",
    "title": "Integrated soil–pile elements for inelastic design of steel piles considering lateral soil–pile interactions",
    "publisher": "American Society of Civil Engineers",
    "volume": "23",
    "pages": "04023048",
    "authors": [
      "Ji-Hui Ning",
      "Rui Bai",
      "Si-Wei Liu",
      "Wei Huang"
    ],
    "corresponding author": "Rui Bai",
    "journal": "International Journal of Geomechanics",
    "abstract": "Steel piles are widely used in deep foundation systems to transfer significant structural loads to strong soil layers. A steel pile may buckle or fail by forming multiple plastic hinges at different locations. The pile’s plastic hinge distributions and failure mode are considerably affected by soil–pile interactions (SPIs). A proper consideration of SPIs is essential for the successful design of a steel pile foundation. In practice, empirical calculation or numerical modeling analysis methods are commonly utilized. Nevertheless, the conventional design methods are cumbersome in the modeling process and may be inaccurate in considering SPIs. This paper develops a new integrated soil–pile element to explicitly reflect SPIs and capture steel piles’ inelastic behaviors based on the plastic hinge method and the Euler–Bernoulli beam theory. Two virtual nonlinear springs, the concentrated rotational and distributed lateral springs, are used to simulate the plastic hinge deformations and the soil responses, respectively. The rotational and lateral springs are assigned at both ends and the Gauss integration points of an element, respectively. The Gaussian quadrature method is utilized to consider the soil reactions and generate the soil stiffness matrix. Based on the numerical integration and condensation methods, the virtual springs are directly integrated into the element formulation, simplifying the programming and practical modeling process. The updated Lagrangian approach is adopted for describing the element kinematic motions. The element tangent and secant relations between nodal forces and displacements are derived based on the potential energy principle. Several verification examples are presented to demonstrate the capability of the proposed element.",
    "keywords": [
      "Integrated soil–pile element",
      "Steel pile",
      "Inelastic analysis",
      "Soil–pile interaction",
      "Plastic hinge method"
    ],
    "doi": "10.1061/IJGNAI.GMENG-8256",
    "link": "https://doi.org/10.1061/IJGNAI.GMENG-8256",
    "weblink": "https://ascelibrary.org/doi/epdf/10.1061/IJGNAI.GMENG-8256",
    "APA": "Ning, J.-H., Bai, R., Liu, S.-W., & Huang, W. (2023). Integrated soil–pile elements for inelastic design of steel piles considering lateral soil–pile interactions. International Journal of Geomechanics, 23(5), 04023048.",
    "cv": "Ning, J.-H., Bai, R.*, Liu, S.-W., & Huang, W. (2023). Integrated soil–pile elements for inelastic design of steel piles considering lateral soil–pile interactions. International Journal of Geomechanics, 23(5), 04023048.",
    "publication-date": "2023-05"
  },
  {
    "id": "J.54",
    "year": "2023",
    "title": "Three-dimensional pipeline element formulation for global buckling analysis of submarine pipelines with sleeper",
    "publisher": "Elsevier Ltd.",
    "volume": "90",
    "pages": "103428",
    "authors": [
      "Jihui Ning",
      "Tong Lin",
      "Siwei Liu",
      "Rui Bai",
      "Wei Huang"
    ],
    "corresponding author": "Wei Huang",
    "journal": "Marine Structures",
    "abstract": "Submarine pipelines can utilize sleepers to control global buckling location, which mitigates potential risks under high temperature and pressure. However, pipelines with sleepers require execution in three-dimensional space and experience lateral buckling modes. As such, this paper proposes a 3D pipeline element for lateral buckling analysis, building on previous 2D element formulations. This new element considers non-linear pipe-soil interactions, thermal expansion, axial load, initial imperfections, large deflection, and other major factors that affect lateral buckling. The derivations of the 3D pipeline element are provided in detail, and the numerical analysis procedure is elaborated. To validate the accuracy and efficiency of the proposed 3D pipeline element, several examples are presented.",
    "keywords": [
      "3D pipeline element",
      "Global buckling",
      "Unburied subsea pipelines",
      "Sleeper",
      "Nonlinear pipe-soil interactions",
      "High temperature high pressure"
    ],
    "doi": "10.1016/j.marstruc.2023.103428",
    "link": "https://doi.org/10.1016/j.marstruc.2023.103428",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0951833923000618",
    "APA": "Ning, J., Lin, T., Liu, S., Bai, R., & Huang, W. (2023). Three-dimensional pipeline element formulation for global buckling analysis of submarine pipelines with sleeper. Marine Structures, 90, 103428.",
    "cv": "Ning, J., Lin, T., Liu, S., Bai, R., & Huang, W.* (2023). Three-dimensional pipeline element formulation for global buckling analysis of submarine pipelines with sleeper. Marine Structures, 90, 103428.",
    "publication-date": "2023-07"
  },
  {
    "id": "J.55",
    "year": "2023",
    "title": "Efficient numerical implementation for nonlinear analysis of pile-supported structures during soil liquefaction through adaptive pile element formulations",
    "publisher": "Elsevier Ltd.",
    "volume": "174",
    "pages": "108207",
    "authors": [
      "Weihang Ouyang",
      "An-Rui Liang",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Soil Dynamics and Earthquake Engineering",
    "abstract": "The structural behavior of pile-supported structures during soil liquefaction is sometimes insufficiently investigated properly due to the inefficiency in the existing line finite element method (LFEM), which is widely used in practice. The traditional LFEM to simulate pile response requires dense element mesh for accurate results, as it simplifies the continuous surrounding soil as discrete spring elements, resulting in high computational costs, especially for pile-supported structures with a significant number of piles. Additionally, analyzing pile-supported structures in different stages of soil liquefaction requires repetitive updating of p-y curves and tedious starting-over iteration processes. To address these issues, an innovative line element formulation named the pile element formulation is employed and improved to adaptively simulate the surrounding soil conditions at different stages during liquefaction within the element formulation, eliminating the need to model discrete soil springs and significantly improving computational efficiency. The adaptive pile element formulation is then implemented within a refined Newton-Raphson iteration procedure that is proposed for a more effective nonlinear analysis process to consider soil liquefaction without repetitive iteration processes from starting over. Through several examples, the computational efficiency of the proposed method is validated, which requires only 20% of the computational cost compared to traditional LFEM while still providing accurate results, highlighting the application potential of the present study.",
    "keywords": [
      "Pile-supported structures",
      "Soil liquefaction",
      "p-y curve",
      "Line finite element method"
    ],
    "doi": "10.1016/j.soildyn.2023.108207",
    "link": "https://doi.org/10.1016/j.soildyn.2023.108207",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0267726123004529",
    "APA": "Ouyang, W., Liang, A.-R., & Liu, S.-W. (2023). Efficient numerical implementation for nonlinear analysis of pile-supported structures during soil liquefaction through adaptive pile element formulations. Soil Dynamics and Earthquake Engineering, 174, 108207.",
    "cv": "Ouyang, W., Liang, A.-R., & Liu, S.-W.* (2023). Efficient numerical implementation for nonlinear analysis of pile-supported structures during soil liquefaction through adaptive pile element formulations. Soil Dynamics and Earthquake Engineering, 174, 108207.",
    "publication-date": "2023-11"
  },
  {
    "id": "J.56",
    "year": "2023",
    "title": "Research on horizontal bearing capacity of monopile supporting structure of offshore wind turbine based on efficient pile finit-element method",
    "publisher": "Chinese Society for Theoretical and Applied Mechanics",
    "volume": "40",
    "pages": "99-109",
    "authors": [
      "Shu-ye Zhang",
      "Si-wei Liu",
      "Hui-huan Ma"
    ],
    "corresponding author": "Si-wei Liu",
    "journal": "Engineering Mechanics",
    "abstract": "The monopile supporting structure of offshore wind turbines is subjected to complex horizontal loads such as wind and waves during operation, and the horizontal bearing capacity of the monopile is a key factor affecting the safety of the structure. This paper proposes an efficient pile finite-element method for analyzing the horizontal bearing capacity of monopile supporting structures. The method integrates the p-y curve model into the element formulation, eliminating the need for discrete soil springs, and significantly improving computational efficiency. The method is validated against existing analytical solutions and finite element results. Parametric studies are conducted to investigate the influence of pile diameter, wall thickness, penetration depth, and soil properties on the horizontal bearing capacity of monopiles. The results show that increasing pile diameter and wall thickness can effectively improve the horizontal bearing capacity, while the influence of penetration depth is more significant in soft soils.",
    "keywords": [
      "Offshore wind turbine",
      "Monopile",
      "Horizontal bearing capacity",
      "Pile finite-element method",
      "p-y curve"
    ],
    "doi": "10.6052/j.issn.1000-4750.2022.01.0112",
    "link": "https://doi.org/10.6052/j.issn.1000-4750.2022.01.0112",
    "APA": "Zhang, S.-y., Liu, S.-w., & Ma, H.-h. (2023). Research on horizontal bearing capacity of monopile supporting structure of offshore wind turbine based on efficient pile finit-element method. Engineering Mechanics, 40(11), 99-109.",
    "cv": "Zhang, S.-y., Liu, S.-w.*, & Ma, H.-h. (2023). Research on horizontal bearing capacity of monopile supporting structure of offshore wind turbine based on efficient pile finit-element method. Engineering Mechanics, 40(11), 99-109.",
    "publication-date": "2023-11"
  },
  {
    "id": "J.57",
    "year": "2023",
    "title": "Second-order analysis of beam-columns by machine learning-based structural analysis through physics-informed neural networks",
    "publisher": "The Hong Kong Institute of Steel Construction",
    "volume": "19",
    "pages": "411–420",
    "authors": [
      "Liang Chen",
      "Hao-Yi Zhang",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Advanced Steel Construction",
    "abstract": "The second-order analysis of slender steel members could be challenging, especially when large deflection is involved. This paper proposes a novel machine learning-based structural analysis (MLSA) method for second-order analysis of beam-columns, which could be a promising alternative to the prevailing solutions using over-simplified analytical equations or traditional finite-element-based methods. The effectiveness of the conventional machine learning method heavily depends on both the qualitative and the quantitative of the provided data. However, such data are typically scarce and expensive to obtain in structural engineering practices. To address this problem, a new and explainable machine learning-based method, named Physics-informed Neural Networks (PINN), is employed, where the physical information will be utilized to orientate the learning process to create a self-supervised learning procedure, making it possible to train the neural network with few or even no predefined datasets to achieve an accurate approximation. This research extends the PINN method to the problems of second-order analysis of steel beam-columns. Detailed derivations of the governing equations, as well as the essential physical information for the training process, are given. The PINN framework and the training procedure are provided, where an adaptive loss weight control algorithm and the transfer learning technic are adopted to improve numerical efficiency. The practicability and accuracy of which are validated by four sets of verification examples.",
    "keywords": [
      "Beam-columns",
      "Physics-informed neural networks",
      "Second-order analysis",
      "Machine learning"
    ],
    "doi": "10.18057/IJASC.2023.19.4.10",
    "link": "https://doi.org/10.18057/IJASC.2023.19.4.10",
    "weblink": "https://www.ascjournal.com/down/vol19no4/Vol19no4_10.pdf",
    "APA": "Chen, L., Zhang, H.-Y., Liu, S.-W., & Chan, S.-L. (2023). Second-order analysis of beam-columns by machine learning-based structural analysis through physics-informed neural networks. Advanced Steel Construction, 19(4), 411–420.",
    "cv": "Chen, L., Zhang, H.-Y., Liu, S.-W.*, & Chan, S.-L. (2023). Second-order analysis of beam-columns by machine learning-based structural analysis through physics-informed neural networks. Advanced Steel Construction, 19(4), 411–420.",
    "publication-date": "2023-12-01"
  },
  {
    "id": "J.58",
    "year": "2023",
    "title": "Geometrically nonlinear analysis of steel structures with nonsymmetric sections under elevated temperatures",
    "publisher": "Elsevier Ltd.",
    "volume": "211",
    "pages": "108205",
    "authors": [
      "Liang Chen",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "Steel members using nonsymmetric sections are envisioned as popular because of the advancement in manufacturing techniques, in which frame analysis method under extreme scenarios, such as fire hazards, has not been thoroughly established. The element formulation for those members has been commonly derived based on either the updated-Lagrangian (UL) or the total-Lagrangian (TL) methods. However, the UL method is difficult to analyze the steel member exposed to fires because the previous equilibrium conditions may be destroyed due to the material stiffness degradation at elevated temperatures. Nevertheless, the TL method can be used for studying steel members under fire, but it is inefficient, time-consuming, and requires starting-over computation at every temperature increment. To this, the co-rotational (CR) method could be a promising solution for tackling the analysis problems of steel members in fire efficiently and accurately. The CR method separately describes the element and its rigid body movements, such that the material stiffness degradation can be considered at the element level without the starting-over computation at new temperature increments, which is numerically efficient. This paper reformulates the beam-column element formulation with the warping degree of freedom for nonsymmetric section members using the CR method, which can conveniently consider the material degradation and the thermal expansion for the analysis of steel members at elevated temperatures. The lateral-torsional and flexural-torsional buckling of nonsymmetric section members can be captured robustly. Detailed derivation for element formulation is given, and several examples are provided for verifying the accuracy and examining the robustness of the proposed method.",
    "keywords": [
      "Steel",
      "Nonsymmetric section",
      "Warping",
      "Wagner effects",
      "Fire",
      "Co-rotational formulation"
    ],
    "doi": "10.1016/j.jcsr.2023.108205",
    "link": "https://doi.org/10.1016/j.jcsr.2023.108205",
    "weblink": "https://www.sciencedirect.com/science/article/pii/S0143974X23004327",
    "APA": "Chen, L., Liu, S.-W., & Chan, S.-L. (2023). Geometrically nonlinear analysis of steel structures with nonsymmetric sections under elevated temperatures. Journal of Constructional Steel Research, 211, 108205.",
    "cv": "Chen, L., Liu, S.-W.*, & Chan, S.-L. (2023). Geometrically nonlinear analysis of steel structures with nonsymmetric sections under elevated temperatures. Journal of Constructional Steel Research, 211, 108205.",
    "publication-date": "2023-12"
  },
  {
    "id": "J.59",
    "year": "2024",
    "title": "Efficient line-element method for the second-order analysis of steel members with nonsymmetric thick-walled cross sections",
    "publisher": "American Society of Civil Engineers",
    "volume": "150",
    "pages": "04023226",
    "authors": [
      "Liang Chen",
      "Hao-Yi Zhang",
      "Si-Wei Liu",
      "Ronald D. Ziemian"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Journal of Structural Engineering",
    "abstract": "When designing steel members with nonsymmetric cross sections, it is essential to consider twisting effects when performing the ANSI/AISC 360-22. Existing line-element formulations for nonsymmetric sections are mostly derived based on thin-walled assumptions, leading to an overestimation of member strength due to the inaccurate prediction of member behavior, especially when the cross sections have moderate wall thickness. This paper proposes an efficient line-element method for second-order analysis of steel members with nonsymmetric thick-walled sections considering the warping degree of freedom (DOF) and the twisting effects along with the transverse shear deformations. Additionally, a two-dimensional (2D) finite-element cross section analysis method employing the constant strain triangle (CST) element is developed to calculate the section properties for arbitrary cross sections, including the Wagner and the shear coefficients. The proposed method is implemented in the educational structural analysis software MASTAN2 and verified through two sets of examples.",
    "keywords": [
      "Finite-element method",
      "Thick-walled sections",
      "Timoshenko beam-column element",
      "Shear coefficients",
      "Warping",
      "Twisting effects",
      "Second-order analysis"
    ],
    "doi": "10.1061/JSENDH.STENG-12543",
    "link": "https://doi.org/10.1061/JSENDH.STENG-12543",
    "weblink": "https://ascelibrary.org/doi/epdf/10.1061/JSENDH.STENG-12543",
    "APA": "Chen, L., Zhang, H.-Y., Liu, S.-W., & Ziemian, R. D. (2024). Efficient line-element method for the second-order analysis of steel members with nonsymmetric thick-walled cross sections. Journal of Structural Engineering, 150(2), 04023226.",
    "cv": "Chen, L., Zhang, H.-Y., Liu, S.-W.*, & Ziemian, R. D. (2024). Efficient line-element method for the second-order analysis of steel members with nonsymmetric thick-walled cross sections. Journal of Structural Engineering, 150(2), 04023226.",
    "publication-date": "2024-02"
  },
  {
    "id": "J.60",
    "year": "2024",
    "title": "Refined three-dimensional pile element formulation for second-order analysis of pile-supported structures accounting for complex loading conditions",
    "publisher": "Elsevier Ltd.",
    "volume": "301",
    "pages": "117281",
    "authors": [
      "Weihang Ouyang",
      "Rui Bai",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Engineering Structures",
    "abstract": "The second-order analysis method is a simulation-based design method but less utilized for pile-supported structures due to the current inaccurate and unstable analysis methods for piles, especially for those under complex loading conditions in pile-supported structures. A refined Three-dimensional Pile Element (3DPE) formulation is proposed to promote the application of the second-order analysis method in pile-supported structures. The proposed refined 3DPE formulation can efficiently capture the nonlinear Soil-Structure Interaction (SSI) that is over-simplified in the conventional analysis method. Compared with the existing Pile Element formulation, the proposed refined 3DPE formulation can more accurately capture the structural behaviors of piles under complex loading conditions, including the shear effect and axial-torsional coupled response. Furthermore, three soil stiffness matrices are firstly proposed to improve the numerical stability of the spatial analysis using the existing element formulation. Extensive examples are provided to validate the effectiveness of the refined 3DPE formulation, indicating its applicability in extending the second-order analysis to pile-supported structures.",
    "keywords": [
      "Second-order analysis",
      "Pile-supported structures",
      "Soil-Structure Interaction",
      "Pile element"
    ],
    "doi": "10.1016/j.engstruct.2023.117281",
    "link": "https://doi.org/10.1016/j.engstruct.2023.117281",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0141029623016966",
    "APA": "Ouyang, W., Bai, R., Liu, S.-W., & Chan, S.-L. (2024). Refined three-dimensional pile element formulation for second-order analysis of pile-supported structures accounting for complex loading conditions. Engineering Structures, 301, 117281.",
    "cv": "Ouyang, W., Bai, R., Liu, S.-W.*, & Chan, S.-L. (2024). Refined three-dimensional pile element formulation for second-order analysis of pile-supported structures accounting for complex loading conditions. Engineering Structures, 301, 117281.",
    "publication-date": "2024-02"
  },
  {
    "id": "J.61",
    "year": "2024",
    "title": "An investigation on the effect of random pitting corrosion on the strength of the subsea pipeline using Monte Carlo method",
    "publisher": "The Hong Kong Institute of Steel Construction",
    "volume": "20",
    "pages": "93–104",
    "authors": [
      "Tong Lin",
      "Wei Huang",
      "Si-Wei Liu",
      "Rui Bai"
    ],
    "corresponding author": "Wei Huang",
    "journal": "Advanced Steel Construction",
    "abstract": "Pitting corrosion is normally distributed randomly along the pipeline, which is the source of the uncertainty affecting the ultimate bearing capacity of the submarine pipelines. So the Monte Carlo method is employed to study the effect of pitting corrosion on the upheaval buckling behavior of the pipeline. A corroded pipeline model with randomly distributed pitting corrosion is utilized to captures the intricate realities of corrosion scenarios. Multiple corrosion models with distinct artificial patterns have been meticulously crafted. Additionally, a new pipeline element based on Euler-Bernoulli beam theory is extended considering corroded sections, pipe-soil interactions, axial load, initial imperfections, and other major factors. Moreover, the bearing capacity, vertical deformation and section stress of the pipeline under corrosion is discussed thoroughly, wherein a Newton- Raphson typed numerical analysis procedure is utilized for nonlinear analysis of the upheaval buckling of pipelines. The influence of corrosion parameters such as the corrosion depth, corrosion ratio and area loss ratio on mechanical properties of the submarine pipelines is further analyzed in detail. It’s indicated that varying patterns of corrosion distribution, despite exhibiting identical corrosion parameters, can result in distinct reduction factors and vertical buckling displacements.",
    "keywords": [
      "Monte Carlo method",
      "Corrosion",
      "Pipeline element",
      "Upheaval buckling",
      "Submarine pipelines"
    ],
    "doi": "10.18057/IJASC.2024.20.1.10",
    "link": "https://doi.org/10.18057/IJASC.2024.20.1.10",
    "weblink": "https://www.ascjournal.com/index.php?option=com_content&view=article&id=674:vol20no1-10&catid=153:vol20no1&Itemid=538",
    "APA": "Lin, T., Huang, W., Liu, S.-W., & Bai, R. (2024). An investigation on the effect of random pitting corrosion on the strength of the subsea pipeline using Monte Carlo method. Advanced Steel Construction, 20(1), 93–104.",
    "cv": "Lin, T., Huang, W.*, Liu, S.-W., & Bai, R. (2024). An investigation on the effect of random pitting corrosion on the strength of the subsea pipeline using Monte Carlo method. Advanced Steel Construction, 20(1), 93–104.",
    "publication-date": "2024-03-01"
  },
  {
    "id": "J.62",
    "year": "2024",
    "title": "Physics-informed neural networks for large deflection analysis of slender piles incorporating non-differentiable soil-structure interaction",
    "publisher": "John Wiley & Sons Ltd.",
    "volume": "48",
    "pages": "1-31",
    "authors": [
      "Weihang Ouyang",
      "Guanhua Li",
      "Liang Chen",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "International Journal for Numerical and Analytical Methods in Geomechanics",
    "abstract": "Physics‐informed neural networks (PINN) is an emerging machine learning technique and has been applied in different areas successfully. To benefit pile analysis from this innovative technique, this paper addresses several problems that arise when extending PINN to the large deflection analysis of slender piles accounting for nonlinear Soil-Structure Interaction (SSI). The governing equations for the structural behavior of piles, considering geometric nonlinearity, are elaborated at first, based on which a PINN framework is constructed correspondingly with a model training process. A series of normalization factors are introduced to the loss function to enhance model training stability. Additionally, a regression-based soil resistance estimation is developed to prevent non-convergence and instability that may occur during the model training when encountering non-differentiable SSI. Extensive examples are provided to validate the robustness and accuracy of the proposed analysis method for piles under complex geological conditions. Furthermore, several case studies are conducted, revealing the necessity of appropriate loss normalization and the effectiveness of regression-based estimation for reflecting non-differentiable functions in the PINN study.",
    "keywords": [
      "large deflection",
      "machine learning",
      "physics-informed neural networks",
      "piles",
      "soil-structure interaction"
    ],
    "doi": "10.1002/nag.3679",
    "link": "https://doi.org/10.1002/nag.3679",
    "weblink": "https://onlinelibrary.wiley.com/doi/abs/10.1002/nag.3679",
    "APA": "Ouyang, W., Li, G., Chen, L., & Liu, S.-W. (2024). Physics-informed neural networks for large deflection analysis of slender piles incorporating non-differentiable soil-structure interaction. International Journal for Numerical and Analytical Methods in Geomechanics, 48, 1-31.",
    "cv": "Ouyang, W., Li, G., Chen, L., & Liu, S.-W.* (2024). Physics-informed neural networks for large deflection analysis of slender piles incorporating non-differentiable soil-structure interaction. International Journal for Numerical and Analytical Methods in Geomechanics, 48, 1-31.",
    "publication-date": "2024-04"
  },
  {
    "id": "J.63",
    "year": "2024",
    "title": "Bifurcation buckling load of steel angle with random corrosion damage",
    "publisher": "The Hong Kong Institute of Steel Construction",
    "volume": "20",
    "pages": "149–159",
    "authors": [
      "Liang Chen",
      "Jing-Zhou Zhang",
      "Si-Wei Liu",
      "Zhi-Wei Yu"
    ],
    "corresponding author": "Jing-Zhou Zhang",
    "journal": "Advanced Steel Construction",
    "abstract": "This paper numerically studies the bifurcation buckling load of steel angle members affected by random corrosion pits. Six million Monte Carlo simulations are conducted, in which the effects of member length, section type, area loss ratio, and corrosion depth on the bifurcation buckling load of steel angles are considered. The key statistical characteristics of the reduction factors of buckling load for steel angles are analyzed. A probability-based relationship between the reduction factor of buckling load and the area loss ratio of steel angles is also proposed for the practical design. It is found that corrosion can potentially change the buckling mode of steel angle members from flexural buckling to torsional buckling. When the member length is small, the bifurcation buckling load of the steel angle is significantly affected by the corrosion depth. However, with the increase in member length, the effect of corrosion depth tends to decrease. The reduction factors of the buckling load of steel angles follow a normal distribution. A larger area loss ratio will result in a larger standard deviation of the reduction factors. For steel angles with the same area loss ratio, the mean values of the reduction factors of different section types are very close.",
    "keywords": [
      "Buckling load",
      "Steel angle",
      "Random corrosion",
      "Monte Carlo simulation",
      "Area loss ratio",
      "Corrosion depth"
    ],
    "doi": "10.18057/IJASC.2024.20.2.7",
    "link": "https://doi.org/10.18057/IJASC.2024.20.2.7",
    "weblink": "https://www.ascjournal.com/index.php?option=com_content&view=article&id=681:vol20no2-7&catid=153:vol20no2&Itemid=538",
    "APA": "Chen, L., Zhang, J.-Z., Liu, S.-W., & Yu, Z.-W. (2024). Bifurcation buckling load of steel angle with random corrosion damage. Advanced Steel Construction, 20(2), 149–159.",
    "cv": "Chen, L., Zhang, J.-Z.*, Liu, S.-W., & Yu, Z.-W. (2024). Bifurcation buckling load of steel angle with random corrosion damage. Advanced Steel Construction, 20(2), 149–159.",
    "publication-date": "2024-06-01"
  },
  {
    "id": "J.64",
    "year": "2024",
    "title": "Static analysis of two-side supported 2-ply laminated glass panes through physics-informed neural networks",
    "publisher": "Elsevier Ltd.",
    "volume": "309",
    "pages": "118038",
    "authors": [
      "Guanhua Li",
      "Wenjing Ouyang",
      "Weihang Ouyang",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Engineering Structures",
    "abstract": "This paper utilizes an emerging machine learning technique, namely physics-informed neural networks (PINNs), to analyze the static mechanical behavior of two-side supported 2-ply laminated glass panes. The PINN model utilizes prior physical information in the form of partial differential equations during model training, eliminating the need for tremendous amounts of data required by traditional data-driven machine learning methods. The governing equations for the structural behavior of two-side supported 2-ply laminated glass panes are derived, based on which a PINN framework encompassing the neural network architecture and the loss functions is constructed. The training stability is evidently improved after the linearly inducing process, with the relative error maintained within a reasonable range. Extensive validation examples and case studies are provided to demonstrate the accuracy and effectiveness of the proposed method. Composite action analysis results reveal that below 70 % in the design is a conservative estimate for thinner laminated glass. Furthermore, the PINN method achieves exceptional computational efficiency, reducing computational times from six hours to just a few minutes for the uncertainty evaluation of laminated glass, indicating its potential in engineering practice.",
    "keywords": [
      "Laminated glass",
      "Machine learning",
      "Physics-informed neural network",
      "Numerical method",
      "Composite action",
      "Uncertainty evaluation"
    ],
    "doi": "10.1016/j.engstruct.2024.118038",
    "link": "https://doi.org/10.1016/j.engstruct.2024.118038",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S014102962400600X",
    "APA": "Li, G., Ouyang, W., Ouyang, W., & Liu, S.-W. (2024). Static analysis of two-side supported 2-ply laminated glass panes through physics-informed neural networks. Engineering Structures, 309, 118038.",
    "cv": "Li, G., Ouyang, W., Ouyang, W., & Liu, S.-W.* (2024). Static analysis of two-side supported 2-ply laminated glass panes through physics-informed neural networks. Engineering Structures, 309, 118038.",
    "publication-date": "2024-06"
  },
  {
    "id": "J.65",
    "year": "2024",
    "title": "Progressive collapse of system scaffolds with accidental removal of bracing members",
    "publisher": "Elsevier Ltd.",
    "volume": "218",
    "pages": "108720",
    "authors": [
      "Jake L.Y. Chan",
      "Siu-Lai Chan",
      "Yao-Peng Liu",
      "Si-Wei Liu"
    ],
    "corresponding author": "Siu-Lai Chan",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "Steel scaffolds are widely used as temporary supports in construction. A single or a series of braces in a system scaffold is occasionally removed by workers for ease of access or by incidental damage, thus undermining the load capacity and robustness of the overall structure. Based on the Cubic Quadruple Function (CQF) element proposed by the authors, a reliable and safe practical design is suggested to allow for plastic hinges formation with plastic moment redistribution in transoms, braces and ledgers but the failure load is assumed once a plastic hinge is formed at standards and posts which are predominantly under axial compressions, leading to buckling with small moment redistribution capability. This research paper studies the reduced load capacities of scaffolds under a common incident of removal of a group of bracing members, by workers in other trades during construction. Findings in this paper are useful for code development, engineers for erection of system scaffolds against possible progressive collapse and site inspectors. We further propose that an unfactored working load design approach should be adopted to check scaffold stability using the global collapse load factor concept, rather than using the limit state factored loads in some codes such as the Eurocode EN12811 which is more appropriate for permanent structures with much longer design life.",
    "keywords": [
      "Scaffold",
      "Progressive collapse",
      "Second order effect"
    ],
    "doi": "10.1016/j.jcsr.2024.108720",
    "link": "https://doi.org/10.1016/j.jcsr.2024.108720",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0143974X24002700",
    "APA": "Chan, J. L. Y., Chan, S.-L., Liu, Y.-P., & Liu, S.-W. (2024). Progressive collapse of system scaffolds with accidental removal of bracing members. Journal of Constructional Steel Research, 218, 108720.",
    "cv": "Chan, J. L. Y., Chan, S.-L.*, Liu, Y.-P., & Liu, S.-W. (2024). Progressive collapse of system scaffolds with accidental removal of bracing members. Journal of Constructional Steel Research, 218, 108720.",
    "publication-date": "2024-07"
  },
  {
    "id": "J.66",
    "year": "2024",
    "title": "Machine learning-based soil–structure interaction analysis of laterally loaded piles through physics-informed neural networks",
    "publisher": "Springer-Verlag GmbH Germany, part of Springer Nature",
    "volume": "19",
    "pages": "1635-1657",
    "authors": [
      "Weihang Ouyang",
      "Guanhua Li",
      "Liang Chen",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Acta Geotechnica",
    "abstract": "This research adopts emerging machine learning techniques to tackle the soil–structure interaction analysis problems of laterally loaded piles through physics-informed neural networks (PINNs), which employs prior physical information in the form of partial differential equations during the model training, eliminating the tremendous data requirement in the traditional data-driven machine learning methods. The formulations to describe the problem are discussed, and the corresponding governing equations are derived. A PINN framework, including neural networks architecture and loss functions, is developed for the machine learning-based solution and elaborated with details. The corresponding model training process is presented, based on which the surrogate model construction and back analysis implementation are introduced to demonstrate the effectiveness and flexibility of the proposed method. This method has been demonstrated for its accuracy via several examples with benchmark solutions from the existing well-developed methods. Finally, a case study of the uncertainty evaluation of a laterally loaded pile is conducted to illustrate its high computational efficiency and advantages in potential engineering applications.",
    "keywords": [
      "Machine learning",
      "Numerical method",
      "Piles",
      "Physics-informed neural network",
      "Soil–structure interaction"
    ],
    "doi": "10.1007/s11440-023-02179-7",
    "link": "https://doi.org/10.1007/s11440-023-02179-7",
    "weblink": "https://link.springer.com/article/10.1007/s11440-023-02179-7",
    "APA": "Ouyang, W., Li, G., Chen, L., & Liu, S.-W. (2024). Machine learning-based soil–structure interaction analysis of laterally loaded piles through physics-informed neural networks. Acta Geotechnica, 19, 1635-1657.",
    "cv": "Ouyang, W., Li, G., Chen, L., & Liu, S.-W.* (2024). Machine learning-based soil–structure interaction analysis of laterally loaded piles through physics-informed neural networks. Acta Geotechnica, 19, 1635-1657.",
    "publication-date": "2024-07"
  },
  {
    "id": "J.67",
    "year": "2024",
    "title": "Neural networks-based spring element for second-order analysis of pile-supported structures with nonlinear soil- structure interaction",
    "publisher": "Elsevier Ltd.",
    "volume": "310",
    "pages": "118093",
    "authors": [
      "Weihang Ouyang",
      "Liang Chen",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Engineering Structures",
    "abstract": "This paper proposes a novel structural analysis approach, the neural networks-based spring element (NNSE) method, to synergize machine learning (ML) techniques with the line finite element method (LFEM) for the second-order analysis method of pile-supported structures. Traditional LFEM, widely used in upper structure design, showcases limitations in efficiently modeling complex Soil-Structure Interaction (SSI) along piles since it requires dense element mesh for accuracy. Conversely, ML offers a mesh-free alternative for analyzing single piles but struggles in simulating pile-supported structures as the training sample collection for large-scale problems might be unbearable. This paper addresses these challenges by proposing a new analysis framework to utilize the neural network (NN) model, which only describes structural responses of single piles, for the simulation of entire pile-supported structures. In the proposed method, the NN model is not directly used for structural analysis but employed to formulate a new spring element named the NNSE to model single piles in pile-supported structures. This NNSE can be seamlessly implemented within the existing LFEM framework to analyze pile-supported structures, eliminating the dense mesh requirement for single piles and thereby significantly improving the computational efficiency. Extensive examples are provided to verify the effectiveness of the proposed method, indicating its potential in promoting the second-order analysis method to the design of pile-supported structures.",
    "keywords": [
      "Neural networks",
      "Line finite element method",
      "Second-order analysis method",
      "Pile-supported structures",
      "Soil-structure interaction"
    ],
    "doi": "10.1016/j.engstruct.2024.118093",
    "link": "https://doi.org/10.1016/j.engstruct.2024.118093",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0141029624006552",
    "APA": "Ouyang, W., Chen, L., & Liu, S.-W. (2024). Neural networks-based spring element for second-order analysis of pile-supported structures with nonlinear soil- structure interaction. Engineering Structures, 310, 118093.",
    "cv": "Ouyang, W., Chen, L., & Liu, S.-W*. (2024). Neural networks-based spring element for second-order analysis of pile-supported structures with nonlinear soil- structure interaction. Engineering Structures, 310, 118093.",
    "publication-date": "2024-07"
  },
  {
    "id": "J.68",
    "year": "2024",
    "title": "Neural networks-based line element method for large deflection frame analysis",
    "publisher": "Elsevier Ltd.",
    "volume": "300",
    "pages": "107425",
    "authors": [
      "Weihang Ouyang",
      "Liang Chen",
      "An-Rui Liang",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Computers and Structures",
    "abstract": "The line finite element method (LFEM) is the predominant simulation method in structural design due to its robustness in large-scale structural analysis. However, it sometimes suffers from the tedious computational process due to its fine-mesh requirement to ensure accuracy. The machine learning (ML) technique provides an efficient mesh-free alternative but necessitating tremendous training datasets for modeling large-scale structural systems. In this paper, a novel numerical framework, named the neural networks-based line element (NNLE) method, synergizing the unique advantages of the finite element method and ML technique, is proposed and presented within the context of large deflection frame analysis. The neural networks (NN) model is only trained for modeling single components, thereby significantly diminishing the model scale and the required training dataset. Then, the NN model is used to formulate a new NNLE and implemented within the existing LFEM framework to simulate the entire structural system. Extensive examples are performed to demonstrate the accuracy, efficiency, compatibility, and flexibility of the proposed NNLE method compared with the conventional LFEM and ML techniques. It is convinced that the proposed NNLE method will offer new insights into the combination of the traditional finite element method and the emerging ML approach.",
    "keywords": [
      "Structural analysis",
      "Neural networks",
      "Line finite element method",
      "Large deflection frame analysis"
    ],
    "doi": "10.1016/j.compstruc.2024.107425",
    "link": "https://doi.org/10.1016/j.compstruc.2024.107425",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0045794924001548",
    "APA": "Ouyang, W., Chen, L., Liang, A.-R., & Liu, S.-W. (2024). Neural networks-based line element method for large deflection frame analysis. Computers and Structures, 300, 107425.",
    "cv": "Ouyang, W., Chen, L., Liang, A.-R., & Liu, S.-W*. (2024). Neural networks-based line element method for large deflection frame analysis. Computers and Structures, 300, 107425.",
    "publication-date": "2024-08"
  },
  {
    "id": "J.69",
    "year": "2024",
    "title": "Efficient numerical implementation of limit equilibrium method for stability analysis of unsaturated soil slopes using Gaussian integral",
    "publisher": "Springer-Verlag GmbH Germany, part of Springer Nature",
    "volume": "19",
    "pages": "5933-5945",
    "authors": [
      "Weihang Ouyang",
      "Siwei Liu",
      "Kai Liu",
      "Jianhua Yin"
    ],
    "corresponding author": "Kai Liu",
    "journal": "Acta Geotechnica",
    "abstract": "Unsaturated soil is widely distributed around the world but less considered in design due to the absence of a convenient analysis method in practice. The Morgenstern–Price (MP) method incorporating the extended Mohr–Coulomb shear strength equation provides a reliable approach to evaluate slope stability in such conditions. However, this method is time-consuming due to the need for a tedious trial-and-error process in determining the scaling factor, which involves complex iterations during each trial. Furthermore, since the relatively complicated nature of unsaturated soil, a dense slice division is necessary to obtain reliable results, making the analysis even more cumbersome. In this paper, an improved MP method for unsaturated soil slope stability analysis is presented, which eliminates the need for a dense slice mesh by employing only a few strategically placed Gauss points along the slip surface. Moreover, the trial-and-error process for determining the scaling factor with the corresponding complex iterations is replaced by an efficient search algorithm with a more concise iteration process, resulting in a more convenient implementation of the proposed method. Extensive examples are provided to validate the effectiveness of the proposed improved MP method, indicating its potential as an accurate and efficient analysis method for unsaturated soil slopes in practical application and relative study involving repetitive analyses.",
    "keywords": [
      "Gaussian integral",
      "Morgenstern–Price method",
      "Numerical implementation",
      "Slope stability analysis",
      "Unsaturated soil slopes"
    ],
    "doi": "10.1007/s11440-024-02268-1",
    "link": "https://doi.org/10.1007/s11440-024-02268-1",
    "weblink": "https://link.springer.com/article/10.1007/s11440-024-02268-1",
    "APA": "Ouyang, W., Liu, S., Liu, K., & Yin, J. (2024). Efficient numerical implementation of limit equilibrium method for stability analysis of unsaturated soil slopes using Gaussian integral. Acta Geotechnica, 19, 5933-5945.",
    "cv": "Ouyang, W., Liu, S., Liu, K.*, & Yin, J. (2024). Efficient numerical implementation of limit equilibrium method for stability analysis of unsaturated soil slopes using Gaussian integral. Acta Geotechnica, 19, 5933-5945.",
    "publication-date": "2024-09"
  },
  {
    "id": "J.70",
    "year": "2024",
    "title": "Line finite element method for geometrically nonlinear analysis of functionally graded members accounting for twisting effects",
    "publisher": "Elsevier Ltd.",
    "volume": "343",
    "pages": "118268",
    "authors": [
      "Guanhua Li",
      "Zi-Zhang Gu",
      "Hao-Yi Zhang",
      "Weihang Ouyang",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Composite Structures",
    "abstract": "Functionally graded materials with spatially varying properties have gained widespread use in various engineering disciplines due to their exceptional mechanical characteristics. Nevertheless, these materials can lead to non-symmetric properties of cross-sections and an offset between centroid and shear center of functionally graded (FG) members, thereby significantly affecting the mechanical behavior. This phenomenon, known as twisting effects, poses a substantial challenge for the geometrically nonlinear analysis of FG members, as existing methods rely on traditional line elements that assume the centroid and shear center of the section coincide. Thus, this paper proposes a new framework for geometrically nonlinear analysis of FG members, incorporating twisting effects through a novel Timoshenko line element. An efficient finite-element-based approach that employs the nonhomogeneous plane triangle (NPT) element for calculating the cross-sectional properties of arbitrary FG cross-sections is presented. These cross-sectional properties are then utilized within the advanced line-element formulation to perform geometrically nonlinear analysis of FG structures considering twisting effects. The accuracy of the proposed method is validated through three examples, followed by several case studies to examine the impact of twisting effects on FG members. Furthermore, the proposed cross-section analysis method is integrated into a new structural analysis software MSASect2 to facilitate its application.",
    "keywords": [
      "Functionally graded members",
      "Geometrically nonlinear",
      "Cross-sectional properties",
      "Twisting effects",
      "Line finite element method"
    ],
    "doi": "10.1016/j.compstruct.2024.118268",
    "link": "https://doi.org/10.1016/j.compstruct.2024.118268",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0263822324003969",
    "APA": "Li, G., Gu, Z.-Z., Zhang, H.-Y., Ouyang, W., & Liu, S.-W. (2024). Line finite element method for geometrically nonlinear analysis of functionally graded members accounting for twisting effects. Composite Structures, 343, 118268.",
    "cv": "Li, G., Gu, Z.-Z., Zhang, H.-Y., Ouyang, W., & Liu, S.-W.* (2024). Line finite element method for geometrically nonlinear analysis of functionally graded members accounting for twisting effects. Composite Structures, 343, 118268.",
    "publication-date": "2024-09"
  },
  {
    "id": "J.71",
    "year": "2024",
    "title": "Behavior of wire arc additively manufactured 316L austenitic stainless steel single shear bolted connections",
    "publisher": "Elsevier Ltd.",
    "volume": "202",
    "pages": "112075",
    "authors": [
      "Wenkang Zuo",
      "Man-Tai Chen",
      "Ou Zhao",
      "Andi Su",
      "Si-Wei Liu",
      "Fangda Xu",
      "Yuner Huang",
      "Bin Cheng"
    ],
    "corresponding author": "Man-Tai Chen",
    "journal": "Thin-Walled Structures",
    "abstract": "This paper aims to investigate the behavior of single shear bolted connections made of wire arc additively manufactured 316L austenitic stainless steel. A set of 44 wire arc additive manufacturing (WAAM) 316L austenitic stainless steel single shear bolted connections were included with consideration of various bolt positions, surface conditions and loading orientations respective to the printing layer direction. The geometric dimensions of the WAAM austenitic stainless steel plates were measured with the assistance of non-contact 3D laser scanning prior to tensile testing. Monotonic tensile tests were carried out to investigate the load-deformation responses, failure patterns and resistances determined by both the deformation and strength criteria of the single shear bolted connections. The effects of geometric and printing parameters on the single shear bolted connections were analyzed. Due to the absence of codified design provisions for WAAM austenitic stainless steel bolted connections, the suitability of the existing design rules originally developed for traditionally manufactured carbon steel and stainless steel bolted connections was examined. Design resistances calculated by the Eurocode 3 (prEN 1993-1-8 and prEN 1993-1-4), the American Specification (ANSI/AISC 370-21) as well as the prevalent design recommendations proposed in existing literature were compared with the obtained experimental results. It is shown that the abovementioned design methods offer conservative predictions for the resistances of WAAM 316L austenitic stainless steel single shear bolted connections. Further study is needed to improve the accuracy of design resistance predictions.",
    "keywords": [
      "Wire arc additive manufacturing (WAAM)",
      "Metallic 3D printing",
      "Single shear",
      "Bolted connections",
      "Austenitic stainless steel"
    ],
    "doi": "10.1016/j.tws.2024.112075",
    "link": "https://doi.org/10.1016/j.tws.2024.112075",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0263823124005184",
    "APA": "Zuo, W., Chen, M.-T., Zhao, O., Su, A., Liu, S.-W., Xu, F., Huang, Y., & Cheng, B. (2024). Behavior of wire arc additively manufactured 316L austenitic stainless steel single shear bolted connections. Thin-Walled Structures, 202, 112075.",
    "cv": "Zuo, W., Chen, M.-T.*, Zhao, O., Su, A., Liu, S.-W., Xu, F., Huang, Y., & Cheng, B. (2024). Behavior of wire arc additively manufactured 316L austenitic stainless steel single shear bolted connections. Thin-Walled Structures, 202, 112075.",
    "publication-date": "2024-09"
  },
  {
    "id": "J.72",
    "year": "2024",
    "title": "Finite-element-based cross-section analysis method for functionally graded sandwich members with arbitrary shapes and gradients",
    "publisher": "SAGE Publications",
    "volume": "0",
    "pages": "1–27",
    "authors": [
      "Guanhua Li",
      "Zi-Zhang Gu",
      "Weihang Ouyang",
      "Si-Wei Liu",
      "A. H. A. Abdelrahman"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Journal of Sandwich Structures & Materials",
    "abstract": "Recent advancements in manufacturing technologies have facilitated the efficient and cost-effective production of functionally graded (FG) sandwich members, offering exceptional structural performances. However, designing these members is challenging due to the difficulties in accurately determining their cross-sectional properties, especially within routine designs that rely on beam-column elements. To this end, this paper introduces a robust finite-element-based cross-section analysis method for FG sandwich sections considering arbitrary shapes and material gradients. A novel nonhomogeneous plane triangle (NPT) element is formulated to enhance the computational efficiency of the developed cross-section analysis approach. A new structural analysis software with a graphic user interface, namely MSASect2, is developed based on the proposed cross-section analysis approach for its convenient implementation in practice. Four examples are displayed to verify the correctness of the present study and MSASect2, indicating their potential to promote the broader application of FG sandwich sections.",
    "keywords": [
      "Functionally graded",
      "finite-element method",
      "cross-section analysis",
      "numerical method",
      "MSASect2"
    ],
    "doi": "10.1177/10996362241275557",
    "link": "https://doi.org/10.1177/10996362241275557",
    "weblink": "https://journals.sagepub.com/doi/10.1177/10996362241275557",
    "APA": "Li, G., Gu, Z.-Z., Ouyang, W., Liu, S.-W., & Abdelrahman, A. H. A. (2024). Finite-element-based cross-section analysis method for functionally graded sandwich members with arbitrary shapes and gradients. Journal of Sandwich Structures & Materials, 0(0), 1–27.",
    "cv": "Li, G., Gu, Z.-Z., Ouyang, W., Liu, S.-W.*, & Abdelrahman, A. H. A. (2024). Finite-element-based cross-section analysis method for functionally graded sandwich members with arbitrary shapes and gradients. Journal of Sandwich Structures & Materials, 0(0), 1–27.",
    "publication-date": "2024-10"
  },
  {
    "id": "J.73",
    "year": "2024",
    "title": "Experimental investigation on double-lap shear behavior of 3D printed austenitic stainless steel bolted connections",
    "publisher": "Elsevier Ltd.",
    "volume": "317",
    "pages": "118501",
    "authors": [
      "Wenkang Zuo",
      "Man-Tai Chen",
      "Si-Wei Liu",
      "Xiang Yun",
      "Ou Zhao",
      "Yuner Huang",
      "Bin Cheng"
    ],
    "corresponding author": "Man-Tai Chen",
    "journal": "Engineering Structures",
    "abstract": "This paper presents a comprehensive experimental investigation into the double-lap shear behavior of 3D printed austenitic stainless steel bolted connections, manufactured using wire arc additive manufacturing (WAAM) and ER316L feedstock wire. A total of 43 double shear bolted connections were tested, considering variations in end and edge distances, surface conditions (milled and as-built) and test orientations. Details regarding the manufacturing process, geometric measurements using 3D laser scanning, and tensile connection tests are provided. The key test results, encompassing failure modes, load-deformation curves, and resistances with and without consideration of bolt hole deformation, are reported and discussed. The test results were compared with resistances predicted by existing design rules documented in current American Specifications (AISC 360–22, AISC 370–21 and ASCE 8–22) and the Active Shear Plane-based Method from relevant literature, originally calibrated for conventionally fabricated steel lap-shear connections, in order to assess their applicability for WAAM austenitic stainless steel connections. The comparison results indicated that the resistance predictions by the aforementioned American Specifications are generally conservative for WAAM 316 L austenitic stainless steel double shear bolted connections when considering bolt hole deformation, with AISC 360–22 being the most accurate. When bolt hole deformation is not a design concern, the Active Shear Plane-based Method was shown to provide the most accurate resistance predictions.",
    "keywords": [
      "Austenitic stainless steel",
      "Bolted connections",
      "Double-lap shear connections",
      "Metallic 3D printing",
      "Wire arc additive manufacturing (WAAM)"
    ],
    "doi": "10.1016/j.engstruct.2024.118501",
    "link": "https://doi.org/10.1016/j.engstruct.2024.118501",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0141029624010630",
    "APA": "Zuo, W., Chen, M.-T., Liu, S.-W., Yun, X., Zhao, O., Huang, Y., & Cheng, B. (2024). Experimental investigation on double-lap shear behavior of 3D printed austenitic stainless steel bolted connections. Engineering Structures, 317, 118501.",
    "cv": "Zuo, W., Chen, M.-T.*, Liu, S.-W., Yun, X., Zhao, O., Huang, Y., & Cheng, B. (2024). Experimental investigation on double-lap shear behavior of 3D printed austenitic stainless steel bolted connections. Engineering Structures, 317, 118501.",
    "publication-date": "2024-10"
  },
  {
    "id": "J.74",
    "year": "2024",
    "title": "Laminated insulated glass units under blast loads: Experimental and numerical study",
    "publisher": "Elsevier Ltd.",
    "volume": "316",
    "pages": "118507",
    "authors": [
      "Xiao-Hong Guo",
      "Yao-Peng Liu",
      "Sun-Nung Chan",
      "Tsz-Kin Au Yeung",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Yao-Peng Liu",
    "journal": "Engineering Structures",
    "abstract": "Laminated insulating glass units (IGUs), commonly used in modern buildings, are prone to shattering from explosive loads, causing significant secondary damage and loss. Existing research on IGUs is constrained by a lack of experimental validation and comprehensive numerical analyses, as large-scale explosion tests are rarely reported due to safety and cost concerns. Furthermore, previous modeling efforts often oversimplify critical factors such as the supporting structure, component interactions, strain rate effects, hourglass energy, and failure criteria, leading to an inadequate representation of glass behavior under explosive loads. This paper addresses these gaps by conducting large-scale explosive test on glass system and utilizing sophisticated nonlinear dynamic analysis with LS-DYNA for simulation. The research considers the influence of the support system and incorporates detailed considerations of component interactions, constitutive relationships, and strain rate effects in the numerical simulations. The results confirm that the proposed model successfully replicates the crack patterns and damage observed in experimental test. Also, it accurately predicts the trajectory, quantity, and size distribution of glass fragments. The proposed modeling approach offers a more informed assessment of damage and improves the evaluation of glass safety in practical applications.",
    "keywords": [
      "Laminated insulated glass units",
      "Blast load",
      "Numerical simulation",
      "Crack pattern",
      "Glass fragment"
    ],
    "doi": "10.1016/j.engstruct.2024.118507",
    "link": "https://doi.org/10.1016/j.engstruct.2024.118507",
    "weblink": "https://www.sciencedirect.com/science/article/pii/S0141029624010691",
    "APA": "Guo, X.-H., Liu, Y.-P., Chan, S.-N., Au Yeung, T.-K., Liu, S.-W., & Chan, S.-L. (2024). Laminated insulated glass units under blast loads: Experimental and numerical study. Engineering Structures, 316, 118507.",
    "cv": "Guo, X.-H., Liu, Y.-P.*, Chan, S.-N., Au Yeung, T.-K., Liu, S.-W., & Chan, S.-L. (2024). Laminated insulated glass units under blast loads: Experimental and numerical study. Engineering Structures, 316, 118507.",
    "publication-date": "2024-10"
  },
  {
    "id": "J.75",
    "year": "2024",
    "title": "Structural performance of wire arc additively manufactured duplex stainless steel single-lap shear bolted connections",
    "publisher": "Elsevier Ltd.",
    "volume": "319",
    "pages": "118706",
    "authors": [
      "Wenkang Zuo",
      "Man-Tai Chen",
      "Ou Zhao",
      "Andi Su",
      "Si-Wei Liu",
      "Xiang Yun",
      "Fangda Xu"
    ],
    "corresponding author": "Man-Tai Chen",
    "journal": "Engineering Structures",
    "abstract": "This paper investigates the structural performance of wire arc additively manufactured ER2209 duplex stainless steel (DSS) single-lap shear bolted connections. A comprehensive test campaign was conducted, involving a total of 43 WAAM ER2209 DSS single shear bolted connections with variations in bolt hole positions, surface conditions (i.e. machined or unmachined) and loading orientations relative to the printing direction. The geometric dimensions of the test specimens were meticulously measured using a non-contact 3D laser scanner prior to tensile tests. Detailed analyses on the observed failure patterns, load-displacement curves and resistances considering both deformation and strength criteria are presented. The effects of bolt hole position, surface condition and loading orientation of the WAAM DSS plate on the structural behavior of the single shear bolted connections are analyzed. Given the absence of specific design rules for WAAM DSS bolted connections, the applicability of existing design rules originally developed for conventionally manufactured carbon/stainless steel bolted connections is examined. The experimentally obtained resistances are compared with predictive resistances derived from the Eurocode 3 (prEN 1993–1-8 and prEN 1993–1-4), the American Specification (ANSI/AISC 370–21), and recent design recommendations proposed in the existing literature. The findings underscore that existing design rules tend to provide rather conservative resistance predictions for WAAM ER2209 DSS single shear bolted connections, particularly when employing the deformation criterion, while the design equations proposed in existing literature yield general conservative and the most accurate resistance predictions in strength criterion.",
    "keywords": [
      "Bolted connections",
      "Duplex stainless steel",
      "Metallic 3D printing",
      "Single shear",
      "Wire arc additive manufacturing (WAAM)"
    ],
    "doi": "10.1016/j.engstruct.2024.118706",
    "link": "https://doi.org/10.1016/j.engstruct.2024.118706",
    "weblink": "https://www.sciencedirect.com/science/article/pii/S0141029624012689",
    "APA": "Zuo, W., Chen, M.-T., Zhao, O., Su, A., Liu, S.-W., Yun, X., & Xu, F. (2024). Structural performance of wire arc additively manufactured duplex stainless steel single-lap shear bolted connections. Engineering Structures, 319, 118706.",
    "cv": "Zuo, W., Chen, M.-T.*, Zhao, O., Su, A., Liu, S.-W., Yun, X., & Xu, F. (2024). Structural performance of wire arc additively manufactured duplex stainless steel single-lap shear bolted connections. Engineering Structures, 319, 118706.",
    "publication-date": "2024-11"
  },
  {
    "id": "J.76",
    "year": "2025",
    "title": "Implementation of physics informed neural networks for geometrically nonlinear analysis of non-prismatic members",
    "publisher": "Institution of Structural Engineers. Published by Elsevier Ltd.",
    "volume": "71",
    "pages": "108149",
    "authors": [
      "Liang Chen",
      "Hao-Yi Zhang",
      "Weihang Ouyang",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Structures",
    "abstract": "Advancements in manufacturing techniques, such as wire and arc additive manufacturing, have enabled the efficient production of non-prismatic members. These members, characterized by varying cross-sectional geometries, offer superior structural efficiency. However, they present significant challenges for geometrically nonlinear analysis, a persistent problem for decades, as conventional methods often result in oversimplified equations or time-consuming finite-element-based approaches. This paper introduces a novel method leveraging machine-learning techniques, specifically Physics-Informed Neural Networks (PINNs), to tackle this analysis problem. The new PINNs method employs a self-supervised learning process, integrating physical laws into the machine learning model to accurately determine equilibrium conditions under varied loads and boundary conditions. The paper provides a detailed explanation of the governing equations, the PINNs framework, and the training procedure. The accuracy and effectiveness of the proposed approach are validated through a series of validation examples, demonstrating the potential of PINNs in handling geometrically nonlinear analysis problems of non-prismatic members. This research provides a new direction in solving challenging structural analysis problems, potentially promoting the application of emerging machine learning techniques in the field.",
    "keywords": [
      "Non-prismatic Members",
      "Geometrically Nonlinear Analysis",
      "Physics-Informed Neural Networks (PINNs)",
      "Machine Learning",
      "Structural Analysis"
    ],
    "doi": "10.1016/j.istruc.2024.108149",
    "link": "https://doi.org/10.1016/j.istruc.2024.108149",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S2352012424023038",
    "APA": "Chen, L., Zhang, H.-Y., Ouyang, W., & Liu, S.-W. (2025). Implementation of physics informed neural networks for geometrically nonlinear analysis of non-prismatic members. Structures, 71, 108149.",
    "cv": "Chen, L., Zhang, H.-Y., Ouyang, W., & Liu, S.-W.* (2025). Implementation of physics informed neural networks for geometrically nonlinear analysis of non-prismatic members. Structures, 71, 108149.",
    "publication-date": "2025-01"
  },
  {
    "id": "J.77",
    "year": "2025",
    "title": "Global buckling analysis of IFC-protected steel members with irregular sections under fire",
    "publisher": "Elsevier Ltd.",
    "volume": "224",
    "pages": "109158",
    "authors": [
      "Guanhua Li",
      "Zi-Zhang Gu",
      "Erfeng Du",
      "Si-Wei Liu",
      "Yao-Peng Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "Intumescent fire coating (IFC) is currently the major passive protection of steel structures under fire. However, the buckling behavior of IFC-protected steel members with irregular sections under fire has not been systematically quantified in existing studies. The high cost of fire tests and the cumbersome nature of coupled thermal-stress analysis hinder extensive research on these members. This study proposes an improved algorithm to analyze the global buckling behavior of IFC-protected steel members with irregular sections under fire. The temperature field is calculated using a refined finite-element-based heat transfer analysis method that accounts for the equivalent thermal conductivity of IFC. Based on the temperature field, a cross-section analysis algorithm is proposed to determine the cross-sectional properties of the members, incorporating warping and Wagner effects due to the thermal gradients. The proposed thermal deterioration triangle element can reduce the error in calculating the cross-sectional properties by up to 3.98 % compared to traditional method while achieving higher efficiency. Parametric studies, comprising a total of 3168 analyses, reveal that fire exposure time, dry film thickness and section factor are the primary influencing factors. By summarizing the fire exposure times corresponding to 20 % and 80 % reductions in buckling capacity, an approximate evaluation equation is provided. Moreover, the proposed approach is integrated into a new software MSASect2 to offer a user-friendly tool.",
    "keywords": [
      "Fire",
      "Steel structure",
      "Global buckling",
      "Intumescent fire coating",
      "Finite-element method",
      "Cross-section analysis"
    ],
    "doi": "10.1016/j.jcsr.2024.109158",
    "link": "https://doi.org/10.1016/j.jcsr.2024.109158",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0143974X24007089",
    "APA": "Li, G., Gu, Z.-Z., Du, E., Liu, S.-W., Liu, Y.-P., & Chan, S.-L. (2025). Global buckling analysis of IFC-protected steel members with irregular sections under fire. Journal of Constructional Steel Research, 224, 109158.",
    "cv": "Li, G., Gu, Z.-Z., Du, E., Liu, S.-W.*, Liu, Y.-P., & Chan, S.-L. (2025). Global buckling analysis of IFC-protected steel members with irregular sections under fire. Journal of Constructional Steel Research, 224, 109158.",
    "publication-date": "2025-01"
  },
  {
    "id": "J.78",
    "year": "2025",
    "title": "Advanced line-finite-element for lateral-torsional buckling of beams with torsion and warping restraints",
    "publisher": "Elsevier Ltd.",
    "volume": "224",
    "pages": "109103",
    "authors": [
      "Hao-Yi Zhang",
      "Goman W.M. Ho",
      "Si-Wei Liu",
      "Liang Chen",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Liang Chen",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "Steel beams are susceptible to lateral-torsional buckling (LTB) failure when subjected to bending. Considering the effect of semi-rigid connections, the partial end restraints in torsion and warping can significantly influence the buckling behavior of members. However, these restraints are not properly simulated in the traditional line-finite-element method (LFEM), which may lead to an error in the estimation of member buckling capacity. To fill this gap, this research introduces an improved end-spring model into the formulation of an advanced co-rotational (CR)-LFEM, where the partial restraints in axial, bending, torsion, and warping degree of freedom (DOF) can be considered. A parametric study on the LTB behavior of steel beams is conducted using the modified CR-LFEM, where a series of elastic buckling analyses are conducted. The results show that the stiffness of partial torsion and warping restraints have a significant influence on the LTB capacity. The influence of various cross-section shapes and member slenderness ratios on the LTB behavior is also discussed. Finally, design recommendations are provided for classifying connection stiffness in torsion and warping DOF, offering guidelines for practitioners. In addition, the improved CR-LFEM with end-springs proposed in this study has been implemented into the educational software MSASect2.",
    "keywords": [
      "Partial restraints",
      "Lateral-torsional buckling",
      "Warping",
      "Line-finite-element",
      "Steel structures"
    ],
    "doi": "10.1016/j.jcsr.2024.109103",
    "link": "https://doi.org/10.1016/j.jcsr.2024.109103",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0143974X24006539",
    "APA": "Zhang, H.-Y., Ho, G. W. M., Liu, S.-W., Chen, L., & Chan, S.-L. (2025). Advanced line-finite-element for lateral-torsional buckling of beams with torsion and warping restraints. Journal of Constructional Steel Research, 224, 109103.",
    "cv": "Zhang, H.-Y., Ho, G. W. M., Liu, S.-W., Chen, L.*, & Chan, S.-L. (2025). Advanced line-finite-element for lateral-torsional buckling of beams with torsion and warping restraints. Journal of Constructional Steel Research, 224, 109103.",
    "publication-date": "2025-01"
  },
  {
    "id": "J.79",
    "year": "2025",
    "title": "Upheaval buckling analysis of subsea pipelines with local corrosion damage based on pipeline element",
    "publisher": "Elsevier Ltd.",
    "volume": "326",
    "pages": "120801",
    "authors": [
      "Wei Huang",
      "Langwei Zhong",
      "Siwei Liu",
      "Rui Bai"
    ],
    "corresponding author": "Wei Huang",
    "journal": "Ocean Engineering",
    "abstract": "In the complex subsea environment, pipelines are highly susceptible to local corrosion damage caused by various factors, which significantly increases the risk of instability. Inspired by the fiber model, this study introduces local corrosion into the pipeline element and proposes a new pipeline element model that can precisely control the location and degree of corrosion. The effects of local corrosion damage on the bearing capacity and buckling behavior of pipelines are quantitatively investigated. Specifically, the study compares the performance of intact pipelines, generally corroded pipelines, and locally corroded pipelines, demonstrating the significant adverse impact of localized corrosion on the bearing capacity of the pipeline. Additionally, a sensitivity analysis of the pipeline’s failure to corrosion location and degree indicates that corrosion within the initial defect, particularly in the mid-span region, dramatically reduces the bearing capacity, while higher corrosion rates or greater corrosion depth substantially increase the likelihood of pipeline failure.",
    "keywords": [
      "Local corrosion",
      "Pipeline element",
      "Upheaval buckling",
      "Corrosion damage"
    ],
    "doi": "10.1016/j.oceaneng.2025.120801",
    "link": "https://doi.org/10.1016/j.oceaneng.2025.120801",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0029801825005153",
    "APA": "Huang, W., Zhong, L., Liu, S., & Bai, R. (2025). Upheaval buckling analysis of subsea pipelines with local corrosion damage based on pipeline element. Ocean Engineering, 326, 120801.",
    "cv": "Huang, W.*, Zhong, L., Liu, S., & Bai, R. (2025). Upheaval buckling analysis of subsea pipelines with local corrosion damage based on pipeline element. Ocean Engineering, 326, 120801.",
    "publication-date": "2025-05"
  },
  {
    "id": "J.80",
    "year": "2025",
    "title": "Improved shell-finite strip method for inelastic buckling analysis of thin-walled steel members with residual stresses",
    "publisher": "Elsevier Ltd.",
    "volume": "211",
    "pages": "113064",
    "authors": [
      "Wen-Long Gao",
      "Liang Chen",
      "Ronald D. Ziemian",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Thin-Walled Structures",
    "abstract": "This study investigates the inelastic buckling behavior of thin-walled steel members, with a specific focus on cold-formed steel members considering residual stresses. This behavior is essential for determining load-bearing capacities, yet it is often influenced by complex factors such as local-global interactive buckling, material yielding, and residual stresses. Current methods, including the Direct Strength Method (DSM), predominantly rely on the elastic Shell-Finite Strip Method (SFSM) and empirical formulations, which are primarily suited for regular cross-sections but less effective for those with complex geometries. Alternatively, the advanced Shell Finite Element Method (SFEM) is highly adaptable to various cross-sections and delivers accurate analyses; however, its significant computational cost limits routine applications. This research introduces an improved SFSM that integrates material inelasticity and residual stresses, enabling efficient and accurate buckling analysis for thin-walled steel members with arbitrary cross-sections. Validation using five examples demonstrates the accuracy and computational efficiency of proposed method, showing strong agreement with experimental data and SFEM results. The developed algorithms are implemented in the free educational software platform MSASect2.",
    "keywords": [
      "Finite strip method",
      "Inelastic buckling",
      "Buckling analysis",
      "Thin-walled steel members",
      "Residual Stresses",
      "Arbitrary Cross-Sections"
    ],
    "doi": "10.1016/j.tws.2025.113064",
    "link": "https://doi.org/10.1016/j.tws.2025.113064",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0263823125001582",
    "APA": "Gao, W.-L., Chen, L., Ziemian, R. D., & Liu, S.-W. (2025). Improved shell-finite strip method for inelastic buckling analysis of thin-walled steel members with residual stresses. Thin-Walled Structures, 211, 113064.",
    "cv": "Gao, W.-L., Chen, L., Ziemian, R. D., & Liu, S.-W.* (2025). Improved shell-finite strip method for inelastic buckling analysis of thin-walled steel members with residual stresses. Thin-Walled Structures, 211, 113064.",
    "publication-date": "2025-06"
  },
  {
    "id": "J.81",
    "year": "2025",
    "title": "Nonlinear analysis of glass panes under complex lateral pressures through physics informed neural networks",
    "publisher": "Elsevier Ltd.",
    "volume": "334",
    "pages": "120262",
    "authors": [
      "Wenjing Ouyang",
      "Weihang Ouyang",
      "Xiaoge Tian",
      "Si-Wei Liu",
      "Jiaji Wang",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Engineering Structures",
    "abstract": "Accurate prediction of large deflections in glass panes is crucial for economical and safe structural design, particularly under complex loading conditions. The Föppl-von Karman (FvK) equations are widely used to model their nonlinear behavior but pose significant computational challenges. Recent advancements in machine learning, especially Physics-Informed Neural Networks (PINN), offer a promising alternative for solving such complex partial differential equations (PDEs). However, standard PINN struggles to handle the computational demands of the FvK equations due to high-order derivatives and intricate boundary conditions. To address these limitations, this study introduces a novel PINN framework tailored for the nonlinear analysis of glass panes. The proposed method integrates a reduced-order technique and imposed hard constraints both using auxiliary functions while mitigating training instabilities caused by high-order terms in the PDEs and potential conflicts in the loss function. An adaptive loss weighting strategy further enhances training stability and ensures robust convergence. Extensive validation examples and case studies demonstrate the improved accuracy and reliability of the proposed PINN approach. As a practical application, a PINN-based surrogate model is developed for real-time simulation of glass pane behavior under catastrophic weather conditions, showcasing the method’s computational efficiency and potential for in-time prediction during natural hazards. This study highlights a significant advancement in applying PINNs as a reliable and efficient solution for addressing the complexities of nonlinear glass pane analysis.",
    "keywords": [
      "Physics-informed Neural Networks (PINN)",
      "Glass pane",
      "Hard constraints",
      "Nonlinear analysis",
      "Von Kármán plate theory"
    ],
    "doi": "10.1016/j.engstruct.2025.120262",
    "link": "https://doi.org/10.1016/j.engstruct.2025.120262",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0141029625006534",
    "APA": "Ouyang, W., Ouyang, W., Tian, X., Liu, S.-W., Wang, J., & Chan, S.-L. (2025). Nonlinear analysis of glass panes under complex lateral pressures through physics informed neural networks. Engineering Structures, 334, 120262.",
    "cv": "Ouyang, W., Ouyang, W., Tian, X., Liu, S.-W.*, Wang, J., & Chan, S.-L. (2025). Nonlinear analysis of glass panes under complex lateral pressures through physics informed neural networks. Engineering Structures, 334, 120262.",
    "publication-date": "2025-07"
  },
  {
    "id": "J.82",
    "year": "2025",
    "title": "Geometrically nonlinear analysis of steel members under non-uniform fire considering twisting effects",
    "publisher": "Elsevier Ltd.",
    "volume": "231",
    "pages": "109596",
    "authors": [
      "Guanhua Li",
      "Zi-Zhang Gu",
      "Liang Chen",
      "Si-Wei Liu"
    ],
    "corresponding author": "Liang Chen",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "In current design practices, steel members exposed to fire are typically analyzed under the assumption of uniform temperature distribution across their cross-sections. However, under non-uniform fire exposure, thermal gradients can induce uneven degradation of material properties, significantly altering the mechanical behavior of these members. Such degradation may result in an offset between the centroid and shear center of the cross-section, necessitating consideration of the twisting effects, as requested by ANSI/AISC 360–22. Nevertheless, there is a lack of robust and efficient methods to capture the non-uniformly degraded cross-sectional properties induced by thermal gradients, and the resulting geometrically nonlinear behavior, accounting for twisting effects, remains insufficiently explored. In response, this study proposes a novel line finite element approach for the geometrically nonlinear analysis of steel members exposed to non-uniform fire. A cross-section analysis technique is also developed to calculate the non-uniformly degraded cross-sectional properties. The accuracy of the proposed method is demonstrated through multiple examples, with two case studies examining the impact of thermally induced twisting effects. Additionally, the proposed method has been incorporated into a novel structural analysis software, MSASect2, to enhance its applicability in structural fire safety design",
    "keywords": [
      "Steel structure",
      "Fire",
      "Thermal gradient",
      "Twisting effects",
      "Geometrically nonlinear analysis",
      "Cross-section analysis"
    ],
    "doi": "10.1016/j.jcsr.2025.109596",
    "link": "https://doi.org/10.1016/j.jcsr.2025.109596",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S0143974X25002743",
    "APA": "Li, G., Gu, Z.-Z., Chen, L., & Liu, S.-W. (2025). Geometrically nonlinear analysis of steel members under non-uniform fire considering twisting effects. Journal of Constructional Steel Research, 231, 109596.",
    "cv": "Li, G., Gu, Z.-Z., Chen, L.*, & Liu, S.-W. (2025). Geometrically nonlinear analysis of steel members under non-uniform fire considering twisting effects. Journal of Constructional Steel Research, 231, 109596.",
    "publication-date": "2025-08"
  },
  {
    "id": "J.83",
    "year": "2025",
    "title": "From classical models to neural operators: a study on mooring tension prediction for floating offshore wind turbine",
    "publisher": "The Hong Kong Institute of Steel Construction",
    "volume": "21",
    "pages": "357–366",
    "authors": [
      "Lang-Wei Zhong",
      "Yu-Ping Lan",
      "Xi-Wei Tang",
      "Wei Huang",
      "Jian-Wen He",
      "Si-Wei Liu"
    ],
    "corresponding author": "Wei Huang",
    "journal": "Advanced Steel Construction",
    "abstract": "Offshore wind technology has emerged as a promising solution for harnessing wind resources in both shallow and deep waters. For floating offshore wind turbines, mooring systems play a critical role in maintaining station-keeping functions. Effective monitoring of mooring loads is essential to ensure safe and cost-efficient operation and maintenance. However, direct measurement of dynamic mooring line tensions is often costly and impractical. To address this challenge, this paper focuses on predicting mooring tensions using accessible motion data from the floating platform. We propose the use of deep learning algorithms, including deep neural networks and deep operator networks, to predict the mooring tension of floating offshore wind turbines based on six-degree-of-freedom (6-DOF) platform motions from OpenFAST or OrcaFlex under extreme sea conditions as input. We compare the prediction accuracy and generalization performance of various models, with the Transformer model under a local attention mechanism (LA-Transformer) and the multi-input deep operator network with an attention mechanism (MIONet-ATT) standing out as the top performers. Specifically, LA-Transformer inherits the precise and efficient foundational architecture of Transformer while pruning timing-independent components, achieving an optimal balance between computational complexity and accuracy. It is a novel model with outstanding precision and a moderate parameter size. MIONet-ATT, designed based on the concept of operator networks, offers better interpretability and generalization. Additionally, it demonstrates promising potential in non-extreme sea state applications.",
    "keywords": [
      "Neural networks",
      "Deep operator networks",
      "Semi-submersible floating offshore wind turbine",
      "Mooring tension",
      "Transformer"
    ],
    "doi": "10.18057/IJASC.2025.21.4.8",
    "link": "https://doi.org/10.18057/IJASC.2025.21.4.8",
    "weblink": "https://www.ascjournal.com/index.php?option=com_content&view=article&id=738:vol21no4-8&catid=196:vol21no4&Itemid=538",
    "APA": "Zhong, L.-W., Lan, Y.-P., Tang, X.-W., Huang, W., He, J.-W., & Liu, S.-W. (2025). From classical models to neural operators: a study on mooring tension prediction for floating offshore wind turbine. Advanced Steel Construction, 21(4), 357–366.",
    "cv": "Zhong, L.-W., Lan, Y.-P., Tang, X.-W., Huang, W.*, He, J.-W., & Liu, S.-W. (2025). From classical models to neural operators: a study on mooring tension prediction for floating offshore wind turbine. Advanced Steel Construction, 21(4), 357–366.",
    "publication-date": "2025-08-07"
  },
  {
    "id": "J.84",
    "year": "2025",
    "title": "Experimental study on tensile and compressive properties of neosinocalamus affinis-based bamboo scrimber",
    "publisher": "Elsevier Ltd.",
    "volume": "492",
    "pages": "143059",
    "authors": [
      "Zi-Zhang Gu",
      "Guanhua Li",
      "Ming Zhang",
      "Daniel Ting-Wee Looi",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Construction and Building Materials",
    "abstract": "Engineered bamboo has emerged as a promising material for sustainable construction. However, its mechanical performance varies significantly depending on species and manufacturing processes. Among these, neosinocalamus affinis-based bamboo scrimber (NABS) shows strong potential as a structural material, but its mechanical properties remain insufficiently characterized. This study systematically investigates the mechanical behavior of NABS through tensile and compressive tests along the longitudinal, radial, tangential, and 45◦off-axis fiber orientations. Digital image correlation (DIC), video extensometer, and strain gauges are employed to capture the stress-strain responses. At the same time, macroscopic observations and scanning electron microscopy (SEM) are utilized to examine the fracture mechanisms. The experimental results reveal that NABS displays exceptional mechanical properties, particularly in the fiber-parallel orientation, achieving a tensile strength of 214.33 MPa, elastic modulus of 24.23 GPa, compressive strength of 110.50 MPa, and elastic modulus of 29.38 GPa. These properties demonstrate superior tensile performance, surpassing those of conventional timber and other engineered bamboo products of tensile performance two to three times, while maintaining competitive compressive performance. However, pronounced anisotropy leads to significantly reduced strength and stiffness perpendicular to fiber orientation. The extended Hankinson’s formula is applied to predict off-axis mechanical properties, achieving strength and elastic modulus prediction errors below 10 %. To support structural design, characteristic strength and modulus values are derived using nonparametric and parametric methods, respectively. A direction-specific stress-strain model is also developed to describe the anisotropic behavior of NABS. These findings enhance the fundamental understanding of NABS mechanics and provide guidelines for optimizing structural design parameters, promoting the adoption of engineered bamboo materials in sustainable infrastructure.",
    "keywords": [
      "Bamboo scrimber",
      "Neosinocalamus affinis",
      "Mechanical properties",
      "Stress-strain model",
      "Anisotropic behavior",
      "Failure mechanisms"
    ],
    "doi": "10.1016/j.conbuildmat.2025.143059",
    "link": "https://doi.org/10.1016/j.conbuildmat.2025.143059",
    "weblink": "https://www.sciencedirect.com/science/article/pii/S0950061825143059",
    "APA": "Gu, Z.-Z., Li, G., Zhang, M., Looi, D. T.-W., & Liu, S.-W. (2025). Experimental study on tensile and compressive properties of neosinocalamus affinis-based bamboo scrimber. Construction and Building Materials, 492, 143059.",
    "cv": "Gu, Z.-Z., Li, G., Zhang, M., Looi, D. T.-W., & Liu, S.-W.* (2025). Experimental study on tensile and compressive properties of neosinocalamus affinis-based bamboo scrimber. Construction and Building Materials, 492, 143059.",
    "publication-date": "2025-09"
  },
  {
    "id": "J.85",
    "year": "2025",
    "title": "Design and fabrication of Hong Kong’s first constructional 3D-printed metal pavilion ‘Weaving Love’",
    "publisher": "Springer Nature",
    "volume": "15",
    "pages": "32982",
    "authors": [
      "Derek Kwok-Leung SO",
      "Billy Chi-Pan WONG",
      "Tony Sai-Kwan SIU",
      "Ning XI",
      "Siu-Lai CHAN",
      "Si-Wei LIU"
    ],
    "corresponding author": "Si-Wei LIU",
    "journal": "Scientific Reports",
    "abstract": "‘Weaving Love’ is Hong Kong’s first outdoor pavilion constructed using the constructional 3D metal printing through Wire Arc Additive Manufacturing (WAAM) technology, making a transformative milestone in the application of this emerging technology for large-scale construction in the region. This paper documents the entire process—from the concept and design to fabrication and construction—of the “Weaving Love” pavilion, a constructional 3D-printed metal structure situated at the New Immigration Headquarters of Hong Kong. The project demonstrates the seamless integration of advanced WAAM technology, innovative parametric design, and collaborative efforts among government, industry, and academia. By leveraging these advanced technologies, the project team has created a structure that is not only visually stunning but also environmentally friendly and cost-effective—achievements that would have been unattainable using conventional construction methods. The project achieved significant reductions in construction time, cost, and material waste while pushing the boundaries of architectural design and structural engineering. The structure is one of the largest 3D-printed steel structures in the Hong Kong region, designed in accordance with established codes of practice, just like conventional steel structures. This pioneering project successfully utilized WAAM technology to bring the innovative design of an artistic expression to fruition, incorporating advanced structural analysis methods, optimization techniques, and supplementary physical tests. This paper presents summarized project data and methodological frameworks for implementing WAAM technology in construction applications, thereby contributing to the advancement of WAAM technology in construction industry.",
    "keywords": [
      "Wire arc additive manufacturing (WAAM)",
      "Stainless steel structures",
      "Topology optimization",
      "Parametric design",
      "Sustainable construction",
      "Robotic fabrication"
    ],
    "doi": "10.1038/s41598-025-17612-y",
    "link": "https://doi.org/10.1038/s41598-025-17612-y",
    "weblink": "https://www.nature.com/articles/s41598-025-17612-y",
    "APA": "SO, D. K.-L., WONG, B. C.-P., SIU, T. S.-K., XI, N., CHAN, S.-L., & LIU, S.-W. (2025). Design and fabrication of Hong Kong’s first constructional 3D-printed metal pavilion ‘Weaving Love’. Scientific Reports, 15, 32982.",
    "cv": "SO, D. K.-L., WONG, B. C.-P., SIU, T. S.-K., XI, N., CHAN, S.-L., & LIU, S.-W.* (2025). Design and fabrication of Hong Kong’s first constructional 3D-printed metal pavilion ‘Weaving Love’. Scientific Reports, 15, 32982.",
    "publication-date": "2025-09-26"
  },
  {
    "id": "J.86",
    "year": "2025",
    "title": "Improved finite-element-based stress analysis method for cylindrical orthotropic members with arbitrary cross-sections considering ring orientation",
    "publisher": "Institution of Structural Engineers. Published by Elsevier Ltd.",
    "volume": "80",
    "pages": "110109",
    "authors": [
      "Haien Xue",
      "Ying-Lei Li",
      "Xiao-Ling Zhao",
      "Liang Chen",
      "Si-Wei Liu"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Structures",
    "abstract": "The main objective of this study is to develop a novel finite element analysis (FEA) method for the stress analysis of cylindrical orthotropic members with arbitrary cross-sections made of timber and then extend it to engineered bamboo. These materials exhibit complex mechanical behavior described by both material anisotropy induced by ring orientation and geometric complexity associated with arbitrary cross-sectional shapes. The proposed approach introduces an orthotropic constant strain triangle (OCST) element, which offers high adaptability in meshing arbitrary shape of cross-sections while considering material anisotropy of cylindrical orthotropic members. The cross-sectional characteristic of timer is distinguished by an advanced cylindrically orthotropic material model. The torsional and shear properties of the orthotropic member are derived based on the assumption of Saint-Venant while considering complex loading conditions. The proposed methods have been programmed into the latest edition of the educational structural analysis software, MSASect2. The results of the present study are compared with established analytical and numerical solutions, followed by two sets of case studies to examine the effects of ring orientation and cross-sectional shape on the distribution of the stress.",
    "keywords": [
      "Cylindrical orthotropy",
      "Timber members",
      "Engineered bamboo",
      "Annual ring orientation",
      "Arbitrary cross-sections",
      "Stress analysis"
    ],
    "doi": "10.1016/j.istruc.2025.110109",
    "link": "https://doi.org/10.1016/j.istruc.2025.110109",
    "weblink": "https://www.sciencedirect.com/science/article/pii/S23520124251101093",
    "APA": "Xue, H., Li, Y.-L., Zhao, X.-L., Chen, L., & Liu, S.-W. (2025). Improved finite-element-based stress analysis method for cylindrical orthotropic members with arbitrary cross-sections considering ring orientation. Structures, 80, 110109.",
    "cv": "Xue, H., Li, Y.-L., Zhao, X.-L., Chen, L., & Liu, S.-W.* (2025). Improved finite-element-based stress analysis method for cylindrical orthotropic members with arbitrary cross-sections considering ring orientation. Structures, 80, 110109.",
    "publication-date": "2025-10"
  },
  {
    "id": "J.87",
    "year": "2025",
    "title": "Fatigue life prediction for corroded butt welds made of 1.4301 stainless steel and Q460 high-strength steel: Numerical analysis and new design rules",
    "publisher": "Institution of Structural Engineers. Published by Elsevier Ltd.",
    "volume": "80",
    "pages": "109825",
    "authors": [
      "Ran Feng",
      "Yang Yu",
      "Hieng Ho Lau",
      "Boshan Chen",
      "Xiaowei Deng",
      "Si-Wei Liu"
    ],
    "corresponding author": "Boshan Chen",
    "journal": "Structures",
    "abstract": "In a corrosive environment, the weld is highly susceptible to both corrosion and fatigue. This exposure can lead to the initiation of fatigue cracks and even result in the complete failure of structures. However, no established design guidelines were available for predicting the fatigue life of corroded butt welds made of 1.4301 stainless steel and Q460 high-strength steel. To address this, this study presents an extensive numerical analysis to develop a new fatigue life prediction model for corroded 1.4301 stainless steel and Q460 high-strength steel with transverse and longitudinal butt welds. Finite element (FE) models incorporating the material non-linearity and initial geometric imperfections obtained from the 3D scanning were developed and the accuracy of FE models was verified against the corresponding experimental findings. A detailed parametric study was subsequently undertaken using the validated FE models, and a total of 128 FE results were generated. Variables which were examined included the mass loss rate and the corrosion rate. The parametric study findings indicated that the fatigue life of corroded welds was significantly influenced by the mass loss rate. Finally, new prediction models for determining the fatigue life of corroded butt welds were proposed, which can establish the relationship between the mass loss rate and the fatigue life. The newly proposed prediction model can closely predict the fatigue life of corroded welds made of two materials.",
    "keywords": [
      "Butt weld",
      "Corroded",
      "Fatigue life prediction",
      "Finite element (FE) analysis",
      "Q460 high-strength steel",
      "1.4301 stainless steel"
    ],
    "doi": "10.1016/j.istruc.2025.109825",
    "link": "https://doi.org/10.1016/j.istruc.2025.109825",
    "weblink": "https://www.sciencedirect.com/science/article/pii/S2352012425109825",
    "APA": "Feng, R., Yu, Y., Lau, H. H., Chen, B., Deng, X., & Liu, S.-W. (2025). Fatigue life prediction for corroded butt welds made of 1.4301 stainless steel and Q460 high-strength steel: Numerical analysis and new design rules. Structures, 80, 109825.",
    "cv": "Feng, R., Yu, Y., Lau, H. H., Chen, B.*, Deng, X., & Liu, S.-W. (2025). Fatigue life prediction for corroded butt welds made of 1.4301 stainless steel and Q460 high-strength steel: Numerical analysis and new design rules. Structures, 80, 109825.",
    "publication-date": "2025-10"
  },
  {
    "id": "J.88",
    "year": "2025",
    "title": "Investigating temperature effects on the natural frequency of the hidden frame glass curtain wall’s panel units",
    "publisher": "Elsevier Ltd.",
    "volume": "112",
    "pages": "113648",
    "authors": [
      "Kun Jiang",
      "Danguang Pan",
      "Ying Huang",
      "Wenjing Ouyang",
      "Si-Wei Liu"
    ],
    "corresponding author": "Danguang Pan",
    "journal": "Journal of Building Engineering",
    "abstract": "As the facade of buildings, the glass curtain wall is always exposed to the outside environment. Temperature can significantly impact the dynamic characteristics of the panel unit (PU). However, the mechanism by which temperature influences natural frequencies remains unclear. This paper investigates the effects of temperature on the elastic modulus of structural sealant and the natural frequency of PU of the hidden frame glass curtain wall. 24 specimens with the dimension of 12 mm × 12 mm × 50 mm were fabricated and conducted tensile tests at the temperature ranged from −20 ◦C to 50 ◦C to investigate the variations of elastic modulus of structural sealant with temperature. Two full-size PUs were cyclic heated by 6 electric heaters and tested to identify the instantaneous frequencies of the temperature-varying PUs. The results indicate that when the temperature increased from −20 ◦C to 50 ◦C, and the elastic modulus of the structural sealant decreased by 57.3 %. The natural frequencies of the PU decrease with increasing temperature. Two panel units, with an average change of −0.189 % and −0.205 % in the first eight frequencies at each degree Celsius. Then, the finite element method is used to analyze the test specimen and illustrate the mechanism of the temperature’s influence. The numerical analysis results show that the elastic modulus of structural sealant is temperature-dependent and primarily drives the changes in the natural frequencies of the PU under varying temperatures. The influence of temperature on the dynamic characteristics is related to the height-width ratio of the PU. The rate of natural frequency with respect to temperature increases with the increase of the height-width ratio of the PU until the height-width ratio reaches 3. These findings can provide insights to guide the maintenance of the PUs on the hidden frame glass curtain wall in practice, especially where temperature varies significantly under weather or over seasons.",
    "keywords": [
      "Glass curtain wall",
      "Temperature-varying panel unit",
      "Experimental modal analysis",
      "Temperature effect"
    ],
    "doi": "10.1016/j.jobe.2025.113648",
    "link": "https://doi.org/10.1016/j.jobe.2025.113648",
    "weblink": "https://www.sciencedirect.com/science/article/pii/S2352710225113648",
    "APA": "Jiang, K., Pan, D., Huang, Y., Ouyang, W., & Liu, S.-W. (2025). Investigating temperature effects on the natural frequency of the hidden frame glass curtain wall’s panel units. Journal of Building Engineering, 112, 113648.",
    "cv": "Jiang, K., Pan, D.*, Huang, Y., Ouyang, W., & Liu, S.-W. (2025). Investigating temperature effects on the natural frequency of the hidden frame glass curtain wall’s panel units. Journal of Building Engineering, 112, 113648.",
    "publication-date": "2025-10"
  },
  {
    "id": "J.89",
    "year": "2025",
    "title": "Refined FE-based cross-section analysis for line element simulation of WAAM steel members considering anisotropy",
    "publisher": "Institution of Structural Engineers. Published by Elsevier Ltd.",
    "volume": "81",
    "pages": "110236",
    "authors": [
      "Hao-Yi Zhang",
      "An-Rui Liang",
      "Si-Wei Liu",
      "Yao-Peng Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Structures",
    "abstract": "Wire-arc additive manufacturing (WAAM) has emerged as a promising technique for fabricating large-scale 3D-printed steel structures. However, the development of its full potential is constrained by the current line element-based second-order analysis method for steel structures, which fails to account for the material anisotropy inherent in WAAM. This study addresses this limitation by reformulating the cross-sectional properties utilized in line elements, incorporating an anisotropic material model that accounts for the effect of the printing direction. A 2D finite element analysis (FEA) is employed for numerical solutions of the cross-sectional properties, which are then implemented into a 7-degrees-of-freedom (DOF) Timoshenko line element. The proposed method is validated through comparisons with benchmark results from sophisticated finite element analyses (SFEA). This research provides a novel approach to accurately model WAAM steel members in second-order analysis, which has been incorporated into the MSASect2 software for both research and educational purposes.",
    "keywords": [
      "Cross-section analysis",
      "Anisotropic material",
      "Line element",
      "Wire-arc additive manufacturing",
      "Steel structures"
    ],
    "doi": "10.1016/j.istruc.2025.110236",
    "link": "https://doi.org/10.1016/j.istruc.2025.110236",
    "weblink": "https://www.sciencedirect.com/science/article/pii/S23520124251102363",
    "APA": "Zhang, H.-Y., Liang, A.-R., Liu, S.-W., Liu, Y.-P., & Chan, S.-L. (2025). Refined FE-based cross-section analysis for line element simulation of WAAM steel members considering anisotropy. Structures, 81, 110236.",
    "cv": "Zhang, H.-Y., Liang, A.-R., Liu, S.-W.*, Liu, Y.-P., & Chan, S.-L. (2025). Refined FE-based cross-section analysis for line element simulation of WAAM steel members considering anisotropy. Structures, 81, 110236.",
    "publication-date": "2025-11"
  },
  {
    "id": "J.90",
    "year": "2025",
    "title": "Initial geometric imperfections of modules in modular integrated construction structures",
    "publisher": "Elsevier Ltd.",
    "volume": "344",
    "pages": "121406",
    "authors": [
      "Yue-Yang Ding",
      "Yao-Peng Liu",
      "Si-Wei Liu",
      "Yi-Qun Tang",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Yao-Peng Liu",
    "journal": "Engineering Structures",
    "abstract": "Modular Integrated Construction (MiC) structures possess unique sources of initial geometric imperfections that differ significantly from those found in traditional steel structures. Conventional design approaches, which often focus on element-level or non-structural deviations, fail to adequately capture these module-level imperfections, potentially leading to substantial errors in structural assessment and design. This study addresses this critical gap by proposing mathematical models that characterize module-level imperfections based on localized manufacturing tolerances. The effectiveness of the models is validated through Monte Carlo simulations, which establish clear relationships among allowable tolerances, module dimensions, and geometric deviations. By enabling the direct consideration of initial imperfections at the modular unit level, the proposed method fully leverages the high-precision nature of MiC and supports efficient structural design using the Direct Analysis Method (DAM) without reliance on the effective length method. Furthermore, the statistical analysis of manufacturing tolerances provides a foundation for setting appropriate precision requirements to ensure desired module quality. This approach offers a practical and reliable solution for the performance-based design of MiC structures.",
    "keywords": [
      "Modular integrated construction",
      "Monte-Carlo simulation",
      "Localized geometric deviations",
      "Geometric imperfections"
    ],
    "doi": "10.1016/j.engstruct.2025.121406",
    "link": "https://doi.org/10.1016/j.engstruct.2025.121406",
    "weblink": "https://www.sciencedirect.com/science/article/pii/S0141029625014063",
    "APA": "Ding, Y.-Y., Liu, Y.-P., Liu, S.-W., Tang, Y.-Q., & Chan, S.-L. (2025). Initial geometric imperfections of modules in modular integrated construction structures. Engineering Structures, 344, 121406.",
    "cv": "Ding, Y.-Y., Liu, Y.-P.*, Liu, S.-W., Tang, Y.-Q., & Chan, S.-L. (2025). Initial geometric imperfections of modules in modular integrated construction structures. Engineering Structures, 344, 121406.",
    "publication-date": "2025-12"
  },
  {
    "id": "J.91",
    "year": "2026",
    "title": "Physics-informed deep operator networks for rapid nonlinear analysis of glass panes under variable wind-induced loads",
    "publisher": "Elsevier Ltd.",
    "volume": "346",
    "pages": "121584",
    "authors": [
      "Wenjing Ouyang",
      "Weihang Ouyang",
      "Danguang Pan",
      "Si-Wei Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Si-Wei Liu",
    "journal": "Engineering Structures",
    "abstract": "The structural analysis of glass panes under variable and non-uniform wind-induced loads is critical for optimizing building design and enabling proactive structural monitoring. The geometric nonlinearity of glass panes, governed by the Föppl-von Kármán (FvK) equations, poses significant computational challenges due to the complexity of solving high-order partial differential equations (PDEs). While Physics-Informed Neural Networks (PINNs) effectively embed physical laws to solve PDEs, their limited generalization across diverse loading conditions often necessitates retraining. Conversely, Deep Operator Networks (DeepONets) map input functions to response fields and perform inference in milliseconds without retraining, but the data-driven DeepONets require large labeled datasets. This study introduces a Physics-Informed Deep Operator Network (PI-DeepONet) framework that combines operator learning with physical constraints to solve the FvK equations, significantly reducing data dependency while maintaining robust generalization to unseen load scenarios. By incorporating hard constraints, the framework ensures precise enforcement of boundary conditions and reduces the order of FvK equations, enhancing training stability and efficiency. Computing derivatives using finite difference and reusing branch network outputs during training further improve computational efficiency. Numerical experiments demonstrate that PI-DeepONet achieves accuracy comparable to traditional finite element methods while performing inference in 2 ms, enhancing the computational efficiency of uncertainty analysis by orders of magnitude. This enables rapid performance evaluation and supports resilient structural design under diverse wind conditions, offering a transformative approach for glass pane analysis and other thin-plate structures.",
    "keywords": [
      "Physics-informed Neural Networks (PINN)",
      "Deep Operator Network (DeepONet)",
      "Glass pane",
      "Hard constraints",
      "Nonlinear analysis"
    ],
    "doi": "10.1016/j.engstruct.2025.121584",
    "link": "https://doi.org/10.1016/j.engstruct.2025.121584",
    "weblink": "https://www.sciencedirect.com/science/article/pii/S0141029625019753",
    "APA": "Ouyang, W., Ouyang, W., Pan, D., Liu, S.-W., & Chan, S.-L. (2026). Physics-informed deep operator networks for rapid nonlinear analysis of glass panes under variable wind-induced loads. Engineering Structures, 346, 121584.",
    "cv": "Ouyang, W., Ouyang, W., Pan, D., Liu, S. W.*, & Chan, S. L. (2026). Physics-informed deep operator networks for rapid nonlinear analysis of glass panes under variable wind-induced loads. Engineering Structures, 346, 121584.",
    "publication-date": "2026-01"
  },
  {
    "id": "J.92",
    "year": "2026",
    "title": "Seismic performance and failure analysis of prefabricated structural-insulated CFS-foam concrete walls with strawboard sheathing",
    "publisher": "Elsevier Ltd.",
    "volume": "183",
    "pages": "110194",
    "authors": [
      "Xiaomeng Ding",
      "Jiaheng Zhang",
      "Si-Wei Liu",
      "Zhongfan Chen"
    ],
    "corresponding author": "Xiaomeng Ding",
    "journal": "Engineering Failure Analysis",
    "abstract": "A novel prefabricated composite wall system, integrating foam concrete (FC)-infilled cold-formed steel (CFS) with strawboard sheathing (FC-CFS-SS), is proposed to achieve synergistic structural and thermal performance. This system combines the load-bearing capacity of CFS, the insulating properties of FC and strawboard sheathing, and the sustainable use of agricultural straw, ensuring both mechanical integrity and energy efficiency. Thermal analysis indicates that a 216 mm thick wall with 80 mm CFS studs and 700 kg/m3 foam concrete attains 65 % compliance with energy efficiency standards in hot-summer/cold-winter climate zones. Quasi-static cyclic tests revealed a shear-dominated failure mechanism, characterized by a well-defined sequence: damage initiated as localized wrinkling and subsequent tearing of the strawboard sheathing around screw connections, accompanied by extensive diagonal cracking in the FC infill due to shear stresses, eventually involving the CFS frame in a multi-stage, ductile energy-dissipating process. The walls exhibited pinched yet stable hysteresis loops, with progressive stiffness and strength degradation and nonlinear skeleton curves lacking distinct yield plateaus, indicating satisfactory energy dissipation capacity. Parametric studies ranked the influence of key factors on lateral capacity: the presence of FC, wall thickness, sheathing configuration, and FC strength, with increased wall thickness providing synergistic enhancement to both thermal and seismic behavior. Finally, comparative evaluation with existing foam concrete-infilled wall systems confirmed the FC-CFS-SS wall system’s balanced multi-performance, supporting its potential in sustainable prefabricated construction.",
    "keywords": [
      "Cold-formed steel (CFS) composite walls",
      "Foam concrete",
      "Seismic behaviour",
      "Structural-insulated synergy",
      "Failure mechanism"
    ],
    "doi": "10.1016/j.engfailanal.2025.110194",
    "link": "https://doi.org/10.1016/j.engfailanal.2025.110194",
    "weblink": "https://www.sciencedirect.com/science/article/abs/pii/S1350630725009355",
    "APA": "Ding, X., Zhang, J., Liu, S.-W., & Chen, Z. (2026). Seismic performance and failure analysis of prefabricated structural-insulated CFS-foam concrete walls with strawboard sheathing. Engineering Failure Analysis, 183, 110194.",
    "cv": "Ding, X.*, Zhang, J., Liu, S.-W., & Chen, Z. (2026). Seismic performance and failure analysis of prefabricated structural-insulated CFS-foam concrete walls with strawboard sheathing. Engineering Failure Analysis, 183, 110194.",
    "publication-date": "2026-01"
  },
  {
    "id": "J.93",
    "year": "2026",
    "title": "Low-cycle fatigue of laser-arc hybrid welded S960 high-strength steel joints",
    "publisher": "Elsevier Ltd.",
    "volume": "236",
    "pages": "110040",
    "authors": [
      "Ziyi Zeng",
      "Guanhua Li",
      "Si-Wei Liu",
      "De-Hong Huang",
      "Yao-Peng Liu",
      "Siu-Lai Chan"
    ],
    "corresponding author": "Yao-Peng Liu",
    "journal": "Journal of Constructional Steel Research",
    "abstract": "High-strength steel (HSS), particularly grade S960, has gained increasing attention in structural engineering due to its superior strength-to-weight ratio, enabling sustainable and lightweight structural design. However, conventional methods like gas metal arc welding (GMAW) often cause cracking, distortion and fatigue issues in high-strength steels. In contrast, high-power laser-arc hybrid welding (LAHW) offers a reliable alternative with reduced heat input and greater precision. However, its low-cycle fatigue behavior in HSS joints remains underexplored. This study investigates the monotonic and low-cycle fatigue behavior of S960 HSS and its welded joints fabricated using LAHW and GMAW. Tensile and low-cycle fatigue tests were conducted to evaluate strength retention, ductility, and energy dissipation. A nonlinear Chaboche kinematic hardening model was calibrated using experimental data to simulate cyclic plasticity behavior in finite element simulations. The results indicate that LAHW joints retain up to 96 % of the strength of base metal and exhibit superior low-cycle energy dissipation compared to GMAW joints. The proposed model can accurately capture the cyclic stress–strain responses of both the base metal and LAHW joints. This research provides experimental and numerical insights into the fatigue performance of laser-arc hybrid welded S960 HSS, enabling its application in fatigue-prone structural components and promoting the broader use of HSS in modern construction.",
    "keywords": [
      "High-strength steel",
      "Laser-arc hybrid welding",
      "Low-cycle fatigue behavior",
      "Chaboche model",
      "Finite element simulation"
    ],
    "doi": "10.1016/j.jcsr.2025.110040",
    "link": "https://doi.org/10.1016/j.jcsr.2025.110040",
    "weblink": "https://www.sciencedirect.com/science/article/pii/S0143974X25100403",
    "APA": "Zeng, Z., Li, G., Liu, S.-W., Huang, D.-H., Liu, Y.-P., & Chan, S.-L. (2026). Low-cycle fatigue of laser-arc hybrid welded S960 high-strength steel joints. Journal of Constructional Steel Research, 236, 110040.",
    "cv": "Zeng, Z., Li, G., Liu, S.-W., Huang, D.-H., Liu, Y.-P.*, & Chan, S.-L. (2026). Low-cycle fatigue of laser-arc hybrid welded S960 high-strength steel joints. Journal of Constructional Steel Research, 236, 110040.",
    "publication-date": "2026-01"
  }
]